{"count":1262,"next":null,"previous":"https://summerofcode.withgoogle.com/api/program/current/project/?page=6&page_size=200","results":[{"id":6647858732728320,"title":"A way to associate listens with MBIDs","subcategory":"","organization":{"id":5727679911821312,"name":"MetaBrainz Foundation Inc.","slug":"metabrainz-foundation-inc","website_url":"https://metabrainz.org","category":"data_and_databases","contact_email":"support@metabrainz.org","mailing_list":"https://community.metabrainz.org/","irc_channel":"https://metabrainz.org/contact","tagline":"Curating open data sets with open source softer and loads of volunteers.","precis":"The MetaBrainz Foundation is a non-profit that believes in free, open access to data. It builds community maintained databases for the public domain or Creative Commons licenses.","description":"The MetaBrainz Foundation is a non-profit that believes in free, open access to data. It has been set up to build community maintained databases and make them available in the public domain or under Creative Commons licenses.\n\nOur data is mostly gathered by volunteers and verified by peer review to ensure it is consistent and correct. All non-commercial use of this data is free, but commercial users are asked to support us in order to help fund the project. We encourage all data users to contribute to the data gathering process so that our data can be as comprehensive as possible.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/xvZY_s1qERltlQwlbBiCkjFwMV-jwDJVT6bEipJsbrl48tJLQG2veTrbMLIwCyvyo930AAoMNyxqXo9YIY_yW9IsQqD0aQ","image_bg_color":"ffffff","gplus_url":null,"twitter_url":"https://twitter.com/metabrainz","blog_url":"https://blog.musicbrainz.org","application_instructions":"We require very detailed proposals and we insist that you work with our community to improve your application. Tell us everything about your proposed project. Include diagrams to help us understand your proposal. If you propose anything that requires a database schema you need to show us the proposed schema. The same applies to UI changes/additions -- we need to see mock-ups. If you provide no mock-ups, schemas or supporting diagrams, you won't be accepted.\n\nAs part of applying for SoC we require that you take your idea and propose it to the MusicBrainz developer community. Please propose the idea and then respond to any  questions that may arise. Improve your proposal based on the feedback you receive from the community. If you cannot  get the community to support your idea your chances for getting your proposal accepted are very slim. Finally, in order to have your GSoC application be accepted by MetaBrainz you MUST interact with your potential mentor and submit one bug fix or new feature that is related to your proposal. You will need to create a schedule of how you plan to spend your time. A weekly breakdown with a few milestones is best.\n\nDo you have Github , Twitter or any other public profiles you think we might find interesting?\nHave you contributed to other Open Source projects or created projects on your own time? If so, which projects and can we see some of your code?\nDo you plan to have a job or study during the summer in conjunction with Summer of Code?","topic_tags":["music","metadata","big data","community"],"technology_tags":["python","perl","javascript","postgresql","react"],"proposal_tags":["schema","diagram","community","bug fixes","details"],"ideas_list":"https://wiki.musicbrainz.org/Development/Summer_of_Code/2018","contact_method":"support@metabrainz.org","program_year":2018},"student":{"id":6657715347128320,"display_name":"Kartikeya Sharma","program_year":2018},"abstract":"Currently Listenbrainz uses MSIDs (Messybrainz-ID) for retrieving useful user stats (e.g. [user listens](https://beta.listenbrainz.org/user/iliekcomputers/artists)). Now ListenBrainz also plans to generate data which could be used by MusicBrainz to show useful information like artist popularity. MusicBrainz has MBIDs (MusicBrainz-ID) associated with each artist, recording, and release. In order to provide MusicBrainz with the ability to access information based on MBIDs, we have to associate recording_mbids, artist_mbids and release_mbids to the listens where we can. For most of the listens we don’t have artist_mbids and relesae_mbids associated with them. But have recording_mbids associated with them. So, now I plan to associate MBIDs to MSIDs.","assignee_display_names":["Robert Kaye"],"program_year":2018},{"id":6648138106929152,"title":"Build a Service for Adaptive content and Learning supports","subcategory":"fluid","organization":{"id":6584170814373888,"name":"Inclusive Design Institute","slug":"inclusive-design-institute","website_url":"http://inclusivedesign.ca","category":"end_user_applications","contact_email":null,"mailing_list":"https://wiki.fluidproject.org/display/fluid/Mailing+Lists","irc_channel":"https://wiki.fluidproject.org/display/fluid/IRC+Channel","tagline":"The IDI addresses the challenge of designing ICT to work for all potential users","precis":"The IDI is a generative hub of applied research that addresses the challenge of designing our ICT systems so that they consider the full range of human diversity.","description":"The [IDRC](http://idrc.ocadu.ca) is the lead organization of the [Inclusive Design Institute (IDI)](http://inclusivedesign.ca), a collaboration of eight Ontario post secondary institutions, together focusing on the development of inclusive information technology. The IDRC is primarily a research and development organization, part of the [Faculty of Design at OCAD University](http://www.ocadu.ca/academics/faculty-of-design.htm) in Toronto. Its primary mandate is to promote access to information and information technology for all. Many of its activities involve working with international and local standards groups to introduce accessibility related specifications into their developing standards. It is an organization made up of computer scientists, engineers, educators, and practitioners, who all work together to develop leading edge technologies that are inclusive of everyone.\n \nThe IDRC and IDI are not-for-profit organizations. They offer services for people with disabilities, providing guidance on issues related to learning, technology use, and access to information.","tags":[],"primary_open_source_license":"BSD 3-Clause \"New\" or \"Revised\" License (BSD-3-Clause)","image_url":"//lh3.googleusercontent.com/sc5rP6BsBQwT6XAsFs5I8jnN_bUEuzTBgMk0aNqWzGmMYfz322fSh5z8KoUVsC9UAIuZ-cXAesaYZ_sFfKApY24j6SpV10A3","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/FluidProject","blog_url":null,"application_instructions":"# IDI GSoC Student Application Template #\nStudents should submit their application using this template. Provide details about yourself, describing your approach to the project, and answer the questions that follow. Be creative in your application.\n## Introduction ##\nDescribe yourself; your goals, accomplishments, and anything else that might set you apart from others.\n## Education & Experience ##\nList your level of education and any courses you’ve taken that are relevant to the project.  Also describe the relevant experience and skills you will bring.\n## Project Plan ##\nBased on the summary description for your project of choice on the IDI GSoC Ideas page, describe how you would approach the project. Create a project plan (don’t just repeat what was stated on the Ideas page). Be sure to include deliverables for each phase and other interim deliverables where appropriate.\n \nProject Description (Lots of details)\nTimeline & Deliverables (Itemized list matching deliverables to dates) \nProject Outcome (What would you expect to be the final outcome of your project) \n## Questions: ## \n\n1.     How will you document your weekly progress?\n2.     How will you ensure your project code continues to be maintained, after GSoC?\n3.     What is your GitHub account?\n4.     Will you be working on your own, or will you have partners?","topic_tags":["accessibility","inclusivity","web","web applications","web development"],"technology_tags":["javascript","html","css","node.js","php"],"proposal_tags":["achecker","fluid","phet"],"ideas_list":"https://wiki.fluidproject.org/display/fluid/Google+Summer+of+Code+2018+with+the+Fluid+Project","contact_method":"https://wiki.fluidproject.org/display/fluid/IRC+Channel","program_year":2018},"student":{"id":6591253479686144,"display_name":"KUNAL MOHTA","program_year":2018},"abstract":"This project involves making a well-structured and easy to access web service, fetching data from other third-party services. As each third-party has its own format and method of providing the service, it becomes difficult for the Application Developers to fetch data from each one of them. This project will provide the developers with a common endpoint for various useful services, hence making the developers’ work easier. The service should be in the form of a REST-like API, which will be well-documented to help in future growth of the Service.\nThe services that will be achieved during this year's project are -\n- Dictionary Service\n- Language Translation Service","assignee_display_names":["Alan Harnum"],"program_year":2018},{"id":6648183808065536,"title":"Generalized Shape Detection","subcategory":"geometry","organization":{"id":6121660483108864,"name":"CGAL Project","slug":"cgal-project","website_url":"https://www.cgal.org","category":"science_and_medicine","contact_email":"gsoc-cgal@inria.fr","mailing_list":"http://www.cgal.org/mailing_list.html","irc_channel":null,"tagline":"C++ library of computational geometry and geometry processing","precis":"CGAL is a software project that provides easy access to efficient and reliable geometric algorithms in the form of a C++ library.","description":"CGAL is a software library that offers a number of reliable geometric data structures and algorithms. CGAL components operate in 2D and 3D, and sometime in arbitrary dimensions. Examples of components include convex hulls, convex decomposition, Delaunay triangulations, Voronoi diagrams, polygonal surface mesh data-structures, mesh generation, Boolean operations, envelope computations, intersection detection, surface reconstruction, and subdivision surfaces.\n\nCGAL is used in a variety of application domains such as CAD/CAM (computer aided design and modeling), GIS (geographic information systems), geophysics, image processing, molecular biology, robotics, motion planning, and graphics.\n\nCGAL is written in C++ and rigorously adheres to the generic-programming paradigm.\n\nCGAL became an Open Source project in 2003. Most of CGAL is under the GPL v3+ license, and some core parts are under the LGPL v3+. The semi-annual releases have currently about 10,000 downloads. CGAL is commercially supported by the spin-off company GeometryFactory.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/e1uDZ-a2-940fEVcmHf84gWIpVvTMClySFsHDz3I5dJZgVN6-itJL-oO_yPS_w27i5XOLsmOSRXTYgqg7TdXh7tQxfDHfH8","image_bg_color":null,"gplus_url":"https://plus.google.com/+CGALOrgProject","twitter_url":null,"blog_url":null,"application_instructions":"Select a project in the list and provide your personal and detailed description. If you wish to work on another idea of your own, we are pretty open as long as this serves the goal of consolidating CGAL as a whole. Provide a proposal of a technical solution with your envisioned methodology. The more detailed the better. Explain how the solution will be available to the user, in which form. Do not forget the documentation, unitary tests and cross-platform aspects. Provide a realistic schedule with objectives (one every two weeks for example) and deadlines. Focus on mid-term objectives as well as on the final evaluation.\n\n\nPersonal data:\n - First name, last name, affiliation and geographical location.\n - A brief list of the main studies and programming courses attended, with ranking. \n - List of the most important software projects contributed and success.\n - Which are your best skills in terms of programming and scientific computing?\n - In general what is your taste in terms of programming? language, methodology, team work, etc.\n - Is there anything that prevents you from working full time on the project during the program period?\n - How do you see your involvement after the program ends? Do you see yourself pushing the project further, or do you see yourself contributing to other CGAL projects?\n - Are you more interested in the theory/scientific aspect of CGAL, or do you feel more like a hacker?\n - What are your long-term wishes in terms of job?","topic_tags":["computational geometry","geometry","mesh processing","arrangement","webhook"],"technology_tags":["c++","github","git"],"proposal_tags":["mesh processing","qt5","arrangement","barycentric coordinates","point set processing","geometry"],"ideas_list":"https://github.com/CGAL/cgal/wiki/Project-Ideas","contact_method":"gsoc-cgal@inria.fr","program_year":2018},"student":{"id":5715796068663296,"display_name":"Thien Hoang","program_year":2018},"abstract":"The goal of the project is to expand the availability of the RANSAC algorithm and the Region Growing algorithm to the 2D space and add more flexibility for the Region Growing module in terms of input. Delivered with the project is necessary documents for users, maintainers, and testers. The proposal discusses the requirements of the project, anticipated constraints, and the development schedule. Also included with the proposal is personal information regarding my academic background and my commitment with CGAL.","assignee_display_names":["Dmitry Anisimov"],"program_year":2018},{"id":6650204523069440,"title":"APDE Beta Push","subcategory":"android","organization":{"id":4915113891463168,"name":"The Processing Foundation","slug":"the-processing-foundation","website_url":"http://processingfoundation.org","category":"languages","contact_email":"foundation@processing.org","mailing_list":null,"irc_channel":"https://forum.processing.org/two/categories/summer-of-code-2018","tagline":"Our goal is to empower people of all backgrounds to learn how to program.","precis":"The Processing Foundation’s mission is to promote software literacy and visual literacy — and to make these fields accessible to diverse communities.","description":"The Processing Foundation was founded in 2012 after more than a decade of work with the original Processing software. The Foundation’s mission is to promote software literacy within the visual arts, and visual literacy within technology-related fields — and to make these fields accessible to diverse communities. Our goal is to empower people of all interests and backgrounds to learn how to program and make creative work with code, especially those who might not otherwise have access to these tools and resources.\n\nWe do this by developing and distributing a group of related software projects, which includes [Processing (Java)](http://processing.org), [p5.js (JavaScript)](http://p5js.org), and [Processing.py (Python)](http://py.processing.org/), and facilitating partnerships and collaborations with allied organizations and individuals, to build a more diverse community around software and the arts.\nThe Processing Foundation is specifically invested in expanding the communities of technology and the arts to include and support those who have not had equal access because of their race, gender, class, sexuality, and/or ability. We sponsor a Fellowship Program that funds exploratory, creative, and technical research; support an Advocacy Program, which focuses on nurturing diverse communities and their specific projects; produce public events that provide platforms for collaboration between our contributors; and take part in panels and talks that spread the word about the need for diversity in these fields.\n\nAt our core is the philosophy and politics of free, libre, open-source software. We see software as a medium, something that connects two things. We view it as a means for thinking and making. We believe it should be free. We believe that learning to program is not about acquiring a certain skill set, but is instead a creative and exploratory process. We believe software, and the tools to learn it, should be accessible to everyone. We believe software literacy and an understanding of media of all kinds is essential knowledge for today.","tags":[],"primary_open_source_license":"GNU Library or \"Lesser\" General Public License version 2.1 (LGPL-2.1)","image_url":"//lh3.googleusercontent.com/xbNNxmOK9vsF1Nh34aDV_VJQHzEOSgCleG99BfkwL48oanpg9NFAiPxkEUp_j19nryhNnU_EgvRv02R1AcLeHNLg6IHEFic","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/processingorg","blog_url":"https://medium.com/@processingorg","application_instructions":"Thanks for your interest in the Processing Foundation! We accept proposals for projects related to core development as well as libraries / add-ons for Processing, Processing for\nAndroid, p5.js, and Python Mode. The first thing you should do is read over the [Project List wiki page on github](https://github.com/processing/processing/wiki/Project-List). There you'll find links to all of the relevant github repositories as well as lists of topics and projects for which we are actively seeking help. If you have questions about an idea or need guidance on forming your proposal, please post to the [Processing Forum](https://forum.processing.org/two/categories/summer-of-code-2018).\n \nFor GSoC, we actively seek help with features we know we need, but also look to applicants to propose ideas we haven't thought of ourselves. If you have an idea for a new feature for any of our environments, it's generally preferable to propose it as a library or mode so that it can be developed and tested as a standalone project. For all of our projects, it's incredibly important that things are kept as simple and user-friendly as possible. Our work is not for developers. It's for people who are less familiar with code, and/or just want to get things done. We're far less interested in features to make the environments more powerful for advanced users than we are in features that make it easier to handle tasks that are common for a wide range of our audience. \n\nYou should feel free to propose your idea however you see fit. If you are looking for guidance, [here is a proposal template](https://docs.google.com/document/d/1UFcWh2IWqhICh4YIFNwtKUaWWXifaBB67rjPxbYzjbE/edit?usp=sharing).","topic_tags":["creative coding","graphics","design","education","web"],"technology_tags":["java","javascript","python","android","opengl"],"proposal_tags":["processing","p5.js","p5.js web editor","python","android","sound","pde","arm","opengl","library"],"ideas_list":"https://github.com/processing/processing/wiki/Project-List","contact_method":"foundation@processing.org","program_year":2018},"student":{"id":5883652316069888,"display_name":"William Smith","program_year":2018},"abstract":"APDE (Android Processing Development Environment) is a fully-functional IDE for creating Processing sketches on Android devices, but it is in need of improvements to keep it up-to-date with the desktop version of Processing and to improve its accessibility to new users. The proposed project seeks to accomplish these goals by upgrading to Processing’s Android mode 4.0, supporting wallpapers, watchfaces, and Cardboard apps, creating a simple tutorial system, and implementing incremental compilation.","assignee_display_names":["Sara Di Bartolomeo"],"program_year":2018},{"id":6653249118011392,"title":"Star Trek Engine","subcategory":"new game engine","organization":{"id":5830375113228288,"name":"ScummVM","slug":"scummvm","website_url":"https://scummvm.org/","category":"end_user_applications","contact_email":"admin@scummvm.org","mailing_list":"http://wiki.scummvm.org/index.php/Summer_of_Code/GSoC_Contact","irc_channel":"http://wiki.scummvm.org/index.php/Summer_of_Code/GSoC_Contact","tagline":"ScummVM is a GSoC umbrella for game preservation projects","precis":"ScummVM is a GSoC umbrella for game preservation projects focused on reliving games by providing a replacement for their executables on modern platforms.","description":"Since 2014, ScummVM acts as a GSoC umbrella for game preservation projects, such as its sister project, ResidualVM. The purpose is only to replace the game executable, not to enhance or replace the game assets.\n\nScummVM is a collection of game engines for playing classic graphical point-and-click adventure games on modern hardware. Recently we have also started adding engines for RPG games.\n\nResidualVM is a sister project of ScummVM games and was created in 2003. ResidualVM shares large blocks of common code with ScummVM, some developers and even a mentor.\n\n- ScummVM supports classic 2D adventure games such as Monkey Island, Simon the Sorcerer, Space Quest, and many more. We have also started work to support 2D RPG games such as Dungeon Master. To this end, the Virtual Machines (called Engines) are complete reimplementations in C++ of the engines used in the original games. The number of engines is constantly growing thanks to a very agile and diversified development team and ScummVM is currently able to run more than 200 games. The VM approach followed by ScummVM results in efficient code, which has been ported to numerous Operating Systems (over 30). ScummVM has a highly productive team of about 45 currently active developers (out of an all-time pool of over 130), working together on a codebase of 2,800,000 lines of code. In addition ScummVM has many non-developer contributors, and a huge and highly active community.\n\n- ResidualVM is a cross-platform 3D game interpreter which allows you to play some 3D adventure games, such as Cyan's Myst 3 and LucasArts' Lua-based 3D adventures: Grim Fandango and Escape from Monkey Island, provided you already have their data files. Like ScummVM, ResidualVM replaces the executables shipped with the games, allowing you to play them on systems for which they were never designed.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/-tVNjCf8UdDSoDFI8lYQLpCHMzU37XCOAEc1Ni8_43GRFi8VefSF-JxfxuatcMvDnovYU3yawHovy1x_gk1ex9b14uWE7Pk","image_bg_color":"ff7f00","gplus_url":"https://plus.google.com/100512255374893262465","twitter_url":"https://twitter.com/scummvm","blog_url":"http://planet.scummvm.org/","application_instructions":"Your application has two important purposes: It should clearly identify the goals of your project, and it should convince us that you are the right person for this task.\n\nIn particular, your application is your opportunity to show us that you understand what you'll be doing for the task, and to demonstrate that you've spent some time thinking about it, its difficulties, strategies for overcoming these, and have a good estimate of how much time they will take. Based on that, we will ask you a realistic planning for the 12 weeks of GSoC, including the deliverables expected at mid-term and at the end of the GSoC. In order to be complete, we also expect you to make a pull request, for example for a bug fix. The purpose is to ensure you know how to use Git, and that you had a look at our coding conventions.\n\nWe don't expect you to produce a perfect application without any help at all. We strongly encourage you to discuss your plans and your application with us while you're preparing it, to ensure your ideas align well with our own thoughts on the tasks, and that your objectives are achievable. It is also the perfect chance to already get to know your potential mentors and the rest of the team. Don't hesitate to join the IRC channels and ask questions: keep in mind that there are no stupid questions!\n\nIn order to help you structure your application, we summarized our requirements in a template: http://wiki.scummvm.org/index.php/GSoC_Application","topic_tags":["games","game engines","software preservation"],"technology_tags":["c++","opengl","sdl","assembly"],"proposal_tags":["new game engine","scummvm","residualvm","roguevm","refactoring"],"ideas_list":"http://wiki.scummvm.org/index.php/Summer_of_Code/GSoC_Ideas_2018","contact_method":"admin@scummvm.org","program_year":2018},"student":{"id":5639169288699904,"display_name":"Matthew Stewart","program_year":2018},"abstract":"This will be an implementation of the engine used by Star Trek: 25th Anniversary and Star Trek: Judgment Rites, two DOS games made by Interplay in the early 1990s.","assignee_display_names":["Paul Gilbert","Arnaud Boutonné"],"program_year":2018},{"id":6654427885207552,"title":"VLCMediaLibraryKit Integration","subcategory":"","organization":{"id":6266517230977024,"name":"VideoLAN","slug":"videolan","website_url":"https://www.videolan.org","category":"graphics","contact_email":"videolan@videolan.org","mailing_list":"https://mailman.videolan.org/listinfo/vlc-devel","irc_channel":"https://www.videolan.org/support/","tagline":"Open Source Multimedia everywhere","precis":"Open source multimedia, for everyone, everywhere.","description":"The VideoLAN project is lead and composed of a team of volunteers, that believes in the power of open source when dealing with multimedia.\n\nWe are known for developing and publishing the widely used VLC media player playing almost everything everywhere. Additionally, we provide advanced tools for multimedia processing as well as libraries for use in third party applications.\n\nOur latest addition to our cone family is the VideoLAN Movie Creator, a non-linear movie editor based on VLC technology and in the spotlight of this year's GSoC participation alongside interesting ports to embedded and mobile devices.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/2LcJbfKqNQTly5thdKhej7Vy5R3STwSh02PtjXTR6ZUOqOzMicbN2eHp_wAiTTIoN108eLm-LYIvnIN15nVxAZywWGNw7VAv","image_bg_color":null,"gplus_url":"https://plus.google.com/+vlc","twitter_url":"https://twitter.com/videolan","blog_url":"http://planet.videolan.org","application_instructions":"# Application\n\nIn order to apply to a VideoLAN related project, it is important that you reach us to discuss your proposal, so that we can help you in the application process.\n\nIn your application, please be short with your proposal and straight to the point. We value a lot quality over quantity. We care more about competence than resume.\nIf you have any UI related ideas, please share some sketches (even paper-based photos).\n\nBefore the project starts, we will ask you to provide a patch, to be sure that you are not blocked on development setup.\n\nIf you have a doubt, are not sure about anything or want clarification, please get in touch with us, as soon as possible: we're nice.","topic_tags":["multimedia","audio","video","3d","vr"],"technology_tags":["c","c++","go","vue.js"],"proposal_tags":["server","client","ui","web","new feature","original idea"],"ideas_list":"https://wiki.videolan.org/SoC_2018/","contact_method":"videolan@videolan.org","program_year":2018},"student":{"id":5839925723791360,"display_name":"Soomin Lee","program_year":2018},"abstract":"## Overview\nThe overall goal is to integrate [VLCMediaLibraryKit](https://code.videolan.org/videolan/VLCMediaLibraryKit) to VLC-iOS and remove the usage of the old MediaLibraryKit.\n\n## Technologies\n- Objective-C\n- Swift","assignee_display_names":["Carola Nitz","Hugo Beauzée-Luyssen"],"program_year":2018},{"id":6656424709455872,"title":"Open Civic Data Tools","subcategory":"crowdsourcing","organization":{"id":5379780178870272,"name":"Open States","slug":"open-states","website_url":"https://openstates.org","category":"other","contact_email":"contact@openstates.org","mailing_list":null,"irc_channel":"https://openstates-slack.herokuapp.com/","tagline":"Open Source State Legislative Data","precis":"Open States is a collection of tools and APIs that make it possible for people to track and engage with what is happening in their state's capitol.","description":"Open States is a project that makes it possible for people to track and engage with what is happening in their state's capitol.\n\nVia a system of custom crawlers for each state legislature, we collect information on state governments: bills, votes, committees, events, and legislators. This information allows journalists, academics, activists, and concerned citizens track what is happening in their state, and engage with their elected officials.\n\nThis information is then made available via OpenStates.org, the Open States API, and bulk downloads. The site and data are used by journalists, activists, academics, and everyday citizens interested in keeping track of their elected officials.\n\nOriginally a project of the Sunlight Foundation, Open States became an independent project in late 2016 and is now under the 501(c)(3) umbrella of the Open Media Foundation.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/nu51z6QaV-UJxy3KZ4dVR-huhfj0BKkgVn_TX_aK8yKMlavjYw8QZmNuaH0ALkbz0WYqMkdZPo9y_S7kATGU3cNj3EEQlE4","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/@openstates","blog_url":"https://blog.openstates.org","application_instructions":"When applying please be sure to include your GitHub and Slack handle, hopefully you will have engaged with us in both locations by the time we're reviewing your application so we'd like to be sure we connect your real name to your handle.\n\nHere's what we're looking for:\n\n- You come to us with a well-defined task that will improve Open States (see ideas section below).\n- Your idea seems achievable within the 3 month GSoC period (May-August).\nNote: If your idea is too big but you would like to work on it beyond the end of the GSoC period feel free to figure out a concrete portion to propose for the summer and elaborate on how you'd potentially continue it afterwards. We're glad to discuss options.\n- Show us who you are and why you're well-suited to work with us. GitHub profiles are great, a PR or two would also be terrific. Or jump on our Slack and introduce yourself.\n- Please include a rough schedule of what you'd expect to do in the first, second, and third months.\n- Commit to a once-a-week minimum check-in with your mentor. Vacations, etc. are fine but we'll want to meet as often as possible to ensure success.\n\nSee https://github.com/openstates/meta/wiki/GSoC-2018-Overview#students for more details\n\nPlease tag your proposal with an appropriate tag from the ideas page.","topic_tags":["civic tech","scraping","web","government"],"technology_tags":["python","django","react","graphql","postgresql"],"proposal_tags":["legislative-alerts","openstates-org","crowdsourcing","text-analysis","other"],"ideas_list":"https://github.com/openstates/meta/wiki/GSoC-2018-Overview#ideas","contact_method":"contact@openstates.org","program_year":2018},"student":{"id":6445236134346752,"display_name":"Bikram Bharti","program_year":2018},"abstract":"Data Tools for allowing community to add, suggest, edits.","assignee_display_names":["Miles Watkins","James Turk"],"program_year":2018},{"id":6656841455501312,"title":"Implement Machine Learning in Tasking Manager Workflow","subcategory":"hot","organization":{"id":5067698929664000,"name":"Digital Impact Alliance","slug":"digital-impact-alliance-dial","website_url":"https://digitalimpactalliance.org","category":"end_user_applications","contact_email":"gsoc@dial.community","mailing_list":"https://forum.osc.dial.community/c/community/soc","irc_channel":"https://dial.zulipchat.com/","tagline":"Supporting open source projects for a digital society that serves everyone.","precis":"The DIAL Open Source Center is a collaborative space for many different open source software projects serving the international development and humanitarian response sectors.","description":"The **Digital Impact Alliance (DIAL) at United Nations Foundation** has launched its **Open Source Center** to provide a collaborative space for (and professional technical assistance to) open source projects focusing on international development and humanitarian response. \r\n\r\n**We are a Google Summer of Code umbrella organization that works with many of the leading projects in this area,** including Humanitarian Open Street Map Team, OpenLMIS, SUMSarizer, LibreHealth, and Open Data Kit. \r\n\r\nOur Center assists in the establishment of effective governance, software project management, and contribution models for member projects. It also provides technical, architectural, and programming support for projects; and assists those projects in support, engagement, management of their communities of contributors and implementers. More information about the DIAL Open Source Center is available at http://osc.dial.community/. \r\n\r\n**This year, our sub-organizations include:**\r\n\r\n - **Humanitarian OpenStreetMap Team (HOT)**, applying the principles of open source and open data sharing for humanitarian response and economic development.\r\n - **OpenLMIS**, an open source, cloud-based, electronic logistics management information system (LMIS) purpose-built to manage health commodity supply chains.\r\n - **SUMSarizer**, which helps researchers measure impacts of improved cookstoves by using machine learning to turn raw data from stove use monitoring sensors (SUMS) into summaries of cooking events.\r\n\r\nRead more about these projects and other humanitarian & international development projects participating in Google Summer of Code at: http://gsoc.dial.community/","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/Ht37bphpyM-RMzxgJjiQZkakv00CgEizDDjqz3Ws3xfIYxoIQzDdAH477gegRNSpGSQccrow9OdmBZsW_2MZmrM8KGd5-3k","image_bg_color":"FFFFFF","gplus_url":null,"twitter_url":"https://twitter.com/DIAL_Community","blog_url":"https://digitalimpactalliance.org/blog/","application_instructions":"**IMPORTANT: Please see http://gsoc.dial.community/ for (a) a list of our participating sub-organizations, (b) links to their project ideas pages, and (c) most importantly, a fully-annotated version of the application below.** The full version will give you additional details & tips about what responses we're seeking for each question! Failure to read & understand the annotated version may result in a rejected proposal.\r\n\r\n## Sub-org Information\r\n\r\n- Which Sub-org are you applying to work with? See http://gsoc.dial.community/ for a list.\r\n\r\n## Student Information\r\n\r\n- Name(s):\r\n- Email:\r\n- Telephone w/country code:\r\n- Time Zone:\r\n- Blog RSS Feed URL:\r\n\r\n## Code Sample\r\n\r\nLink to a patch/code sample, preferably one you have submitted to your sub-org:\r\n\r\n## Project Proposal\r\n\r\n- Title:\r\n- Abstract:\r\n- Detailed Description/Timeline (*)\r\n\r\n## Other Commitments\r\n\r\n- Do you have any other commitments during the GSoC time period?\r\n- Do you have exams or classes that overlap with this period?\r\n- Do you plan to apply for or have any other work during this period?\r\n- Do you have any other short term commitments during this period?\r\n- Have you applied with any other orgs? If so, do you have a preferred project/org? \r\n\r\n## Extra information\r\n\r\n- Link to resume:\r\n- University info\r\n  - University Name:\r\n  - Major:\r\n  - Current Year and Expected Graduation date:\r\n  - Degree (e.g. BSc, PhD): \r\n- Other Contact info:\r\n  - Alternate contact info:\r\n  - Homepage:\r\n  - Instant messaging:\r\n  - Twitter: \r\n  - Don't forget to add any other additional information requested by sub-orgs in this section.","topic_tags":["humanitarian","international","social good","charity","health"],"technology_tags":["android","java","php"," python"," javascript"],"proposal_tags":["openlmis","hot","sumsarizer"],"ideas_list":"http://gsoc.dial.community/","contact_method":"gsoc@dial.community","program_year":2018},"student":{"id":6034984280784896,"display_name":"Fienny Angelina","program_year":2018},"abstract":"Humans are good at recognizing, sensing and grouping things. In this proposal, I am thinking of where to consider using Machine, not to replace communities, but to build a more efficient and resilient communities. Machine are helpful to look for human errors and inconsistency and speed up tracing by doing a first pass for human. The Humanitarian OpenStreetMap Team has projects called Tasking Manager which enables volunteers, also known as mappers, to map areas, especially buildings and roads. It is used to aid disaster response and address local development challenges. For one mapping task, it might require 1000 hours of human volunteer time to map the features, e.g buildings.  It would be much more efficient to have machine learning detect and provide buildings suggestion and let the volunteer do the verification.","assignee_display_names":["Nate Smith","Drew Bollinger"],"program_year":2018},{"id":6657659311226880,"title":"Spectral Surface Reconstruction","subcategory":"geometry","organization":{"id":6121660483108864,"name":"CGAL Project","slug":"cgal-project","website_url":"https://www.cgal.org","category":"science_and_medicine","contact_email":"gsoc-cgal@inria.fr","mailing_list":"http://www.cgal.org/mailing_list.html","irc_channel":null,"tagline":"C++ library of computational geometry and geometry processing","precis":"CGAL is a software project that provides easy access to efficient and reliable geometric algorithms in the form of a C++ library.","description":"CGAL is a software library that offers a number of reliable geometric data structures and algorithms. CGAL components operate in 2D and 3D, and sometime in arbitrary dimensions. Examples of components include convex hulls, convex decomposition, Delaunay triangulations, Voronoi diagrams, polygonal surface mesh data-structures, mesh generation, Boolean operations, envelope computations, intersection detection, surface reconstruction, and subdivision surfaces.\n\nCGAL is used in a variety of application domains such as CAD/CAM (computer aided design and modeling), GIS (geographic information systems), geophysics, image processing, molecular biology, robotics, motion planning, and graphics.\n\nCGAL is written in C++ and rigorously adheres to the generic-programming paradigm.\n\nCGAL became an Open Source project in 2003. Most of CGAL is under the GPL v3+ license, and some core parts are under the LGPL v3+. The semi-annual releases have currently about 10,000 downloads. CGAL is commercially supported by the spin-off company GeometryFactory.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/e1uDZ-a2-940fEVcmHf84gWIpVvTMClySFsHDz3I5dJZgVN6-itJL-oO_yPS_w27i5XOLsmOSRXTYgqg7TdXh7tQxfDHfH8","image_bg_color":null,"gplus_url":"https://plus.google.com/+CGALOrgProject","twitter_url":null,"blog_url":null,"application_instructions":"Select a project in the list and provide your personal and detailed description. If you wish to work on another idea of your own, we are pretty open as long as this serves the goal of consolidating CGAL as a whole. Provide a proposal of a technical solution with your envisioned methodology. The more detailed the better. Explain how the solution will be available to the user, in which form. Do not forget the documentation, unitary tests and cross-platform aspects. Provide a realistic schedule with objectives (one every two weeks for example) and deadlines. Focus on mid-term objectives as well as on the final evaluation.\n\n\nPersonal data:\n - First name, last name, affiliation and geographical location.\n - A brief list of the main studies and programming courses attended, with ranking. \n - List of the most important software projects contributed and success.\n - Which are your best skills in terms of programming and scientific computing?\n - In general what is your taste in terms of programming? language, methodology, team work, etc.\n - Is there anything that prevents you from working full time on the project during the program period?\n - How do you see your involvement after the program ends? Do you see yourself pushing the project further, or do you see yourself contributing to other CGAL projects?\n - Are you more interested in the theory/scientific aspect of CGAL, or do you feel more like a hacker?\n - What are your long-term wishes in terms of job?","topic_tags":["computational geometry","geometry","mesh processing","arrangement","webhook"],"technology_tags":["c++","github","git"],"proposal_tags":["mesh processing","qt5","arrangement","barycentric coordinates","point set processing","geometry"],"ideas_list":"https://github.com/CGAL/cgal/wiki/Project-Ideas","contact_method":"gsoc-cgal@inria.fr","program_year":2018},"student":{"id":4897123762438144,"display_name":"Tong ZHAO","program_year":2018},"abstract":"This project aims to build a package for reconstruction watertight surfaces from un-oriented point sets. The first step is to estimate un-oriented normals to the inferred surface by combining Voronoi diagram and Principal Component Analysis. It results in a tensor field which encodes both the normal direction and the confidence in the approxiamtion. The second step is to estimate a implicit function such that its gradient is best aligned with the principal axes of the tensor field encoding the normal directions. This estimation could be viewed as a generalized eigenvalue problem, which can be solved by the power iteration.","assignee_display_names":["Simon Giraudot","Pierre Alliez"],"program_year":2018},{"id":6668779451318272,"title":"Support for Volume Snapshots and Backup Policy","subcategory":"kubernetes","organization":{"id":6453865516367872,"name":"Cloud Native Computing Foundation (CNCF)","slug":"cloud-native-computing-foundation-cncf","website_url":"https://www.cncf.io/","category":"cloud","contact_email":"info@cncf.io","mailing_list":"","irc_channel":"https://github.com/cncf/soc/issues","tagline":"Sustaining open source cloud native projects like Kubernetes and Prometheus","precis":"The CNCF promotes cloud native computing across the industry and sustains open source cloud native projects such as Kubernetes, Prometheus, gRPC, Envoy and more!","description":"The CNCF was founded in 2015 with the mission to promote cloud native computing across the industry and provide a home for the Kubernetes community and related open source projects. Cloud native computing uses an open source software stack to be:\n\n* Containerized. Each part (applications, processes, etc) is packaged in its own container. This facilitates reproducibility, transparency, and resource isolation.\n* Dynamically orchestrated. Containers are actively scheduled and managed to optimize resource utilization.\n* Microservices oriented. Applications are segmented into microservices. This significantly increases the overall agility and maintainability of applications.\n\nYou can learn more about our organization here: https://cncf.io","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/CsmlKgZrFZ1rvEA66QwhtlNrkJl0ZHyiaHV-pzjttp23OuZD6GrY0DaLT8Ws4Cr5gw_8-SOs9aX-L5xIkVqugsU4zcKN3fY","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/CloudNativeFdn","blog_url":"https://www.cncf.io/newsroom/blog/","application_instructions":"https://github.com/cncf/soc","topic_tags":["cloud","container","monitoring","logging"],"technology_tags":["kubernetes","prometheus","grpc","docker","golang"],"proposal_tags":["new feature","optimization","kubernetes","envoy","prometheus","grpc","opentracing","logging","service mesh","security"],"ideas_list":"https://github.com/cncf/soc","contact_method":"info@cncf.io","program_year":2018},"student":{"id":6511205691162624,"display_name":"Brian Oppenheim","program_year":2018},"abstract":"This project aims to bring globally consistent Volume Snapshots and a selection of backup policies to Rook, a storage orchestration tool running on Kubernetes. Any user running Kubernetes with Rook should be able to create and manage snapshots of the cluster to be stored on a Rook storage backend. In case of any failure in the network or lost nodes, Rook should be able to retrieve valuable data and present it back to the user.","assignee_display_names":["Travs Nielsen","jbw976"],"program_year":2018},{"id":6669374706941952,"title":"VLC Crashes Server (CrashDragon)","subcategory":"original idea","organization":{"id":6266517230977024,"name":"VideoLAN","slug":"videolan","website_url":"https://www.videolan.org","category":"graphics","contact_email":"videolan@videolan.org","mailing_list":"https://mailman.videolan.org/listinfo/vlc-devel","irc_channel":"https://www.videolan.org/support/","tagline":"Open Source Multimedia everywhere","precis":"Open source multimedia, for everyone, everywhere.","description":"The VideoLAN project is lead and composed of a team of volunteers, that believes in the power of open source when dealing with multimedia.\n\nWe are known for developing and publishing the widely used VLC media player playing almost everything everywhere. Additionally, we provide advanced tools for multimedia processing as well as libraries for use in third party applications.\n\nOur latest addition to our cone family is the VideoLAN Movie Creator, a non-linear movie editor based on VLC technology and in the spotlight of this year's GSoC participation alongside interesting ports to embedded and mobile devices.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/2LcJbfKqNQTly5thdKhej7Vy5R3STwSh02PtjXTR6ZUOqOzMicbN2eHp_wAiTTIoN108eLm-LYIvnIN15nVxAZywWGNw7VAv","image_bg_color":null,"gplus_url":"https://plus.google.com/+vlc","twitter_url":"https://twitter.com/videolan","blog_url":"http://planet.videolan.org","application_instructions":"# Application\n\nIn order to apply to a VideoLAN related project, it is important that you reach us to discuss your proposal, so that we can help you in the application process.\n\nIn your application, please be short with your proposal and straight to the point. We value a lot quality over quantity. We care more about competence than resume.\nIf you have any UI related ideas, please share some sketches (even paper-based photos).\n\nBefore the project starts, we will ask you to provide a patch, to be sure that you are not blocked on development setup.\n\nIf you have a doubt, are not sure about anything or want clarification, please get in touch with us, as soon as possible: we're nice.","topic_tags":["multimedia","audio","video","3d","vr"],"technology_tags":["c","c++","go","vue.js"],"proposal_tags":["server","client","ui","web","new feature","original idea"],"ideas_list":"https://wiki.videolan.org/SoC_2018/","contact_method":"videolan@videolan.org","program_year":2018},"student":{"id":6611155015958528,"display_name":"ToddShepard","program_year":2018},"abstract":"*CrashDragon*, the product of my last year's GSoC project, should be extended and major memory leaks should be fixed. New features which turned out to be important in prudction use should be added and existing ones revised.","assignee_display_names":["Simon Latapie"],"program_year":2018},{"id":6670474218569728,"title":"Adding Greek language support to the open source fonts of the typeface Work Sans","subcategory":"","organization":{"id":4954936912117760,"name":"GFOSS - Open Technologies Alliance","slug":"gfoss-open-technologies-alliance","website_url":"http://gfoss.eu","category":"other","contact_email":"admin@eellak.gr","mailing_list":"http://opensource-devs@ellak.gr","irc_channel":"","tagline":"Promote Openness with the use and development of Open Standards & Open Source.","precis":"GFOSS – Open Technologies Alliance  is a non-profit organization, with 35 Universities and Research Centers as its shareholders. Our main goal is to promote Openness.","description":"GFOSS – Open Technologies Alliance  is a platform for Open Standards, Free Software, Open Content, Open Data & Open Hardware in Greece. The major Greek Universities and Research Centers participate in GFOSS – Open Technologies Alliance, while leading members of the Greek community of developers play a key role in the implementation of our policies. Through our initiatives we aspire to contribute to coordinating the efforts of groups of volunteers, enabling them to form the backbone of Greek FOSS development and implementation.","tags":[],"primary_open_source_license":"European Union Public License, Version 1.1 (EUPL-1.1)","image_url":"//lh3.googleusercontent.com/eRbjP2ZIaYQTAggCzFq7BvjGgRJv_Q-r1SHXtrvIUrbrW2cBEEv50BvGRacxFbVwatTi4VUJXWNosRVO5irdumKcy8GdAA","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/gfoss","blog_url":"http://ellak.gr","application_instructions":"The first thing we encourage students to do before composing their application is to read the [Student Manual](http://write.flossmanuals.net/gsocstudentguide/what-is-google-summer-of-code/). As for the application we need all students to include the following information:\n* Full Name\n* Contact Details (email, telephone)\n* Relevant Urls (Github, Social Media, Personal Blog)\n* Short Bio/CV\n* Skills/Programming Languages\n* The title of the project(s) you want to contribute\n* How you want to contribute in the project\n* A detailed monthly work plan they are planning to achieve\n* A paragraph explaining why you are interested in participating in GSoC\n* A paragraph explaining why you believe we should choose you\n\nWe also encourage students to subscribe to our developers mailing list (opensource-devs@ellak.gr) and contact the admins or the mentors with any questions they might have regarding their application, their proposed ideas or the project they are interested in contributing.","topic_tags":["python","gtk","java jsp","c++ tools","javascript"],"technology_tags":["python 3","php/javascript/html"," css/html","java","c/c++"],"proposal_tags":["epoptes","scriptum","clio","wso2","cscout","filesdb","diavgeia","moodle","codification","sampling"],"ideas_list":"https://ellak.gr/wiki/index.php?title=GSOC2018_Projects","contact_method":"admin@eellak.gr","program_year":2018},"student":{"id":5865331059326976,"display_name":"Florian Fecher","program_year":2018},"abstract":"Google Fonts' category of sans serif typefaces with a Greek character set is determined by typefaces following the humanist and geometric model. The Neo-Grotesque (hybrid) Roboto is the only exception to that and doesn't include Polytonic. A classic grotesque supporting Greek is missing. I want to add Monotonic and Polytonic Greek to all nine weights of Work Sans by Wei Huang.","assignee_display_names":["Alexios Zavras (zvr)","Emilios Theofanous","Irene Vlachou"],"program_year":2018},{"id":6670677558427648,"title":"Neural Collaborative Filtering","subcategory":"new algorithm","organization":{"id":4841692297953280,"name":"mlpack","slug":"mlpack-a-scalable-c-machine-learning-library","website_url":"http://www.mlpack.org/","category":"data_and_databases","contact_email":"mlpack@lists.mlpack.org","mailing_list":"http://www.mlpack.org/involved.html","irc_channel":"http://www.mlpack.org/involved.html","tagline":"a scalable C++ machine learning library","precis":"mlpack is a C++ machine learning library with emphasis on scalability, speed, and ease-of-use.","description":"mlpack is a C++ machine learning library with emphasis on scalability, speed, and ease-of-use. Its aim is to make machine learning possible for novice users by means of a simple, consistent API, while simultaneously exploiting C++ language features to provide maximum performance and maximum flexibility for expert users. This is done by providing a set of command-line executables which can be used as black boxes, and a modular C++ API for expert users and researchers to easily make changes to the internals of the algorithms.\n\nAs a result of this approach, mlpack outperforms competing machine learning libraries by large margins; the handful of publications relating to mlpack demonstrate this.\n\nmlpack is developed by contributors from around the world. It is released free of charge, under the 3-clause BSD License. (Versions older than 1.0.12 were released under the GNU Lesser General Public License: LGPL, version 3.)\n\nmlpack bindings for R are provided by the RcppMLPACK project.","tags":[],"primary_open_source_license":"BSD 3-Clause \"New\" or \"Revised\" License (BSD-3-Clause)","image_url":"//lh3.googleusercontent.com/EdpxaoTqWrgWQ0ysJV2uIqqr2A8UVIx_R2baIQtCxo7l_XeZYZyMGb3e8uYHPOon7Y14jHIEDgh7sp76ynHmealKJapKTzw","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":"http://www.mlpack.org/gsocblog/","application_instructions":"https://github.com/mlpack/mlpack/wiki/Google-Summer-of-Code-Application-Guide","topic_tags":["machine learning","deep learning","algorithms","data science"],"technology_tags":["c++"],"proposal_tags":["optimization","new algorithm","bindings"],"ideas_list":"https://github.com/mlpack/mlpack/wiki/SummerOfCodeIdeas","contact_method":"mlpack@lists.mlpack.org","program_year":2018},"student":{"id":6606639596044288,"display_name":"Haritha Sreedharan Nair","program_year":2018},"abstract":"Recommendation systems are widely used in various online and offline platforms, collaborative filtering being the most commonly used method for implementing them. Most collaborative filtering algorithms, including the ones existing in mlpack, use matrix factorization for this. Although MF is de facto, it cannot deal with complex user-item relationships and also need the user to provide ratings explicitly (explicit feedback). This project proposal deals with these drawbacks by implementing a module for neural collaborative filtering, which can represent complex user-item interaction using neural networks and also can handle implicit feedback (comprising any interaction user has with any item as a positive instance). Neural collaborative filtering, if needed, can also be generalized to matrix factorization. NCF has been proved to give better hit ratio and other metrics than neighborhood based algorithms, and also gives comparable RMSE with existing CF methods in mlpack. This module can give much more flexible recommendations, even when there is less explicit feedback available.","assignee_display_names":["Marcus Edel"],"program_year":2018},{"id":6673723025784832,"title":"Update to PyPRUSS - Python API for the PRUs","subcategory":"interfaces","organization":{"id":5740586020110336,"name":"BeagleBoard.org Foundation","slug":"beagleboardorg-foundation","website_url":"https://beagleboard.org","category":"languages","contact_email":"info@beagleboard.org","mailing_list":"https://beagleboard.org/discuss","irc_channel":"https://beagleboard.org/chat","tagline":"Open hardware and software for physical computing","precis":"Open source community of experienced hackers, hobbyists and engineers enthusiastic about building powerful, systems completely programmable through your browser","description":"BeagleBoard.org is an open source community of experienced hackers, hobbyists and engineers who are enthusiastic about building powerful, open ARM-based systems completely programmable through your web browser. BeagleBoard.org’s vision is to improve access to small, low-power computing platforms that can be embedded into new creations using easy to use development tools, such as its self-hosted, web-based IDE. The hardware designs of all Beagle boards are open source with all schematics, bills-of-materials, layouts, etc. shared for building other devices. The software is also open source and is generated by the community. Compiler tools are free and the boards are available at a low cost.\n\nBoards will be provided for free to any student participating in a BeagleBoard.org-related GSoC project.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/0KV2X3MQLYVzkm0r1QIZTec1nZe2LmGqhJt7FmxAD7D7booJnpoV_zcieTmJdPer0VO1hjjzXKy-1AyVhiQPuyZkVgAWRQ","image_bg_color":"f1f1f1","gplus_url":"https://plus.google.com/+beagleboard","twitter_url":"https://twitter.com/beagleboardorg","blog_url":"https://beagleboard.org/newsletter","application_instructions":"Please follow the instructions on https://bbb.io/gsoc to sign up on the mailing list.\n\nAbout you\n========\n1. What is your name, e-mail address and usernames on Freenode IRC, eLinux wiki and Github? (required)\n2. What is the name of your school and in what country? (required)\n3. What is your primary language and work hours? (We have mentors who speak multiple languages and in various time zones and can match you partially based on that.)\n4. Have you participated in an open-source project before? If so, please send us URLs. If not, why do you want to?\n\nAbout your project\n===============\n1. What is the name of your proposed project?\n2. In 10-20 sentences, what are you making, for whom, why and with what technologies (programming languages, etc.)? (We are looking for open source SOFTWARE submissions.)\n3. Provide a development timeline with a milestone each of the 11 weeks. (A realistic timeline is critical to our selection process.)\n4. In 5-15 sentences, convince us you will be able to successfully complete your project in the timeline you have described.\n5. If successfully completed, what will its impact be on the BeagleBoard.org community? Include quotes from BeagleBoard.org community members who can be found on http://beagleboard.org/discuss and http://bbb.io/gsocchat.\n6. What will you do if you get stuck on your project and your mentor isn’t around?\n\nMisc\n====\n1. Please complete the requirements listed on the ideas page. (http://bbb.io/gsocideas)\n2. Is there anything else we should have asked you?","topic_tags":["robotics","ros","audio","iot","interfaces"],"technology_tags":["linux","gcc","real-time","physical computing","iot"],"proposal_tags":["linux","bootloader","userspace","audio","interfaces"],"ideas_list":"https://bbb.io/gsocideas","contact_method":"info@beagleboard.org","program_year":2018},"student":{"id":5917787306852352,"display_name":"muneeb17","program_year":2018},"abstract":"The PyPRUSS is a python binding/API for controlling the [PRUs](http://beagleboard.org/pru) . It provides an easy to use python-based interface for loading firmware, controlling execution and interrupts/memory management for the PRUs, therefore shortening the learning curve for users new to PRU programming. Currently, the PyPRUSS uses PASM for its examples and communicates using the older Userspace IO (UIO) Driver. The goal of this project is to update the API to use the remoteproc/rpsmg interfaces for interacting with the PRUs, port the existing examples to [gnupru](https://github.com/dinuxbg/gnupru) since PASM is [no longer supported](http://processors.wiki.ti.com/index.php/PRU_Assembly_Instructions#pasm_vs._clpru) by TI) and add [DMA](https://github.com/maciejjo/beaglebone-pru-dma) Support to the API, since it will enable the users to program both the PRUs for their application, instead of reserving one for ARM-PRU communication(as needed in case of rpmsg).","assignee_display_names":["Kumar Abhishek","Patryk Mężydło","ZeekHuge"],"program_year":2018},{"id":6674766098857984,"title":"Improve the Android Science App for PSLab","subcategory":"android","organization":{"id":4799958788603904,"name":"FOSSASIA","slug":"fossasia-3","website_url":"https://fossasia.org","category":"web","contact_email":"fossasia@googlegroups.com","mailing_list":"http://groups.google.com/group/fossasia","irc_channel":"https://gitter.im/fossasia/fossasia","tagline":"Improve People's Lives","precis":"Improving people's lives around the world with software and hardware for conversational AIs, science and event management.","description":"FOSSASIA develops Open Source software and hardware for conversational AIs, science and event management with a global developer community from its base in Asia. The organization also organizes Open Technology events, runs coding programs and the Codeheat development contest. The annual FOSSASIA Summit is the premier Open Technology event in Asia for developers, contributors, start-ups, and technology companies. FOSSASIA was founded in 2009.","tags":[],"primary_open_source_license":"GNU Library or \"Lesser\" General Public License version 3.0 (LGPL-3.0)","image_url":"//lh3.googleusercontent.com/hYP83k9BWNrIyPa0eE-DYgzk0sWBOPa__03xGMUUQM6mj3N2w9zXDnNdOEFJ4SvX56U1LqXRiPga7nU20A_NBxcusVkghzs","image_bg_color":null,"gplus_url":"https://plus.google.com/u/0/+FOSSASIAorg","twitter_url":"https://twitter.com/fossasia","blog_url":"https://blog.fossasia.org","application_instructions":"Please see our program guidelines and templates here: https://docs.google.com/document/d/1E4kNgrOSw64R2IAG45JSIgQL9Yxia-mG2dqlRcrUo-U/edit","topic_tags":["web development","artificial intelligence","personal assistants"],"technology_tags":["java","javascript","python","android","artificial intelligence"],"proposal_tags":["artificial intelligence","android","web","python","front-end","back-end","server","javascript","hardware","api"],"ideas_list":"https://labs.fossasia.org/ideas","contact_method":"fossasia@googlegroups.com","program_year":2018},"student":{"id":5509989288902656,"display_name":"Harsh Patel","program_year":2018},"abstract":"This proposal is proposed with an intention to increase the UI of the PSLab app so that the targeted audience which are students and teachers working in the stream of science can be helped. Also, this project targets for the completion of this app so that all its functionalities can be provided at once to its user so that they don't have to use any extra device as a support for PSLab's device. In a nutshell, this project targets advancement of all the functionalities starting from very basic of changing icons and themes and ending on very difficult and advanced tasks of testing the app so that it becomes multi-platform and also making the sensors and experiments from very scratch are also a part of it.","assignee_display_names":["Mario Behling"],"program_year":2018},{"id":6677811633324032,"title":"#9 - DRAKVUF: Support for Dynamic Malware Analysis on ARM","subcategory":"drakvuf","organization":{"id":5144878602780672,"name":"The Honeynet Project","slug":"the-honeynet-project","website_url":"https://honeynet.org/","category":"security","contact_email":"project@honeynet.org","mailing_list":"","irc_channel":"https://gsoc-slack.honeynet.org/","tagline":"The Honeynet Project - R&D for Honeypot/Honeynet Technology and InfoSec Research","precis":"The Honeynet Project is a non-profit research organization dedicated to improving the security of the Internet at no cost to the public. Focus is on honeypots and threat analysis.","description":"Founded in 1999, The Honeynet Project is an international, non-profit (501c3) research organization dedicated to improving the security of the Internet at no cost to the public.\n\nOur achievements are based on the principles of open source and volunteer efforts, with all software or papers created being licensed as open source and made freely available to the community.\n\nWe help coordinate the development, deployment, advancement and research findings of honeypot and anti-malware related technologies. With over 45 international chapters, 350 members and 30 open source research projects around around the world, we are a mature, highly diverse and international organization.\n\nSimply put, our goal is to make a difference. We accomplish this via:\n\nAwareness - We raise awareness of the threats and vulnerabilities that exist in the Internet today. Many individuals & organizations do not realize they are a target, nor understand who is attacking them, how, or why. We provide this information, so people can better understand that they are a target, and understand the basic measures they can take to mitigate these threats. This is provided through our Know Your Enemy series of papers.\n\nTools - For organizations interested in continuing their own research about cyber threats, we provide the tools and techniques we have developed. All tools are specifically licensed open source. Organizations all over the world use our tools.\n\nInformation - In addition to raising awareness, we provide details to better secure assets. Historically, information about attackers has been limited to the tools they use. We provide critical additional information, such as their motives in attacking, how they communicate, when they attack systems and their actions after compromising a system. We provide this service through our Know Your Enemy whitepapers and our periodic Scan of the Month challenges.\n\nThe Honeynet Project uses GSoC as a incubator for new R&D projects, and to recruit active new members.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/kWqF0bT_hHDVRLhg2pJhsFghmGZEWTTIqBSe5XOZKNDMyObRv__UjSH8d-Sf6eqvBxglXqtAD3u93Qzgqbv9vz4B_0-IXJo","image_bg_color":"000","gplus_url":null,"twitter_url":"https://twitter.com/ProjectHoneynet","blog_url":"https://honeynet.org/blog","application_instructions":"This year we have a wide range of project ideas and are also interested in hearing your ideas too. Our projects cover a wide range of programming languages and technologies. Project idea difficulty can range from fairly challenging, low level systems type projects that are likely to appeal to pretty confident programmers, through interesting data analysis, to data presentation projects building more effective user interfaces. We are always interested in discussing a student's own project ideas, and actively aim to mentor high quality student ideas too. If you are unsure, we can help you form your ideas during the student proposal submission period. If you want to find out more, take a look at our project ideas web page, subscribe to our blog and public GSoC questions mailing list.Then come and say hello on the #gsoc-honeynet IRC channel on irc.freenode.net (you can connect via webchat if you are behind a firewall or don't have a command line client too). There you should find a mix of organizational admins, project mentors, past successful GSoC students, general Honeynet Project members and prospective students, so please don’t be nervous - feel free to ask questions and we will always try and get back to you (although we may be idle for an hour or two when we sleep :) ). If you prefer email, check out the link to our mailing list or use project@honeynet.org. We are looking forwards to hearing from you and hopefully collaborating on something awesome together this summer.","topic_tags":["honeypots","malware","sandbox","deception","networking"],"technology_tags":["python 3"," python","golang","c/c++","machine learning"],"proposal_tags":["mitmproxy","honeytrap","drakvuf","holmes-processing","conpot","cuckoo-sandbox","thug","snare/tanner","libvmi","other"],"ideas_list":"https://honeynet.org/gsoc2018/ideas","contact_method":"project@honeynet.org","program_year":2018},"student":{"id":6319500631212032,"display_name":"Ulrich Fourier","program_year":2018},"abstract":"The relevance of ARM processors is rising. Especially since ARM recently started targeting the servers and desktop market, thus going beyond the mobile devices. That’s why malware targeting ARM is becoming an even bigger threat every day. On the other hand, it is still the x86 architecture for which most reverse engineering tools are developed. This Google Summer of Code (GSoC) project aims to add ARM support for both the dynamic analysis framework DRAKVUF and the virtual machine introspection (VMI) library libvmi. The idea is to base our project upon the result of an earlier GSoC project which added altp2m support for Xen on ARM. The altp2m subsystem defines different views on the guest’s physical memory and allows to dynamically switch among them. With altp2m and DRAKVUF we are able to build a stealthy VMI framework. In summary, the goal of the GSoC project is to add support for DRAKVUF for ARM and thus provide more options for reverse engineering on the ARM architecture.","assignee_display_names":["Sergej Proskurin","Tamas K Lengyel"],"program_year":2018},{"id":6680648593440768,"title":"Population genetics simulation and modeling using reinforcement learning","subcategory":"","organization":{"id":5712679537213440,"name":"Canadian Centre for Computational Genomics","slug":"canadian-centre-for-computational-genomics","website_url":"http://computationalgenomics.ca","category":"science_and_medicine","contact_email":"info@computationalgenomics.ca","mailing_list":"","irc_channel":null,"tagline":"Analytical solutions for Next-Generation Sequencing data","precis":"The Canadian Centre for Computational Genomics provides bioinformatics analysis and High Performance Computing services for the life science research community","description":"The Montreal [C3G](http://computationalgenomics.ca/) node is hosted at the McGill University and Genome Quebec Innovation Center (MUGQIC).\nThe Montreal node is strongly involved with [GenAP](https://genap.ca/) and has developed several genomic data analysis pipelines.\nSince 2011, we have completed more than 400 bioinformatics analysis projects with over 290 distinct groups of researchers across Canada.\nOur teams have significant experience in personalized medicine applications.\nThese have included genome analysis and interpretation of personal genomes,\ntechnology and services to record patient presentations, RNA- and ChIP-seq data analysis, and analysis of complete human epigenomes in both germline disorders and cancers.\nEach year C3G co-organizes several international workshops about next-generation sequencing (NGS) data analysis.\n\nThe Montreal C3G node develops the [GenAP Pipes](https://bitbucket.org/mugqic/mugqic_pipelines) which consist of Python scripts which create a list of jobs running Bash commands to analyze NGS data.\nThose scripts support dependencies between jobs and a smart restart mechanism if some jobs fail during pipeline execution.\nJob commands and parameters can be modified through several configuration files.\nWe currently maintain 7 pipelines and are in the process of developing 3 others.\n\nThe Montreal C3G node also develops other bioinformatics tools:\n \n * [BVAtools](https://bitbucket.org/mugqic/bvatools)\n * [POPsv](https://github.com/jmonlong/PopSV)\n * [SCoNEs](https://bitbucket.org/mugqic/scones)","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/bjfSdHSVDVY12vQ7TzVbeRo80Aa317bBACgi7IyjYkPBwEdBH7JO9kiwWhIWpYcj5qQ1kHKuUKY70JYA0dVLz5FGmKA57w","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/C3Genomics","blog_url":null,"application_instructions":"How to apply to our projects:   \n\n    1 Look for a project that needs a student on https://bitbucket.org/mugqic/gsoc_2018/overview\n    2 Each project should have ?tests? students can complete to demonstrate relevant skills. After completing at least one test, please post your test results to a github/bitbucket repo, and add a link to your test results on the google group.\n    3 Send an email to the mentors of the project. Include a link to your test results, and explain why you are interested in the project.\n    4 **Do NOT submit any applications to google without getting approval from the mentors.** If the mentors judge that you are capable of the project, then they will respond and help you to write a proposal to submit to Google. It should include most of the details from the project proposal wiki page, and additionally a detailed time-line that explains your plan for writing code, documentation, and tests.\n    5 Once your mentors have proof-read your proposal, submit it to google: https://summerofcode.withgoogle.com/","topic_tags":["bioinformatics","data science","next-generation sequencing","visualization","statistics"],"technology_tags":["r","perl","awk","bash","python"],"proposal_tags":["bioinformatics","pipeline development","science data","visualization","statistics","genomics","genetics","r-project"],"ideas_list":"https://bitbucket.org/mugqic/gsoc_2018","contact_method":"info@computationalgenomics.ca","program_year":2018},"student":{"id":5796970078142464,"display_name":"Arjun Karuvally","program_year":2018},"abstract":"The problem of population genetics can be viewed as a stochastic process. The idea is to do variational inference on this distribution using reinforcement learning. In order to understand the feasibility of using reinforcement learning to the problem, agents are tested against stochastic processes that resemble population genetics. Practical evidence is validated to provide a sanity check on the feasibility of deployment of such a method in practice in large-scale problems of population genetics. The next step would be to analyze how these methods actually performed in the population genetics problem and gain insight into the stochastic process that generates the distribution.","assignee_display_names":["Simon Gravel"],"program_year":2018},{"id":6683827406110720,"title":"Improve handling for touchpads and mice with Libinput","subcategory":"plasma","organization":{"id":5582559946211328,"name":"KDE Community","slug":"kde-community","website_url":"https://www.kde.org","category":"end_user_applications","contact_email":"kde-soc@kde.org","mailing_list":"https://mail.kde.org/mailman/listinfo/kde-soc","irc_channel":"https://userbase.kde.org/IRC_Channels","tagline":"Experience Freedom!","precis":"The KDE community produces Free and Open Source Software and brings together artists, designers, programmers, translators, users, writers and other contributors from everywhere.","description":"KDE is an international team co-operating on development and distribution of Free, Open Source Software for desktop and portable computing. Our community has developed a wide variety of applications for communication, work, education and entertainment. We have a strong focus on finding innovative solutions to old and new problems, creating a vibrant, open atmosphere for experimentation.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/Z1KwbzHB5NIYGB7etJNq9LMmQYyf_Xbl9MmEo96Vh-JkIfdJQDSoQyeBSF3sH9cMQ7cCBLURca9rgV76cFCmh1ashgZrRfw","image_bg_color":null,"gplus_url":"https://plus.google.com/+KdeOrg","twitter_url":"https://twitter.com/kdecommunity","blog_url":"https://planet.kde.org/","application_instructions":"[Complete requirements](https://community.kde.org/GSoC#Student_proposal_guidelines)\n\n**Implementation**\n\nDescribe what you plan to do as a solution for the problem you defined above. \n\n**Timeline**\n\nShow that you understand the problem, have a solution, have broken it down into manageable parts, and that you have a realistic plan on how to accomplish your goal. \n\n* Disclose other commitments during GSoC, such as a job, vacation, exams, internship, seminars, or papers to write.\n* Explain how you will work around conflicts. If you are found to have conflicts which you did not disclose, you may be failed.\n* Include your plans for communication in your proposal; daily is best, weekly at minimum.\n* You will need to initiate weekly formal communication such as a blog post on the KDE Planet or detailed email to the team mail list. Lack of communication will result in you being failed.\n\n**About me**\n\n* Provide your contact information (IRC nick, email, IM, phone) and write about you and why you think you are the best for this job. \n* Prior contributions are required; list your commits. \n* Tell us if you are submitting proposals to other organizations, and whether or not you would choose KDE if given the choice.","topic_tags":["applications","desktop environment"],"technology_tags":["qt","c/c++","qml"],"proposal_tags":["plasma","krita","gcompris","okular","digikam","kpm","labplot","w2l","kgpg","kde applications"],"ideas_list":"https://community.kde.org/GSoC/2018/Ideas","contact_method":"kde-soc@kde.org","program_year":2018},"student":{"id":5764235515133952,"display_name":"Furkan Tokac","program_year":2018},"abstract":"Input devices management UI is being refreshed while it is coded for Wayland. Because it is coded for Wayland, its backend is libinput but we also want to use that UI and its functionalities in X11 systems that use libinput so we need an abstraction layer. My goal involves porting the new Wayland-only touchpad UI to the X11 system. After the porting, I plan to improve the user experience for touchpad and mouse management by implementing new features like advanced scrolling behaviors and more granular speed and acceleration handling.","assignee_display_names":["Roman Gilg","Nathaniel Graham"],"program_year":2018},{"id":6685973346254848,"title":"Multilingual Neural Machine Translation System","subcategory":"other","organization":{"id":4720430959558656,"name":"Red Hen Lab","slug":"red-hen-lab","website_url":"http://redhenlab.org","category":"science_and_medicine","contact_email":"redhenlab@gmail.com","mailing_list":"https://docs.google.com/forms/d/1V9jzUi9OvLU357HAcN1Ewp7vFEIWVcrYtwBeifWlO58/edit","irc_channel":"https://red-hen-gsoc.slack.com","tagline":"Research on Multimodal Communication","precis":"Red Hen Lab is a distributed consortium of researchers in multimodal communication, with participants all over the world.","description":"Red Hen Lab is a distributed consortium of researchers in multimodal communication, with participants all over the world. We are senior professors at major research universities, senior developers in technology corporations, and also junior professors, postdoctoral students, graduate students, undergraduate students, and even a few advanced high school students. Red Hen develops code in Natural Language Processing, audio parsing, computer vision, and joint multimodal analysis. \n\nRed Hen's multimodal communication research involves locating, identifying, and characterizing auditory and visual elements in videos and pictures. We may provide annotated clips or images and present the challenge of developing the machine learning tools to find additional instances in a much larger dataset. Some examples are gestures, eye movements, and tone of voice. We favor projects that combine more than one modality, but have a clear communicative function -- an example would be floor-holding techniques. Once a feature has been successfully identified in our full dataset of several hundred thousand hours of news videos, cognitive linguists, communication scholars, and political scientists can use this information to study higher-level phenomena in language, culture, and politics and develop a better understanding of the full spectrum of human communication. Our dataset is recorded in a large number of languages, giving Red Hen a global perspective.\n\nFor GSoC 2018, we invite proposals from students for components for a unified multimodal processing pipeline, whose aim is to extract information from text, audio, and video, and to develop integrative cross-modal feature detection tasks. Red Hen Lab is directed jointly by Francis Steen (UCLA) and Mark Turner (Case Western Reserve University).","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/vlmM_3zq2IInjm-ehx2_t3xFaYNAi9Fn7CnAkazxQvvrovmQqqgBiiwXJoKrcXO2fAxJZ87rZkSM6Gbws6gqNf9ax7-cHQM","image_bg_color":"ffffff","gplus_url":"","twitter_url":"https://twitter.com/redhenlab","blog_url":null,"application_instructions":"Please clearly state your proposal, whether it is a new project or an improvement to an existing system.  \n\nBear in mind that your project should result in a module that is installed on our high performance computing cluster, fully tested, with clear instructions, and ready to be deployed to process a massive data set.  The module should include a well documented API file that can be used by a wide variety of coders, especially those who come after you, and those who are not experts in your problem domain.\n\nYour project should be scaled to the appropriate level of ambition, so that at the end of the summer you have a working product.  Be realistic and honest with yourself about what you think you will be able to accomplish in the course of the summer.  Provide a detailed list of the steps you believe are needed, the tools you propose to use, and a weekly schedule of deliverables.  Clear and proper documentation can take much longer than expected.\n\nIf you are proposing a machine learning project, base the proposal on techniques that have already been successful in other similar projects.  Include as much information about previous research and results as possible.  Accuracy measurements will be required, and they should be as automated as possible.\n\nPlease be prepared to follow code formatting standards closely and to work with Singularity (virtual Linux system) images throughout the summer.","topic_tags":["multimedia","audio processing","video processing","artificial intelligence","machine learning"],"technology_tags":["python","scikit-learn","tensorflow","singularity","syntaxnet"],"proposal_tags":["speech","non-speech audio","gesture","emotion","face processing","visualization.","cognitive theory","measurement","high performance computing","other"],"ideas_list":"https://sites.google.com/site/distributedlittleredhen/summer-of-code/google-summer-of-code-2018-ideas-page","contact_method":"redhenlab@gmail.com","program_year":2018},"student":{"id":5719931048427520,"display_name":"Vikrant Goyal","program_year":2018},"abstract":"The aim of this project is to build a single Machine Translation system using Neural Networks (RNNs-LSTMs, GRUs,Bi-LSTMs) to translate between multiple languages. This project will cover 12-15 language pairs where the target language is English. ​The system will be made such that, it is relatively simple to add a new language pair for translation.","assignee_display_names":["Karan Singla","shrutigullapuram","mpac","Francis Steen"],"program_year":2018},{"id":6686098906939392,"title":"GSOC for implementation of Global Search Function","subcategory":"search","organization":{"id":6355544806260736,"name":"Rocket.Chat","slug":"rocketchat","website_url":"https://rocket.chat","category":"social_communications","contact_email":"gsoc+2018@rocket.chat","mailing_list":"","irc_channel":"https://open.rocket.chat","tagline":"The ultimate free open source solution for team communications","precis":"Rocket.Chat is an open source group communications platform;  supporting text msgs, video, audio, and file/media sharing between individuals and groups- cross mobile, web, desktop.","description":"Rocket.Chat is one of the largest active open source (permissive MIT source license) nodeJS communications platform communities on GitHub, featuring 600+ global community contributors (across projects) from 30+ countries, 15780+ GitHub stars, 3300 forks, 140+  total releases and 6,200+  issues since inception in 2015.\n\nIn a world where communication platforms are almost all totally proprietary, privacy-infringing, and centralized (Skype, Slack, WhatsApp, and so on). Rocket.Chat is a breath of fresh air empowering groups around the world to experience a self-hosted, private, distributed and unrestricted communications platform.\n\nOur server is written in NodeJS (server side JavaScript) and utilizes websocket connections to enable real-time interactive rich communications between a variety of clients – including web, mobile (both iOS and Android), and desktop (Windows, macOS, and Linux).  Mobile clients are crafted in Swift, Java and Kotlin, we also have a React Native client.\n\nThe server is designed to be scalable from a family server on a Raspberry Pi 3, all the way to a cluster of servers for 10s of thousands of communicating users.  Its architecture leverages a \"modified Kafka’ish optimized MongoDB oplog tailing  (single source of truth append-only log) mechanism\" to scale across servers in a tunable yet performant manner.\n\nRocket.Chat has been designed to be totally extensible. REST and realtime (websocket) APIs are available to control and customize various aspects of the server.  Extensions can be added modularly using standard node module mechanism.  \n\nChat bots are a popular means of extending the capabilities of Rocket.Chat. Adapters for popular bot framework, such as Hubot, are available and Rocket.Chat’s community published its own integration bots for code platforms including GitHub and Gitlab.  Rocket.Chat supports the chat bot and ML, conversational bots, and voicebot communities  - with adapters for new bot framework – including the bBot super-bot-framework.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/xTUWs-PlkuMiHAhPqbK8lDpZnQyJwUIYur5fDsW3RAJy0K3FAQuM2u8Y6tmoH6_ndNBsEmcZCvn0JyHroSx0eRQLR4jOdA","image_bg_color":null,"gplus_url":"https://plus.google.com/+RocketChatApp","twitter_url":"https://twitter.com/rocketchat","blog_url":"https://rocket.chat/blog/","application_instructions":"You should already be familiar with working with GitHub repositories and ideally node or mobile development.  However,  we  welcome students with passion for open source and code development at all skill levels.  Do not hesitate to reach out if you are ready to work on  a great idea.\n \nCheck out our [project ideas list](https://rocket.chat/docs/contributing/google-summer-of-code-2018) for some inspiration, see if any of the projects there interest you.  Feel free to suggest a Rocket.Chat project of your own.     \n\nYou can reach out to a mentor to discuss project details via email  gsoc+2018@rocket.chat ,  our  [24 x 7 community server](https://open.rocket.chat), or via our [discussion forums](https://forums.rocket.chat/c/gsoc).","topic_tags":["chat","collaboration","machine learning","chatops","bot"],"technology_tags":[" javascript","ios","android","node","meteor.js"],"proposal_tags":["new feature","mobile","iot","home automation","analytics","integration","bot","search","ldap","react"],"ideas_list":"https://rocket.chat/docs/contributing/google-summer-of-code-2018","contact_method":"gsoc+2018@rocket.chat","program_year":2018},"student":{"id":6567157102542848,"display_name":"De Sheng Chuan","program_year":2018},"abstract":"This project involves implementing a global search function for a particular Rocket.chat instance. The global search is dynamic, and real-time results would be displayed. The results range from conversation titles, to user names to message content. The key is to construct a simple and sleek UI, altering it from the current message search function. A ecosystem revolving around a centralized database will also be constructed to minimize server load whenever a user performs a query.","assignee_display_names":["Diego Sampaio"],"program_year":2018},{"id":6686515787202560,"title":"IPPDOCLINT Program","subcategory":"printing","organization":{"id":4687783302529024,"name":"The Linux Foundation","slug":"the-linux-foundation","website_url":"http://www.linuxfoundation.org/","category":"operating_systems","contact_email":"till@linux.com","mailing_list":"https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018#if-you-have-questions","irc_channel":"https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018#if-you-have-questions","tagline":"A non-profit consortium dedicated to fostering the growth of Linux","precis":"The Linux Foundation is a non-profit consortium dedicated to fostering the growth of Linux. Hosting the Linux Kernel. OpenPrinting, Linux Standards Base, SPDX, ...","description":"The Linux Foundation is a non-profit consortium dedicated to fostering the growth of Linux. Founded in 2007 as a merger of the former Free Standards Group (FSG) and the former Open Source Developer Lab (OSDL), the LF sponsors the work of Linux creator Linus Torvalds and is supported by leading Linux and open source companies and developers from around the world. The Linux Foundation promotes, protects and standardizes Linux by providing unified resources and services needed for open source to successfully compete with closed platforms. For more see our [About page](http://www.linux-foundation.org/en/About). All software produced by us is free software published under OSI-approved licenses. See project ideas page for the license used by each project.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/bFK3YdvoZYjPBjTuQPBBTHcUQhaW9-JjIN9tGN_rFwxMjc3AM1J2gtTnaaucJ6nkmCUABZUlwGGQOzS_VJlcKAetuCXCl2wN","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"See our [applications template](https://wiki.linuxfoundation.org/gsoc/google-summer-code-student-application-template) page and the general hints on our [project ideas page](https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018).","topic_tags":["kernel","printing","wireless","lsb","spdx"],"technology_tags":["c","c++","cups","ipp"],"proposal_tags":["printing","kernel","lsb","spdx","llvmlinux","driver backports","wireless","others","wireguard"],"ideas_list":"https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018","contact_method":"till@linux.com","program_year":2018},"student":{"id":6230426566262784,"display_name":"Rithvik Patibandla","program_year":2018},"abstract":"The proposed linter program will take as input common print file formats and checks them for any structural or content errors. The linter should support basic raster formats such as PWG, CUPS and Apple rasters along with JPEG and PDF formats. The program can be used as a standalone program or as a command for the ippserver program to check the document submitted along with a job. The program also reports various job attributes such as job-impressions-xxx, job-media-sheets-xxx, job-pages-xxx. The skeleton file for the program has already been created by Michael R. Sweet from Apple Inc. and my work will start from it and build on top of it.","assignee_display_names":["Smith @ PWG","mdannyb","Aveek Basu"],"program_year":2018},{"id":6688105193537536,"title":"Species range maps in R","subcategory":"new package","organization":{"id":5313990809354240,"name":"R project for statistical computing","slug":"r-project-for-statistical-computing","website_url":"https://www.r-project.org/","category":"languages","contact_email":"gsoc-r@googlegroups.com","mailing_list":"https://github.com/rstats-gsoc/gsoc2018/wiki","irc_channel":null,"tagline":"R is a free software environment for statistical computing and graphics","precis":"R provides a wide variety of statistical and graphical techniques, and is highly extensible. R is often the tool of choice for research in statistical methodology.","description":"R is an integrated suite of software facilities for data manipulation, calculation and graphical display. It includes\n\n- an effective data handling and storage facility,\n- a suite of operators for calculations on arrays, in particular matrices,\n- a large, coherent, integrated collection of intermediate tools for data analysis,\n- graphical facilities for data analysis and display either on-screen or on hardcopy, and\n- a well-developed, simple and effective programming language which includes conditionals, loops, user-defined recursive functions and input and output facilities.\n\nMany users think of R as a statistics system. We prefer to think of it of an environment within which statistical techniques are implemented. R can be extended (easily) via packages. There are about eight packages supplied with the R distribution and many more are available through the CRAN family of Internet sites covering a very wide range of modern statistics.\n\nThe term “environment” is intended to characterize it as a fully planned and coherent system, rather than an incremental accretion of very specific and inflexible tools, as is frequently the case with other data analysis software.\n\nR, like S, is designed around a true computer language, and it allows users to add additional functionality by defining new functions. Much of the system is itself written in the R dialect of S, which makes it easy for users to follow the algorithmic choices made. For computationally-intensive tasks, C, C++ and Fortran code can be linked and called at run time. Advanced users can write C code to manipulate R objects directly.\n\nR has its own LaTeX-like documentation format, which is used to supply comprehensive documentation, both on-line in a number of formats and in hardcopy.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/qlSB2E0SDXNNVPijKF7LCK1m18Xaot9bQMfoRQWJ76diI85bMOHBaQvr20X3PH-NZplzFSlakZQdAnKWtzBkOzVAT9YXqnSr","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":"http://www.r-bloggers.com/","application_instructions":"1. look for a project that you are interested in on\nhttps://github.com/rstats-gsoc/gsoc2018/wiki/table-of-proposed-coding-projects\n\n2. Each project should have \"tests\" students can complete to demonstrate\nrelevant skills. After completing at least one test, please post your\ntest results to a github repo, and add a link to your test results on\nthe wiki.\n\n3. Send an email to the mentors of the project. Include a link to your\ntest results, and explain why you are interested in the project.\n\n4. If you and the project mentors agree that you are capable of the\nproject, then you should work with the mentors to draft a proposal to\nsubmit to Google. It should include most of the details from the\nproject proposal wiki page, and additionally a detailed timeline that\nexplains your plan for writing code, documentation, and tests.\n\n5. Once your mentors have proof-read your proposal, submit it to google \nhttps://summerofcode.withgoogle.com/\n\nMore details are on the R GSOC projects wiki.","topic_tags":["data science","visualization","statistics","graphics","machine learning"],"technology_tags":["r-project","c","c++","javascript","fortran"],"proposal_tags":["new package","existing package","visualization","machine learning","data cleaning","statistics","finance","optimization","reproducible research","bioinformatics"],"ideas_list":"https://github.com/rstats-gsoc/gsoc2018/wiki/table-of-proposed-coding-projects","contact_method":"gsoc-r@googlegroups.com","program_year":2018},"student":{"id":6267346642010112,"display_name":"Marlon E. Cobos","program_year":2018},"abstract":"The species range maps project is motivated by the importance of information about species distribution for processes of conservation planning and the study of spatial patterns of biodiversity. In the face of multiple threats related to Global Change, protection and mitigation actions are crucial for maintaining the health of the planet, and knowing where species are located constitutes in primary information for starting these efforts. Currently, generation of species ranges maps may take several steps and the use of specialized software. Thanks to the recent development of specialized packages, R is rapidly becoming an excellent alternative for analyzing the spatial patterns of biodiversity. Taking advantage of this packages and the versatility of R, the aim of this project is offering handily and robust open source tools to obtain reliable proposals of species distribution ranges and to analyze their geographical patterns. A large community of students, researchers, and conservation managers will be benefited by this project since these tools will be freely available and will improve the way in which studies of species distributions are developed.","assignee_display_names":["Narayani Barve","Vijay Barve","Alberto Jiménez Valverde"],"program_year":2018},{"id":6691473790074880,"title":"IIO Driver Project (Bosch BME680)","subcategory":"others","organization":{"id":4687783302529024,"name":"The Linux Foundation","slug":"the-linux-foundation","website_url":"http://www.linuxfoundation.org/","category":"operating_systems","contact_email":"till@linux.com","mailing_list":"https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018#if-you-have-questions","irc_channel":"https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018#if-you-have-questions","tagline":"A non-profit consortium dedicated to fostering the growth of Linux","precis":"The Linux Foundation is a non-profit consortium dedicated to fostering the growth of Linux. Hosting the Linux Kernel. OpenPrinting, Linux Standards Base, SPDX, ...","description":"The Linux Foundation is a non-profit consortium dedicated to fostering the growth of Linux. Founded in 2007 as a merger of the former Free Standards Group (FSG) and the former Open Source Developer Lab (OSDL), the LF sponsors the work of Linux creator Linus Torvalds and is supported by leading Linux and open source companies and developers from around the world. The Linux Foundation promotes, protects and standardizes Linux by providing unified resources and services needed for open source to successfully compete with closed platforms. For more see our [About page](http://www.linux-foundation.org/en/About). All software produced by us is free software published under OSI-approved licenses. See project ideas page for the license used by each project.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/bFK3YdvoZYjPBjTuQPBBTHcUQhaW9-JjIN9tGN_rFwxMjc3AM1J2gtTnaaucJ6nkmCUABZUlwGGQOzS_VJlcKAetuCXCl2wN","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"See our [applications template](https://wiki.linuxfoundation.org/gsoc/google-summer-code-student-application-template) page and the general hints on our [project ideas page](https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018).","topic_tags":["kernel","printing","wireless","lsb","spdx"],"technology_tags":["c","c++","cups","ipp"],"proposal_tags":["printing","kernel","lsb","spdx","llvmlinux","driver backports","wireless","others","wireguard"],"ideas_list":"https://wiki.linuxfoundation.org/gsoc/google-summer-code-2018","contact_method":"till@linux.com","program_year":2018},"student":{"id":5192606506549248,"display_name":"Himanshu Jha","program_year":2018},"abstract":"The project is to write a driver for Bosch BME680(4-in-1) sensor module using the Industrial I/O interface to effectively read data from each of the four channels which are Temperature, Pressure, Humidity and Gas. The sensor communicates via I2C and SPI communication protocol and the captured data read from the sensor is transported from kernelspace to userspace using the sysfs bindings to the IIO core. The goal is also to add support for triggered buffer readings from each of the channels to efficiently read samples. Finally, power management support is also required to support suspend/resume functions.","assignee_display_names":["Daniel Baluta"],"program_year":2018},{"id":6693324384108544,"title":"Dynamic Learning","subcategory":"p5.js","organization":{"id":4915113891463168,"name":"The Processing Foundation","slug":"the-processing-foundation","website_url":"http://processingfoundation.org","category":"languages","contact_email":"foundation@processing.org","mailing_list":null,"irc_channel":"https://forum.processing.org/two/categories/summer-of-code-2018","tagline":"Our goal is to empower people of all backgrounds to learn how to program.","precis":"The Processing Foundation’s mission is to promote software literacy and visual literacy — and to make these fields accessible to diverse communities.","description":"The Processing Foundation was founded in 2012 after more than a decade of work with the original Processing software. The Foundation’s mission is to promote software literacy within the visual arts, and visual literacy within technology-related fields — and to make these fields accessible to diverse communities. Our goal is to empower people of all interests and backgrounds to learn how to program and make creative work with code, especially those who might not otherwise have access to these tools and resources.\n\nWe do this by developing and distributing a group of related software projects, which includes [Processing (Java)](http://processing.org), [p5.js (JavaScript)](http://p5js.org), and [Processing.py (Python)](http://py.processing.org/), and facilitating partnerships and collaborations with allied organizations and individuals, to build a more diverse community around software and the arts.\nThe Processing Foundation is specifically invested in expanding the communities of technology and the arts to include and support those who have not had equal access because of their race, gender, class, sexuality, and/or ability. We sponsor a Fellowship Program that funds exploratory, creative, and technical research; support an Advocacy Program, which focuses on nurturing diverse communities and their specific projects; produce public events that provide platforms for collaboration between our contributors; and take part in panels and talks that spread the word about the need for diversity in these fields.\n\nAt our core is the philosophy and politics of free, libre, open-source software. We see software as a medium, something that connects two things. We view it as a means for thinking and making. We believe it should be free. We believe that learning to program is not about acquiring a certain skill set, but is instead a creative and exploratory process. We believe software, and the tools to learn it, should be accessible to everyone. We believe software literacy and an understanding of media of all kinds is essential knowledge for today.","tags":[],"primary_open_source_license":"GNU Library or \"Lesser\" General Public License version 2.1 (LGPL-2.1)","image_url":"//lh3.googleusercontent.com/xbNNxmOK9vsF1Nh34aDV_VJQHzEOSgCleG99BfkwL48oanpg9NFAiPxkEUp_j19nryhNnU_EgvRv02R1AcLeHNLg6IHEFic","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/processingorg","blog_url":"https://medium.com/@processingorg","application_instructions":"Thanks for your interest in the Processing Foundation! We accept proposals for projects related to core development as well as libraries / add-ons for Processing, Processing for\nAndroid, p5.js, and Python Mode. The first thing you should do is read over the [Project List wiki page on github](https://github.com/processing/processing/wiki/Project-List). There you'll find links to all of the relevant github repositories as well as lists of topics and projects for which we are actively seeking help. If you have questions about an idea or need guidance on forming your proposal, please post to the [Processing Forum](https://forum.processing.org/two/categories/summer-of-code-2018).\n \nFor GSoC, we actively seek help with features we know we need, but also look to applicants to propose ideas we haven't thought of ourselves. If you have an idea for a new feature for any of our environments, it's generally preferable to propose it as a library or mode so that it can be developed and tested as a standalone project. For all of our projects, it's incredibly important that things are kept as simple and user-friendly as possible. Our work is not for developers. It's for people who are less familiar with code, and/or just want to get things done. We're far less interested in features to make the environments more powerful for advanced users than we are in features that make it easier to handle tasks that are common for a wide range of our audience. \n\nYou should feel free to propose your idea however you see fit. If you are looking for guidance, [here is a proposal template](https://docs.google.com/document/d/1UFcWh2IWqhICh4YIFNwtKUaWWXifaBB67rjPxbYzjbE/edit?usp=sharing).","topic_tags":["creative coding","graphics","design","education","web"],"technology_tags":["java","javascript","python","android","opengl"],"proposal_tags":["processing","p5.js","p5.js web editor","python","android","sound","pde","arm","opengl","library"],"ideas_list":"https://github.com/processing/processing/wiki/Project-List","contact_method":"foundation@processing.org","program_year":2018},"student":{"id":4645261712818176,"display_name":"Jithin KS","program_year":2018},"abstract":"Collaborative platform of teachers and programmers to improve teaching of STEM subjects with the use of interactive simulations and animations. Programmers and teachers collaborate to create lessons. Programmers create simulations using P5.js as per the requirements of the teachers. Teachers use them to teach. The same simulations can be used by students while they watch the lessons. This is achieved by splitting the screen in half where one half contains the video lessons and the other half contains the simulations which the students can interact with while they watch the lesson. This helps them to have a very clear understanding of the scenario by checking out all the normal and boundary cases themselves by experimenting with the simulations.","assignee_display_names":["Saber Khan"],"program_year":2018},{"id":6693807366602752,"title":"Multimodal Egocentric Perception (with video, audio, eyetracking data)","subcategory":"cognitive theory","organization":{"id":4720430959558656,"name":"Red Hen Lab","slug":"red-hen-lab","website_url":"http://redhenlab.org","category":"science_and_medicine","contact_email":"redhenlab@gmail.com","mailing_list":"https://docs.google.com/forms/d/1V9jzUi9OvLU357HAcN1Ewp7vFEIWVcrYtwBeifWlO58/edit","irc_channel":"https://red-hen-gsoc.slack.com","tagline":"Research on Multimodal Communication","precis":"Red Hen Lab is a distributed consortium of researchers in multimodal communication, with participants all over the world.","description":"Red Hen Lab is a distributed consortium of researchers in multimodal communication, with participants all over the world. We are senior professors at major research universities, senior developers in technology corporations, and also junior professors, postdoctoral students, graduate students, undergraduate students, and even a few advanced high school students. Red Hen develops code in Natural Language Processing, audio parsing, computer vision, and joint multimodal analysis. \n\nRed Hen's multimodal communication research involves locating, identifying, and characterizing auditory and visual elements in videos and pictures. We may provide annotated clips or images and present the challenge of developing the machine learning tools to find additional instances in a much larger dataset. Some examples are gestures, eye movements, and tone of voice. We favor projects that combine more than one modality, but have a clear communicative function -- an example would be floor-holding techniques. Once a feature has been successfully identified in our full dataset of several hundred thousand hours of news videos, cognitive linguists, communication scholars, and political scientists can use this information to study higher-level phenomena in language, culture, and politics and develop a better understanding of the full spectrum of human communication. Our dataset is recorded in a large number of languages, giving Red Hen a global perspective.\n\nFor GSoC 2018, we invite proposals from students for components for a unified multimodal processing pipeline, whose aim is to extract information from text, audio, and video, and to develop integrative cross-modal feature detection tasks. Red Hen Lab is directed jointly by Francis Steen (UCLA) and Mark Turner (Case Western Reserve University).","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/vlmM_3zq2IInjm-ehx2_t3xFaYNAi9Fn7CnAkazxQvvrovmQqqgBiiwXJoKrcXO2fAxJZ87rZkSM6Gbws6gqNf9ax7-cHQM","image_bg_color":"ffffff","gplus_url":"","twitter_url":"https://twitter.com/redhenlab","blog_url":null,"application_instructions":"Please clearly state your proposal, whether it is a new project or an improvement to an existing system.  \n\nBear in mind that your project should result in a module that is installed on our high performance computing cluster, fully tested, with clear instructions, and ready to be deployed to process a massive data set.  The module should include a well documented API file that can be used by a wide variety of coders, especially those who come after you, and those who are not experts in your problem domain.\n\nYour project should be scaled to the appropriate level of ambition, so that at the end of the summer you have a working product.  Be realistic and honest with yourself about what you think you will be able to accomplish in the course of the summer.  Provide a detailed list of the steps you believe are needed, the tools you propose to use, and a weekly schedule of deliverables.  Clear and proper documentation can take much longer than expected.\n\nIf you are proposing a machine learning project, base the proposal on techniques that have already been successful in other similar projects.  Include as much information about previous research and results as possible.  Accuracy measurements will be required, and they should be as automated as possible.\n\nPlease be prepared to follow code formatting standards closely and to work with Singularity (virtual Linux system) images throughout the summer.","topic_tags":["multimedia","audio processing","video processing","artificial intelligence","machine learning"],"technology_tags":["python","scikit-learn","tensorflow","singularity","syntaxnet"],"proposal_tags":["speech","non-speech audio","gesture","emotion","face processing","visualization.","cognitive theory","measurement","high performance computing","other"],"ideas_list":"https://sites.google.com/site/distributedlittleredhen/summer-of-code/google-summer-of-code-2018-ideas-page","contact_method":"redhenlab@gmail.com","program_year":2018},"student":{"id":5016243606650880,"display_name":"Sumit Vohra","program_year":2018},"abstract":"Hey, I have been in constant touch with Mehul regarding my project on Multi-modal Egocentric Perception. I have already had a skype meet with him before drafting this final pre-proposal. \n\nAbstract: The idea of the project is to introduce multimodality in recognizing everyday activities and scenes. As per today, no work has been done now which includes multimodality into account (especially audio ) to determine the kind of activities and scenes that person is involved when it comes to egocentric perception. I have already built an audio-based model based on popular IEEE-DCASE-challenge which can successfully classify scenes into categories like ( person is walking in a park, driving in a car ) for egocentric views. I plan to extend my work as part of gsoc-2k18 to incorporate my model with video-based models and increase the scope of model from scenes to scenes+activities. The final breakdown of the steps is submitted in the pre-proposal attached above. The idea is to built pyscene-detect for egocentric videos,  which would be a prominent contribution owing to growing research in the area of first person view  videos.","assignee_display_names":["Mehul Bhatt","skrish13","Jakob Suchan"],"program_year":2018},{"id":6694239749013504,"title":"GSoC Student Application (Dilshat Salikhov)","subcategory":"clinical and phenotypic data capture","organization":{"id":5727014175113216,"name":"Global Alliance for Genomics and Health","slug":"global-alliance-for-genomics-and-health","website_url":"http://ga4gh.org","category":"science_and_medicine","contact_email":"gsoc@genomicsandhealth.org","mailing_list":"","irc_channel":null,"tagline":"We develop open standards and tools for genomics to benefit human health.","precis":"The Global Alliance for Genomics and Health (GA4GH) is a policy-framing and technical standards-setting organization, seeking to enable responsible genomic data sharing.","description":"The Global Alliance for Genomics and Health was formed to help accelerate the potential of genomic medicine to advance human health. It brings together over 400 leading Genome Institutes and Centers with IT industry leaders to create global standards and tools for the secure, privacy respecting and interoperable sharing of Genomic data.","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/JhhDbXP-zktUoddrD0VYmLDsrrGv_yslcnG3Q_LyIWjmrRIJdhqOPR98r1_eZts3Lhjc2KD3FtNQGSs7fDo0oAI1rMyypa7t","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/ga4gh","blog_url":"https://www.ga4gh.org/news/","application_instructions":"https://docs.google.com/document/d/1P_SvaCDl7OHqOeBJP_0kxQR4OhF5PW2Fm6MZlS0HBeE/edit?usp=sharing","topic_tags":["genomics","genetics","standards","bioinformatics","web"],"technology_tags":["java","python","cloud","c/c++","mongodb"],"proposal_tags":["clinical and phenotypic data capture","discovery","large scale genomics","cloud"],"ideas_list":"https://docs.google.com/document/d/1fzIMN3F96Qv--Bq9sGbApaVyS2dmUoGMrLP9O-ihKFE/view?usp=sharing","contact_method":"gsoc@genomicsandhealth.org","program_year":2018},"student":{"id":5551208358477824,"display_name":"Dilshat Salikhov","program_year":2018},"abstract":"Creating API for discovering over BioSamples (using the GA4GH metadata schema) and stream sequencing data back from EBI archives (ENA) via the  htsget protocol.","assignee_display_names":["Kerruba","Adam Faulconbridge","Melanie Courtot"],"program_year":2018},{"id":6695964446818304,"title":"Amahi iOS App Improvements and new Features","subcategory":"ios","organization":{"id":4708787353550848,"name":"Amahi","slug":"amahi","website_url":"http://www.amahi.org","category":"operating_systems","contact_email":"gsoc@amahi.org","mailing_list":"http://forums.amahi.org","irc_channel":"http://talk.amahi.org/","tagline":"Amahi, a home digital assistant at your fingertips.","precis":"Amahi is a home media/storage server with a web interface. It comes with mobile apps for easy streaming of your media and data","description":"The Amahi Linux Home Server makes your home networking and storage simple. We like to call the Amahi servers HDAs, for \"Home Digital Assistants.\" Each HDA delivers all the functionality you would want in a home server, while being easy to use from a web browser and mobile apps.\n\nAmahi can turn popular Linux distributions into a simple to use networking, storage and app server. The server management is done through a friendly user interface (the \"platform”). The platform allows controlling users login and storage access permissions, managing some network services like DHCP and DNS, as well as providing many apps that the users can install. The platform web interface is implemented in Ruby on Rails and runs in the web server along with other apps.\n\nThe installation process is done by installing the base distribution (Fedora at the moment) and after that, running the Amahi installer at the command line.\n\nOnce the installation is complete, the network services kick in, storage can be used and applications are installed by users. Some applications are Plugins (developed as an RoR \"engine\") and some are very popular open source apps and services.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/Yjd0G2IvDEIMV1JbK3_ScmmIvcMTrhApySNmFolCW1b-Yytwh__UPMy4wFnl_0YUco4tVQOewgNpP5XBMHReiJpfvL6bOOU","image_bg_color":null,"gplus_url":"http://plus.google.com/+amahi","twitter_url":"http://twitter.com/amahi","blog_url":"http://blog.amahi.org","application_instructions":"https://goo.gl/forms/xuHVyUdW0hmVSO9V2","topic_tags":["media server","storage server","streaming"," web apps","front-end"],"technology_tags":["ruby on rails","golang","swift","javascript","android"],"proposal_tags":["ruby on rails","containers","ios","swift","golang","plugins","android"],"ideas_list":"https://wiki.amahi.org/index.php/Google_Summer_of_Code_Ideas","contact_method":"gsoc@amahi.org","program_year":2018},"student":{"id":6385131825135616,"display_name":"Kanyinsola","program_year":2018},"abstract":"Amahi is a personal/home cloud-based server. Currently, you can stream, view and access the files in your Amahi server using your iOS & Android device.\n\nThe Amahi iOS app has just basic functionality. I wish to add more functionalities to the Amahi iOS app to surpass the Android app functionalities. The following are my proposed deliverables before the end of the GSoC program.\n\nEnhance the current Video Player’s functionality and make it a top-notch player by implementing gestures.\n\nImplement Thumbnail previews for video and image files.\n\nImplement a designated Audio Player for playing an audio playlist. \n\nHandling PDF/MOBI/EPUB files.\n\nAdd functionality to open and edit the contents of any file in a text editor inside the app. \n\nImplement file shares from HDA to other apps or users.\n\nMultiple User Login.\n\nLocal storage to persist user preferences.\n\nAdding functionality to UPLOAD new files to the shares directly from the mobile. \n\nAdd dialog to display the properties of a file.\n\nFix app specific bugs and optimize app performance and stabilization.","assignee_display_names":["Rodney Runyon","cpg"],"program_year":2018},{"id":6698746243448832,"title":"OpenWLANMap App","subcategory":"","organization":{"id":4687947786354688,"name":"freifunk","slug":"freifunk","website_url":"https://freifunk.net","category":"social_communications","contact_email":"gsoc-org-admins@freifunk.net","mailing_list":"https://lists.freifunk.net/mailman/listinfo/wlanware-freifunk.net","irc_channel":"http://irc.freifunk.net","tagline":"Freifunk is a non-commercial initiative for free and open wireless networks.","precis":"freifunk is part of a global movement for free infrastructure. Our vision is the democratization of media with free networks. Wireless communities implement this idea worldwide.","description":"More and more people are single-handedly installing and maintaining free networks. Every user in the free wireless network provides his or her wireless LAN router for data transfer to other participants. In return, he or she can also transmit data, such as text, music and movies through a free internal network or use services setup by participants to chat, call or play online games. We use mesh networks.\n\nUmbrella Organisation\n-----\n\nWe act as umbrella organisation for other wireless communities like [Ninux](http://ninux.org), [qaul.net](http://qaul.net), [Guifi.net](http://guifi.net) or [WLAN Slovenija](https://wlan-si.net/) and communites developing software we extensivly use like [OpenWRT](https://openwrt.org/), [OLSR](http://www.olsr.org/mediawiki/index.php/Main_Page), [BATMAN](https://www.open-mesh.org/projects/open-mesh/wiki), [libremesh](http://libremesh.org/) or [retroshare](http://retroshare.sourceforge.net/).\n\nLocal communities provide software adapted to their own needs on their websites. There are more and more free wireless groups that meet regularly access in villages and cities.\n\nHardware and Software\n----\n\nMost devices in our networks are routers for home use. They should run with LEDE. In our local communities there are a lot of different approaches for different routing protocols, monitoring systems and map solutions. LEDE as OS for routers and OLSR, BATMAN and Babel as routing daemons are only a few examples of software developed together with freifunk.\nYou can find a great variety of topics where you can go on with wireless communities. We're looking for people working on new hardware drivers, improving routing protocols, developing network monitoring tools and user interface topics on the web interfaces, helping us with new features and tools to organize decentralized communities.\n\nCommon freifunk goals\n----\n\n* Educating and creating awareness on the subject of communication and freedom of information\n* Reducing the digital divide\n* Unhindered distribution of knowledge and resources\n* Empowering people to build and operate their own networks\n* Promote and support existing and new social structures\n\nAs we are decentralized there are some challenges, e.g. to get and show information about communities, working together with all those communties.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/F_FWRzu838WIU-EDb-Teq9Y7OxaJSmqqIsl_aWHUQba98QrinymiU6iwPJYKSYcw5ghNPwVN6Ln3jsukc5Cam4gizRflkw","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/freifunk","blog_url":"https://blog.freifunk.net","application_instructions":"First steps\n===\n\nPlease take a look on our [projects page](https://projects.freifunk.net) and select the idea you like. If you miss any information like documentation or repositories, please ask the mentors connected to the ideas. We invite you to subscribe to forums or mailinglists to introduce yourself and clarify your questions.\n\nApplication Template\n===\n\nAbout you\n---\n\n * Name:\n * Email:\n * Blog:\n * Github/Bitbucket/Assembla etc. profile:\n * IRC Nick and Network:\n * Phone:\n * Country/Region:\n\nYour biography\n----\n\nWho are you? What's the focus of your studies? What makes you the best person to work on this project?\n\n Experiences in Free Open Source Software\n --\n\nWhat free and/or open source projects have you participated in? Please describe your contributions, provide us links to your features and commits.\n\nYour GSoC Project\n----\n\n* Project Title:\n* Possible Mentor:\n* Description:\n\n  Benefits to community networks, who would gain from your project?\n\n  * Deliverables - It is very important to list quantifiable results here e.g.\n    * \"Improve X modules in ways Y and Z.\"\n    * \"Write 3 new man pages for the new interfaces.\"\n    * \"Improve test coverage by writing X more unit/regression tests.\"\n    * \"Improve performance in FOO by X%.\"\n * Project Details - more detailed description.\n * Project Schedule - Please provide a rough timetable with milestones every 2 weeks.\n * Availability - How many hours per week can you spend working on this? What other obligations do you have this summer?\n\nAfter GSoC\n-----\n\nDo you have plans to continue with your project within the freifunk community after GSoC?","topic_tags":["network","wireless","web applications"," embedded systems","software-defined networking"],"technology_tags":["openwrt","javascript","html","c"," python"],"proposal_tags":["ninux","retroshare","firmware","qaul.net","routing","monitoring","wlan slovenija","web apps","openwrt"],"ideas_list":"https://projects.freifunk.net","contact_method":"gsoc-org-admins@freifunk.net","program_year":2018},"student":{"id":6442639491072000,"display_name":"Thi Huyen (Lilli) Cao","program_year":2018},"abstract":"The goal of this project is to develop a new OpenWLANMap wardriver app to replace the old one, which is not working anymore in order to save and expand the OpenWifi.su community","assignee_display_names":["Jan-Tarek Butt"],"program_year":2018},{"id":6703536205725696,"title":"Fineract CN Mobile 2.0","subcategory":"mobile","organization":{"id":5307555606167552,"name":"The Mifos Initiative","slug":"the-mifos-initiative","website_url":"http://mifos.org","category":"end_user_applications","contact_email":"info@mifos.org","mailing_list":"http://mifos.org/resources/community/communications/#mailing-lists","irc_channel":"https://gitter.im/openMF/mifos","tagline":"End Poverty One Line of Code at a Time","precis":"FinTech non-profit leveraging the cloud, mobile, and open source community to deliver digital financial services to the world’s 2 billion poor and unbanked.","description":"The Mifos Initiative is a US-based 501(c)3 non-profit whose mission is to speed the elimination of poverty by leading a global community that builds, supports, and uses Mifos X, a free and open source platform enabling the effective and efficient delivery of responsible financial services to the world’s 2 billion poor and unbanked. Our unprecedented approach to technology-enabled financial inclusion unites financial institutions, local technology partners, and volunteer developers to collectively advance open source banking infrastructure so the sector can sustainably build impactful innovations in digital financial services. \nMore than 7 million clients are being reached by 300 financial institutions & fintech innovators who use the Mifos software to power their operations across 40+ countries. They are supported by a global community of 100 deployment partners & hundreds of volunteers.\nFor the past decade, we’ve been at the forefront of transformative technology for financial services to the poor. Our technology stack provides complete banking infrastructure that is cloud-native, mobile-enabled, and scalable to the billions in need of cost-effective financial services. Our projects center around web & mobile apps that leverage APIs from the Apache Fineract platform & Apache Fineract CN, our latest evolution and the world's only open source application framework for digital financial services.  \nYou will work with a global community of brilliant minds guided by our shared vision of creating a world of 3 Billion Maries. You'll be mentored by leading fintech developers to build innovation to respond directly to the needs of the Base of the Pyramid:\n* Mobile Wallets & Mobile Banking Apps via SMS, USSD, & Android\n* Android Mobile Apps to empower field officers to effectively serve the poor\n* AngularJS based web apps for managing the back office of a financial institution\n* Cutting edge web apps for self-service banking for the poor\n* Cloud-native, enterprise banking architecture","tags":[],"primary_open_source_license":"Mozilla Public License 2.0 (MPL-2.0)","image_url":"//lh3.googleusercontent.com/WAb52-9xX9s-iqZOS9xavNdiM2VLl_l2J7cyO9a2GViwPyaH0M-HDC5nHiK99zY0OBXXxz5UkcthPArCvSMrpj5fdFY2SvY","image_bg_color":null,"gplus_url":"https://plus.google.com/+MifosOrg1","twitter_url":"http://twitter.com/mifos","blog_url":"http://mifos.org/blog/","application_instructions":"https://mifosforge.jira.com/wiki/spaces/RES/pages/4456638/Application+Template","topic_tags":["fintech","financial inclusion","mobile banking","digital financial services","microfinance"],"technology_tags":["java","android","spring","angularjs","mysql"],"proposal_tags":["mobile","web","platform","framework","module","mifos","fineract","fineract-cn"],"ideas_list":"https://mifosforge.jira.com/wiki/spaces/RES/pages/225411076/Google+Summer+of+Code+2018+Ideas","contact_method":"info@mifos.org","program_year":2018},"student":{"id":6070673378639872,"display_name":"Mohak Puri","program_year":2018},"abstract":"The Fineract CN Mobile 2.0 app is a step closer to achieving Mifos aim of speeding the elimination of poverty by enabling financial service providers to deliver responsible financial services to the poor and unbanked.The application allows staff to go directly into the field to connect to the client thereby reducing the cost of operations by enabling organizations to go paperless and be more efficient. As of version 1.0, the app provides some significant features and this GSOC my aim would be to add features that would take Mifos one step closer to their goal.","assignee_display_names":["Rajan Maurya"],"program_year":2018},{"id":6705219967123456,"title":"Improve Core Animation implementation and integrate it into AppKit","subcategory":"new feature","organization":{"id":6071880469970944,"name":"GNU Project","slug":"gnu-project","website_url":"https://www.gnu.org","category":"operating_systems","contact_email":null,"mailing_list":"https://lists.gnu.org/mailman/listinfo/summer-of-code","irc_channel":"","tagline":"GNU is an operating system that is free software","precis":"GNU is an operating system that is free software. The development of GNU made it possible to use a computer without software that would trample your freedom.","description":"GNU is a Unix-like operating system. That means it is a collection of many programs: applications, libraries, developer tools, even games. The development of GNU, started in January 1984, is known as the GNU Project. Many of the programs in GNU are released under the auspices of the GNU Project; those we call GNU packages.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/h4caH1RfbOJmfoFPToaHhCWKV0hW8zCslUfz44iIGTJgYiMsPxCRUUuZQsIi9KlMhIncIJaLmDVsR54OnyycJFk7UDBhrg4","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"All the instructions can be found on the ideas page","topic_tags":["free software","operating system"],"technology_tags":["c","lisp","python"],"proposal_tags":["new feature","bug fixing","stable release"],"ideas_list":"https://www.gnu.org/software/soc-projects/ideas-2018.html","contact_method":"https://lists.gnu.org/mailman/listinfo/summer-of-code","program_year":2018},"student":{"id":6591150870233088,"display_name":"Stjepan Brkić","program_year":2018},"abstract":"GNUstep is a console, desktop and web application development framework for development using Objective-C. It is based on OPENSTEP specification, and is today interested in achieving compatibility with Apple's Cocoa set of frameworks.\n\nAlthough GNUstep has an implementation of both AppKit and CoreAnimation, they are not integrated. The goal of the project would be to allow AppKit’s views to draw into Core Animation layers, and therefore to be better animatable.","assignee_display_names":["Fred Kiefer","Ivan Vučica"],"program_year":2018},{"id":6705602353430528,"title":"Audio and Visual Speech Recognition (AVSR) using Deep Learning","subcategory":"speech","organization":{"id":4720430959558656,"name":"Red Hen Lab","slug":"red-hen-lab","website_url":"http://redhenlab.org","category":"science_and_medicine","contact_email":"redhenlab@gmail.com","mailing_list":"https://docs.google.com/forms/d/1V9jzUi9OvLU357HAcN1Ewp7vFEIWVcrYtwBeifWlO58/edit","irc_channel":"https://red-hen-gsoc.slack.com","tagline":"Research on Multimodal Communication","precis":"Red Hen Lab is a distributed consortium of researchers in multimodal communication, with participants all over the world.","description":"Red Hen Lab is a distributed consortium of researchers in multimodal communication, with participants all over the world. We are senior professors at major research universities, senior developers in technology corporations, and also junior professors, postdoctoral students, graduate students, undergraduate students, and even a few advanced high school students. Red Hen develops code in Natural Language Processing, audio parsing, computer vision, and joint multimodal analysis. \n\nRed Hen's multimodal communication research involves locating, identifying, and characterizing auditory and visual elements in videos and pictures. We may provide annotated clips or images and present the challenge of developing the machine learning tools to find additional instances in a much larger dataset. Some examples are gestures, eye movements, and tone of voice. We favor projects that combine more than one modality, but have a clear communicative function -- an example would be floor-holding techniques. Once a feature has been successfully identified in our full dataset of several hundred thousand hours of news videos, cognitive linguists, communication scholars, and political scientists can use this information to study higher-level phenomena in language, culture, and politics and develop a better understanding of the full spectrum of human communication. Our dataset is recorded in a large number of languages, giving Red Hen a global perspective.\n\nFor GSoC 2018, we invite proposals from students for components for a unified multimodal processing pipeline, whose aim is to extract information from text, audio, and video, and to develop integrative cross-modal feature detection tasks. Red Hen Lab is directed jointly by Francis Steen (UCLA) and Mark Turner (Case Western Reserve University).","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/vlmM_3zq2IInjm-ehx2_t3xFaYNAi9Fn7CnAkazxQvvrovmQqqgBiiwXJoKrcXO2fAxJZ87rZkSM6Gbws6gqNf9ax7-cHQM","image_bg_color":"ffffff","gplus_url":"","twitter_url":"https://twitter.com/redhenlab","blog_url":null,"application_instructions":"Please clearly state your proposal, whether it is a new project or an improvement to an existing system.  \n\nBear in mind that your project should result in a module that is installed on our high performance computing cluster, fully tested, with clear instructions, and ready to be deployed to process a massive data set.  The module should include a well documented API file that can be used by a wide variety of coders, especially those who come after you, and those who are not experts in your problem domain.\n\nYour project should be scaled to the appropriate level of ambition, so that at the end of the summer you have a working product.  Be realistic and honest with yourself about what you think you will be able to accomplish in the course of the summer.  Provide a detailed list of the steps you believe are needed, the tools you propose to use, and a weekly schedule of deliverables.  Clear and proper documentation can take much longer than expected.\n\nIf you are proposing a machine learning project, base the proposal on techniques that have already been successful in other similar projects.  Include as much information about previous research and results as possible.  Accuracy measurements will be required, and they should be as automated as possible.\n\nPlease be prepared to follow code formatting standards closely and to work with Singularity (virtual Linux system) images throughout the summer.","topic_tags":["multimedia","audio processing","video processing","artificial intelligence","machine learning"],"technology_tags":["python","scikit-learn","tensorflow","singularity","syntaxnet"],"proposal_tags":["speech","non-speech audio","gesture","emotion","face processing","visualization.","cognitive theory","measurement","high performance computing","other"],"ideas_list":"https://sites.google.com/site/distributedlittleredhen/summer-of-code/google-summer-of-code-2018-ideas-page","contact_method":"redhenlab@gmail.com","program_year":2018},"student":{"id":6665359046737920,"display_name":"Ajinkya Takawale","program_year":2018},"abstract":"Now, it is common for news videos to incorporate both auditory and visual modalities. Developing a multi-modal Speech to Text model seems very tempting for these datasets. The next goal is to develop a multi-modal Speech to Text system (AVSR) by extracting visual modalities and concatenating them to the previous inputs.\n\nThis project would extend already implemented previous GSOC candidate Divesh Pandey's speech recognition project.[\\[1\\]](https://github.com/pandeydivesh15/AVSR-Deep-Speech) The implemented work was based on the paper Deep Speech [\\[2\\]](https://arxiv.org/abs/1412.5567) but the authors of the original paper have proposed the second version of the same, Deep Speech 2 [\\[3\\]](https://arxiv.org/abs/1512.02595) which is completely End-to-End solution with no hand engineered features and also more efficient. I will primarily focus on using methods that are more accurate and robust in terms of computing power.\npower.","assignee_display_names":["Karan Singla","Abhinav Shukla","littleowen"],"program_year":2018},{"id":6706919901757440,"title":"Proposal for RoboSherlock GSOC 18","subcategory":"robosherlock","organization":{"id":4822679752802304,"name":"Institute for Artificial Intelligence","slug":"institute-for-artificial-intelligence","website_url":"http://ai.uni-bremen.de/","category":"science_and_medicine","contact_email":null,"mailing_list":null,"irc_channel":"https://gitter.im/iai_gsoc18/","tagline":"Research in Artificial Intelligence for Autonomous Mobile Robots","precis":"The Institute for Artificial Intelligence is part of the Faculty of Computer Science and member of the Center for Computing and Communication Technologies at University of Bremen.","description":"The Institute for Artificial Intelligence (IAI) at the University of Bremen, Germany, headed by Prof. Michael Beetz, investigates methods for cognition-enabled robot control. The research is at the intersection of robotics and Artificial Intelligence (AI) and includes methods for intelligent perception, dexterous object manipulation, plan-based robot control and knowledge representation for robots. Robots performing complex tasks in open domains, such as assisting humans in a household or collaboratively assembling products in a factory, need to have cognitive capabilities for interpreting their sensor data, understanding scenes, selecting and parameterizing their actions, recognizing and handling failures and interacting with humans. IAI develops solutions for these kinds of issues, implements and test them on the robots in our laboratory. A particular focus of the group is on the integration of individual methods into complete cognition-enabled robot control systems and the release of the developed software as open-source libraries.","tags":[],"primary_open_source_license":"BSD 3-Clause \"New\" or \"Revised\" License (BSD-3-Clause)","image_url":"//lh3.googleusercontent.com/rFm-Vagm1OaUcioy9RHBVq-T3POHZMYL6s8eHeFqzMU91bJ01Cpap5aVE-KdQwaanCZUDma0YmkqHrv77sH_gjxXWn_j0w","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/iai_bremen?lang=en","blog_url":"http://ai.uni-bremen.de/","application_instructions":"**Please read the up to date instructions from our [application page](http://ai.uni-bremen.de/teaching/gsoc2018)**. Every project will have a small test/tutorial that have to be fulfilled in order to consider the application of the student. We do this in order to avoid copy-paste applications from students. The tutorials/tests are relatively simple and only require students proof that they managed to install and the required software and write a possible 'Hello World' code snippet.","topic_tags":["artificial intelligence","robotics","simulation","unreal engine","perception"],"technology_tags":["c++","python","ros","unreal engine","lisp"],"proposal_tags":["pracmln","robosherlock","openease","robcog","ros2","ue_editor","cram"],"ideas_list":"http://ai.uni-bremen.de/teaching/gsoc2018","contact_method":"https://gitter.im/iai_gsoc18/","program_year":2018},"student":{"id":6077974286172160,"display_name":"Shixin Li","program_year":2018},"abstract":"This project targets at enabling the current RoboSherlock to work in form of parallel pipeline, which also includes merging results of different camera configurations. In this proposal, I present my plan, methods, timeline and some related experience.","assignee_display_names":["jawo","Ferenc Balint-Benczedi"],"program_year":2018},{"id":6708351132499968,"title":"Language Server Plugin in Xi","subcategory":"integration","organization":{"id":5694377121284096,"name":"Xi Editor Project","slug":"xi-editor-project","website_url":"https://github.com/google/xi-editor","category":"end_user_applications","contact_email":"raph@google.com","mailing_list":"https://www.reddit.com/r/xi_editor/","irc_channel":"https://botbot.me/mozilla/xi/","tagline":"A modern text editor with a backend written in Rust.","precis":"A modern text editor with a backend written in Rust.","description":"The xi-editor project is an attempt to build a high quality text editor,\nusing modern software engineering techniques. It is initially built for\nMac OS X, using Cocoa for the user interface. There are also frontends for\nother operating systems available from third-party developers.\n\nGoals include:\n\n* ***Incredibly high performance***. All editing operations should commit and paint\n  in under 16ms. The editor should never make you wait for anything.\n\n* ***Beauty***. The editor should fit well on a modern desktop, and not look like a\n  throwback from the ’80s or ’90s. Text drawing should be done with the best\n  technology available (Core Text on Mac, DirectWrite on Windows, etc.), and\n  support Unicode fully.\n\n* ***Reliability***. Crashing, hanging, or losing work should never happen.\n\n* ***Developer friendliness***. It should be easy to customize xi editor, whether\n  by adding plug-ins or hacking on the core.\n\nPlease refer to the [November 2017 roadmap](https://github.com/google/xi-editor/issues/437)\nto learn more about planned features.","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/bpBHtNQ-7ZPC3Vbim5N_5YaY_xL8In7umlrH_3ANwsHMQd3DUBqJG2Anfhuqp2YiiM7zDPjkUjHcUS-pSyMqOJShgrCBkw","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"The best way to apply is to pick a major project on the roadmap or in the issue tracker, and indicate that you want to work on it - can be in the issue if you don't mind your interest being public, or privately.\n\nA major focus this summer will be building out the plug-in ecosystem (currently there's a fairly complete syntax highlighting plugin but the rest are prototypes). Great projects would include:\n\n* Connecting xi-editor to the Language Server protocol\n\n* Building really good code search features, perhaps using kythe as the back-end\n\n* Using parser expression grammars (PEGs) to make a higher performance syntax highlighter\n\n* Extending the UI and writing a plugin for version control (git) integration","topic_tags":["text editing","ide"],"technology_tags":["rust","swift"],"proposal_tags":["new feature","integration"],"ideas_list":"http://google.github.io/xi-editor/gsoc.html","contact_method":"raph@google.com","program_year":2018},"student":{"id":6406276150460416,"display_name":"Pranjal Paliwal","program_year":2018},"abstract":"Xi-Editor currently has a support of plugins but the Plugin API is quite small. The current plugin API has support for implementing things like indentation and syntax check. A lot more useful features can be realized by adding a plugin that supports the Language Server Protocol. It would enable advanced features in the editor like:\n- Intelligent Autocompletion\n- Hover definitions\n- Go-to reference and definition of a symbol.\n- Highlight references of a symbol\n\nThis project aims at adding Language Server Protocol client plugin to the Xi Editor","assignee_display_names":["Colin Rofls","Vitali Lovich"],"program_year":2018},{"id":6708879816130560,"title":"Coverage Boost (Java) & Recycle Bin","subcategory":"given-idea","organization":{"id":5898727303151616,"name":"TEAMMATES @ National University of Singapore","slug":"teammates-national-university-of-singapore","website_url":"https://github.com/teammates/teammates","category":"web","contact_email":"teammates@comp.nus.edu.sg","mailing_list":"https://github.com/TEAMMATES/teammates#contacting-us","irc_channel":null,"tagline":"An online feedback management system for education","precis":"TEAMMATES is an award winning online feedback management system for education, used by over 200k users. It is a free Java EE SaaS application that runs on the Google App Engine.","description":"TEAMMATES is an award winning online feedback management system for education, used by over 200k users. It is a free Java EE SaaS application that runs on the Google App Engine. TEAMMATES won the grand prize at the OSS World Challenge 2014 and took part in GSoCs 2014-17 as a mentoring organization.\n\nOne of the main aims of TEAMMATES (the project)  is to train students in contributing to non-trivial OSS productions system. TEAMMATES has received contributions of 300+ student developers and have done more than 200 releases over a six year period. \n\nBecause TEAMMATES (the product) is a software for students by students, students can relate to the problem domain better. The scale of the system is big enough (~125 KLoC) without being overwhelmingly big. \n\nThe [TEAMMATES project](https://github.com/TEAMMATES/teammates) is based in the School of Computing, National University of Singapore. Product website: [http://teammatesv4.appspot.com/](http://teammatesv4.appspot.com/)","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/pz4Ocy5Fecbn-NxUtEcmoTho3TbUpKOD1DergUMEZSUNq7NHevuRcB0hkiDEbnmfZCrmJ7C4_3gKfEJpwK75h5zlc2DYa74","image_bg_color":"000000","gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"http://tinyurl.com/teammates-gsoc","topic_tags":["education","teaching","cloud","web applications"],"technology_tags":[" java","appengine","javascript"],"proposal_tags":["given-idea","self-proposed"],"ideas_list":"http://tinyurl.com/teammates-ideas","contact_method":"teammates@comp.nus.edu.sg","program_year":2018},"student":{"id":6632197067374592,"display_name":"Sun Shengran","program_year":2018},"abstract":"This is a TEAMMATES project proposal designing solutions for increasing the coverage of Java code and implementing Recycle Bin feature. The detailed designs are shown in steps inside the proposal.","assignee_display_names":["Darren","Joanne Ong"],"program_year":2018},{"id":6709787799060480,"title":"Finish aima-python algorithms","subcategory":"python","organization":{"id":5674023002832896,"name":"aimacode","slug":"aimacode","website_url":"http://github.com/aimacode","category":"languages","contact_email":"peter.norvig+gsoc@gmail.com","mailing_list":null,"irc_channel":"https://gitter.im/aimacode/Lobby","tagline":"Code for the book \"Artificial Intelligence: A Modern Approach\"","precis":"Code to accompany the textbook  \"Artificial Intelligence: A Modern Approach\"","description":"This project provides implementations of the pseudocode algorithms in the textbook \"Artificial Intelligence: A Modern Approach,\" along with tutorial examples of their usage, emphasizing visualizations that help students understand both the core underlying concepts and the specific ways to invoke the code.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/6iWHAJ0GSuYnGcD-Uzxj3DX2ai_Hq3GlYGEziwBRSIfkM8MqYfsDsZ6ARvuKCWOszF3rtAXEkbhfAEoOvXDlpRegk4iwoQ","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"See https://github.com/aimacode/aima-gsoc","topic_tags":["artificial intelligence","machine learning","education"],"technology_tags":[" python"," java"," javascript","ai","jupyter"],"proposal_tags":["java","javascript","python","exercises"],"ideas_list":"https://github.com/aimacode/aima-gsoc","contact_method":"peter.norvig+gsoc@gmail.com","program_year":2018},"student":{"id":5164085709111296,"display_name":"Maria Ioanna Spyrakou","program_year":2018},"abstract":"Work on algorithms for computing: \nModel-Based-Reflex-Agent, Online-DFS-Agent, Hybrid-Wumpus-Agen, Graphplan, Partial-Order-Planner, Hierarchical-Search, Angelic-Search, Doubles-tennis, DT-Agent, Prior-Sample, Information-Gathering-Agent, POMDP-Value-Iteration, Cross-Validation, Decision-List-Learning.","assignee_display_names":["Pierre de Lacaze"],"program_year":2018},{"id":6709927653933056,"title":"To Do: Make Todoist and Todo.txt integration shine","subcategory":"optimization","organization":{"id":5900447454330880,"name":"GNOME","slug":"gnome","website_url":"https://www.gnome.org/","category":"operating_systems","contact_email":null,"mailing_list":null,"irc_channel":"https://wiki.gnome.org/Community/GettingInTouch","tagline":"A free desktop environment for GNU/Linux.","precis":"GNOME offers an easy to understand desktop and applications for your GNU/Linux computer.","description":"# Non-profit organization that creates a computing platform for the general public\n\nThe GNOME project builds the technologies, platform, middle-ware, applications and environment to create a free software solution for using your personal computer. The GNOME project is:\n\n## Independent\n\nOur board is democratically elected, and technical decisions are made by the engineers doing the work. We are supported by many organizations; employees from over a hundred companies have contributed since the project began.\n\n## Free\n\nWe believe that software should be developed in the open. Our development infrastructure and communication channels are public, and our code can be freely downloaded, modified and shared with others. All our contributors have the same rights.\n\n## Connected\n\nOur project is an important part of the Free Software ecosystem. We work with other free projects to create high-quality solutions that span the entire software stack.\n\n## People-focused\n\nOur software is translated into many languages and comes with built in accessibility features. This means that it can be used by anyone, regardless of the language they speak or their physical abilities.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/PuUTd0LqAyd7EduWdbN5HFzAlSw2GGU5HR8Mu3xu2BTbWhuyHK0rDrGnxHdHWiK6mbM1yqUuB5kG8k3L_S91DVaDR6rh3pw","image_bg_color":null,"gplus_url":"https://plus.google.com/+gnome","twitter_url":"https://twitter.com/gnome","blog_url":"https://planet.gnome.org/","application_instructions":"Read our instructions and requirements to aplpy for GNOME at https://wiki.gnome.org/Outreach/SummerOfCode/Students","topic_tags":["desktop","applications","end user applications","operating system"],"technology_tags":["c","python"," javascript","gtk+","gobject"],"proposal_tags":["desktop","application","gnome","sandboxing","ui","feature","optimization","middleware","operating systems"],"ideas_list":"https://wiki.gnome.org/Outreach/SummerOfCode/2018/Ideas","contact_method":"https://wiki.gnome.org/Community/GettingInTouch","program_year":2018},"student":{"id":6671111886995456,"display_name":"Rohit Kaushik","program_year":2018},"abstract":"The project aims at improving the Todo.txt and Todoist plugin and to make them production ready. The Todo.txt parser will be improved to implement several features that GNOME To Do offers but is missing from Todo.txt i.e subtasks, list background color, notes etc. Todoist plugin will also undergo improvement and automatic synchronization, handling of network connectivity loss issues will be resolved.","assignee_display_names":["Georges Stavracas"],"program_year":2018},{"id":6711125681373184,"title":"Parallel Automatic Differentiation","subcategory":"libraries","organization":{"id":5706672807346176,"name":"Haskell.org","slug":"haskellorg","website_url":"http://haskell.org","category":"languages","contact_email":"committee@haskell.org","mailing_list":"https://www.haskell.org/mailing-lists","irc_channel":"https://www.haskell.org/irc","tagline":"Standardized, statically typed, lazy functional programming language","precis":"Haskell is an advanced, purely functional programming language. It boasts a strong type system with type inference. It compiles to fast native code with a concurrent runtime.","description":"Haskell is an advanced, general-purpose, purely functional programming language.  It has a strong, static type system with Hindley-Milner type inference.\n\nThe language natively supports lazy evaluation, and functions are generally not allowed to have side effects. This leads to a concise and declarative style of programming, which differs quite a bit from conventional languages. By not allowing side effects and dealing with immutable data, the compiler can avoid whole classes of bugs.\n\nHaskell generally compiles to fast, native code, but it can also be compiled to other targets like JavaScript (through GHCJS) or LLVM.\n\nIn Google Summer of Code, we attempt to improve not only the language, but the whole ecosystem. This includes (aside from the language itself):\n\n- Compilers\n- Commonly used libraries\n- Commonly used applications written in Haskell\n- Profilers, debuggers and other tools\n- Package managers and infrastructure\n\nWe have compiled an ideas list together with long-time Haskell users, compiler contributors and researchers, and as such we believe these are important projects for the industry and academia both.","tags":[],"primary_open_source_license":"BSD 3-Clause \"New\" or \"Revised\" License (BSD-3-Clause)","image_url":"//lh3.googleusercontent.com/R69vxlOjPB5z8Peu1_qCHLUltzlE3M9SMA_yu5sV7lopKUWXk084ZkGxCCueGDqOQDcq6Je2dK42LziUGkplG8Rj44-pW_c","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/haskellorg","blog_url":null,"application_instructions":"We have a [list of project ideas](https://summer.haskell.org/ideas.html).\n\nIn this list, prominent members of the Haskell community have suggested projects they care to address and fit well (time- and subject-wise) within the scope of the Google Summer of Code.  The current authors of this list range from university professors (e.g., Eisenberg) to advanced ghc developers (e.g., Gamari). Yet, contributions to the project ideas list is still open, inviting students to propose variations of the current ideas or a completely new project. The Haskell.org community is welcoming and happy to discuss these ideas with prospective students, via IRC or our mailing lists.\n\nEach project is labeled with its difficulty level, ranging from \"Beginner\", targeting newcomers, to \"Advanced\", better fitted for students who already have experience with Haskell. The exact prerequisites differ from project to project, thus it is suggested for students to contact their prospective mentor before submitting an application.\n\nFrom our side, when evaluating the student applications it is crucial that the applicant understands the problem and knows how to tackle it. Students should break down the project into smaller problems, assigning difficulty and time estimates to those sub-problems and explain how these sub-problems fit in the bigger picture of the project.\n\nWe also suggest adding some more information about the student's experience and education (if any), even if this relates to another programming language or technology.","topic_tags":["functional-programming","programming languages"],"technology_tags":["haskell"],"proposal_tags":["haskell","compilers","libraries","package managers","functional programming","cabal","yaml","codeworld","graphs","ghc"],"ideas_list":"https://summer.haskell.org/ideas.html","contact_method":"committee@haskell.org","program_year":2018},"student":{"id":5236544223313920,"display_name":"Andrew Knapp","program_year":2018},"abstract":"Automatic Differentation (AD) is a technique for computing derivatives of numerical functions that does not use symbolic differentiation or finite-difference approximation. AD is used in a wide variety of fields, such as machine learning, optimization, quantitative finance, and physics, and the productivity boost generated by parallel AD has played a large role in recent advances in deep learning.\n\nThe goal of this project is to implement parallel AD in Haskell using the \\verb|accelerate| library. If successful, the project will provide an asymptotic speedup over current implementations for many functions of practical interest, stress-test a key foundation of the Haskell numerical infrastructure, and provide a greatly improved key piece of infrastructure for three of the remaining areas where Haskell's ecosystem is immature.","assignee_display_names":["ekmett","tmcdonell","Alois Cochard"],"program_year":2018},{"id":6714339122216960,"title":"SUSI Analytics","subcategory":"javascript","organization":{"id":4799958788603904,"name":"FOSSASIA","slug":"fossasia-3","website_url":"https://fossasia.org","category":"web","contact_email":"fossasia@googlegroups.com","mailing_list":"http://groups.google.com/group/fossasia","irc_channel":"https://gitter.im/fossasia/fossasia","tagline":"Improve People's Lives","precis":"Improving people's lives around the world with software and hardware for conversational AIs, science and event management.","description":"FOSSASIA develops Open Source software and hardware for conversational AIs, science and event management with a global developer community from its base in Asia. The organization also organizes Open Technology events, runs coding programs and the Codeheat development contest. The annual FOSSASIA Summit is the premier Open Technology event in Asia for developers, contributors, start-ups, and technology companies. FOSSASIA was founded in 2009.","tags":[],"primary_open_source_license":"GNU Library or \"Lesser\" General Public License version 3.0 (LGPL-3.0)","image_url":"//lh3.googleusercontent.com/hYP83k9BWNrIyPa0eE-DYgzk0sWBOPa__03xGMUUQM6mj3N2w9zXDnNdOEFJ4SvX56U1LqXRiPga7nU20A_NBxcusVkghzs","image_bg_color":null,"gplus_url":"https://plus.google.com/u/0/+FOSSASIAorg","twitter_url":"https://twitter.com/fossasia","blog_url":"https://blog.fossasia.org","application_instructions":"Please see our program guidelines and templates here: https://docs.google.com/document/d/1E4kNgrOSw64R2IAG45JSIgQL9Yxia-mG2dqlRcrUo-U/edit","topic_tags":["web development","artificial intelligence","personal assistants"],"technology_tags":["java","javascript","python","android","artificial intelligence"],"proposal_tags":["artificial intelligence","android","web","python","front-end","back-end","server","javascript","hardware","api"],"ideas_list":"https://labs.fossasia.org/ideas","contact_method":"fossasia@googlegroups.com","program_year":2018},"student":{"id":4693616669229056,"display_name":"anshumanv","program_year":2018},"abstract":"Analytics tool to showcase conversational analytics/statistics using the data received from SUSI server.\n\nDeliverables - \n* A PWA using ReactJS to display various metrics and provide visualisations as per the query.\n* A cli tool to fetch data from the server, parse and display the stats in the terminal window.","assignee_display_names":["Mario Behling"],"program_year":2018},{"id":6715262540185600,"title":"Volunteer Management System(VMS)","subcategory":"vms","organization":{"id":6226384251256832,"name":"Systers Community","slug":"systers-community","website_url":"https://anitab.org/systers/","category":"other","contact_email":"systers.keeper@gmail.com","mailing_list":"http://www.systers.org/mailman/listinfo/systers-opensource","irc_channel":"http://systers.io/slack-systers-opensource/","tagline":"Helping women find their potential in code. You are not alone.","precis":"Systers is a community for all women involved in the technical aspects of computing. We have over 7,000 members from more than 65 countries around the world.","description":"# About\nSysters is a community for all women involved in the technical aspects of computing. We have over 7,000 members from more than 65 countries around the world. **We welcome the participation of women technologists of all ages at any stage of their studies or careers.**\n\n# Projects\n# Peace Corps\n- [PC Hub](https://github.com/systers/systers.github.io/wiki/PC-Hub#project-ideas), a site to discuss improvements/features to all Peace Corps projects. PC officials can log in and direct open source contributors on what to improve on an individual project. It can also be used to discuss new applications needed for Peace Corps Volunteers (to assist their service work).\n- [PC Prep Kit](https://github.com/systers/systers.github.io/wiki/PC-Prep-Kit#project-ideas), a site to teach about Malaria. Gamified Education. *After* using this to \"onboard\" PC Volunteers about Malaria, then they will use the Mobile App to keep track of medicine/trips during their service.\n- [Photo Language Translation (PLT)](https://github.com/systers/systers.github.io/wiki/Photo-Language-Translation#project-ideas), an application to assist Peace Corps Volunteers by translation Chuukese into English with picture association. It helps teach Chuukese people the English language as well as preserve Chuukese in a written form.\n\n# Systers \n- [Mailman3](https://github.com/systers/systers.github.io/wiki/Features-for-Mailman-3#project-ideas), an email list to help groups share ideas, support, and collaborate on projects. Systers is upgrading to Mailman3 and we need customized features. We have 28 email lists.\n- [PowerUp](https://github.com/systers/systers.github.io/wiki/PowerUp#project-ideas), founded by a Syster, is a choose-your-own-adventure game that is designed to be inclusive and teaches young girls (ages 11-14) awareness about real-life scenarios. \n- [Portal](https://github.com/systers/systers.github.io/wiki/Portal#project-ideas), a site that brings Systers and Local Communities together, offering both in-person and online events for our global women technologists.\n- [Volunteer Management System (VMS)](https://github.com/systers/systers.github.io/wiki/Volunteer-Management-System#project-ideas), helps keep a record of Systers volunteers so that we can utilize volunteer grants where companies match the number of hours an employee volunteers.\n\n# Systers Open Source\n- [Infrastructure](https://github.com/systers/systers.github.io/wiki/Infrastructure-Automation), technology advances daily and we're slow to keep up. We need updates on apps.\n- [GitHub Pages](https://github.com/systers/systers.github.io/wiki/GitHub-Pages), we have 3 pages that need updates. Our Main and Celebration are informational pages. Slack pages need an onboarding component.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/xsRxKqwjxwnPrGHWYNsJLyrq8nweMyE2CP_rdnKmLWgOkEriejLZDZ6dhZbdwBTHTnRDocRWNcWgj8g-l4x7c30d5KI5tG8","image_bg_color":"ffffff","gplus_url":"https://plus.google.com/u/2/+InSysterhood-GlobalSysters","twitter_url":"https://twitter.com/systers_org","blog_url":"http://systers-opensource.blogspot.com/","application_instructions":"Admins are currently still onboarding new mentors, so please be patient and flexible. Students who submit PRs without prior approval will be closed. Follow our [WorkFlow](http://systers.io/open-source-workflow). This is **not** a PR competition. \n\n**Work on your application thoroughly.** Follow the directions. Once you submit your proposal in the GSoC site, we will give you feedback. **If you wait 2 days before the deadline, we can not guarantee feedback.** Submit early if you want someone to review your application.\n\n1. Read [Do's & Don'ts from Google](https://opensource.googleblog.com/2011/03/dos-and-donts-of-google-summer-of-code.html) & [Make the First Move](http://code.v.igoro.us/posts/2018/02/make-the-first-move.html).\n1. Join the Systers Open Source Slack: [systers.io/slack-systers-opensource/](http://systers.io/slack-systers-opensource/)\n1. Attend a GSoC Open Session.\n1. Look through the [Ideas List](https://github.com/systers/systers.github.io/wiki/GSoC-2018).\n1. Build one of the applications.\n1. Follow [Systers Workflow](http://systers.io/open-source-workflow).\n  - If you cannot follow directions, this will count against you. Please follow our processes.\n1. Fill out the [GSoC 2018 application](https://docs.google.com/document/d/1mABPOVuuGO5TzxAsSV_9PKdkjyVRAr2js_-S43dhCaY/edit?usp=sharing).\n1. Group Interviews will be conducted March 18th-31st. [Sign up here!](https://calendly.com/systers/gsoc18-interviews/)","topic_tags":["mobile applications"," web apps","community"],"technology_tags":["ios","android","python","ruby on rails","javascript"],"proposal_tags":["pc-prep-kit","pc-hub","language-translation","mailman3","powerup","portal","vms","infrastructure","gh-pages","original"],"ideas_list":"https://github.com/systers/systers.github.io/wiki/GSoC-2018","contact_method":"systers.keeper@gmail.com","program_year":2018},"student":{"id":5256377040109568,"display_name":"Anjali  Dhanuka","program_year":2018},"abstract":"The Volunteer Management System (VMS) is a portal useful for volunteer coordinators and volunteers in tracking hours, and reporting.","assignee_display_names":["May","Abhishek Arya","Kamakshi Suri","Ayush Garg"],"program_year":2018},{"id":6717226682417152,"title":"Jitsi Meets Dropbox","subcategory":"new feature","organization":{"id":6487179698634752,"name":"Jitsi","slug":"jitsi","website_url":"https://jitsi.org","category":"social_communications","contact_email":"gsoc@jitsi.org","mailing_list":"https://jitsi.org/mailing-lists/","irc_channel":null,"tagline":"The most innovative Open Source video conferencing community. Period.","precis":"Jitsi is a set of open-source projects that allows you to easily build and deploy secure videoconferencing solutions.","description":"Jitsi is a set of open-source projects that allows you to easily build and deploy secure videoconferencing solutions. At the heart of Jitsi are Jitsi Videobridge and Jitsi Meet, which let you have conferences on the internet, while other projects in the community enable other features such as audio, dial-in, recording, and simulcasting.\n\nJitsi Desktop (previously SIP Communicator) is an audio/video and chat communicator written in Java. It supports protocols such as SIP, XMPP,  Bonjour, etc. It implements a rich set of communications features such as Video calls and conferences with SIP and XMPP Jingle on Linux, macOS, and Windows, call transfers, call encryption and many others. \nThe Jitsi family, and hence our GSoC project ideas, also include other projects such as \nice4j.org - An ICE protocol implementation for robust NAT and firewall traversal (http://ice4j.org)\nlibjitsi - A rich audio/video media stack written in Java (https://jitsi.org/libjitsi)\nJitsi Videobridge - A video relaying server that, together with Jitsi allows for multi-party video calls similar to the ones we do with Google Hangouts (https://jitsi.org/videobridge)\nJitsi Meet - A WebRTC JavaScript application for videoconferencing, which uses XMPP Jingle for signalling and Jitsi Videobridge as a server-side media router. (https://jitsi.org/meet)\nTogether with FLOSS server software like Kamailio, Asterisk and FreeSWITCH, Jitsi represents an open alternative to proprietary communications systems such as Skype, or Live Messenger. Our communities often work together on various problems.\nThe development of Jitsi started at the University of Strasbourg, France (http://www.unistra.fr) but has grown to include contributors from all over the world. Many of them have actually joined after successfully participating in previous GSoC editions. Jitsi is based on the OSGi (http://osgi.org) architecture using the Felix implementation from Apache, which makes it very extensible and developer friendly.","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/Mkks-mF2tZQKDrIiMOtoDeRa1b6IEl2MCrFX7a2xFlEAsDNThYWIOnLH2XBQhpXyvwia6JrIisnytm4Lut5lRQhqvJWJfXc","image_bg_color":"50a9e2","gplus_url":"https://plus.google.com/+JitsiOrg","twitter_url":"https://twitter.com/jitsinews","blog_url":"https://jitsi.org/news/","application_instructions":"The following page provides guidance for students to the Jitsi organization and for the application process in particular: https://jitsi.org/gsoc-2018-application/","topic_tags":["real time communications","web","video conferencing","networking","multimedia"],"technology_tags":["java","javascript","webrtc","react","react native"],"proposal_tags":["new feature","optimization","mobile","client-side","server-side"],"ideas_list":"https://jitsi.org/gsoc/","contact_method":"gsoc@jitsi.org","program_year":2018},"student":{"id":4996443203436544,"display_name":"mindip","program_year":2018},"abstract":"Jitsi is a convenient and fast way to set up video conferencing. Integrating a Dropbox feature to Jitsi's capabilities would add to its support for communication within teams. It would eliminate issues from members unable to obtain links or send files before and after video conferences. They would be able to discuss files real time and ensure that all members are on the same page regarding the content and structure of large projects.","assignee_display_names":["brian baldino","Leonard Kim"],"program_year":2018},{"id":6722332861661184,"title":"Full support of Python 3 in GRASS GIS","subcategory":"grass gis","organization":{"id":5051492877205504,"name":"OSGeo","slug":"open-source-geospatial-foundation","website_url":"https://osgeo.org","category":"other","contact_email":"gsoc-admin@osgeo.org","mailing_list":"https://www.osgeo.org/community/communications/","irc_channel":"https://wiki.osgeo.org/wiki/Google_Summer_of_Code_Recommendations_for_Students#How_to_get_in_contact_via_IRC","tagline":"The Open Source Geospatial Foundation","precis":"OSGeo is a non-profit organization serving as an umbrella organization for the Open Source Geospatial community.","description":"<pre>\nOSGeo is a non-profit organization serving as an umbrella organization for the Open Source Geospatial community in general and several code projects in particular:\n\n## *Web Mapping* ##\n\ndeegree, geomajas, GeoMOOSE, GeoServer, Mapbender, MapFish, MapGuide Open Source, MapServer, OpenLayers\n\n## *Desktop Applications* ##\n\nGRASS GIS, gvSIG, Marble, QGIS\n\n## *Geospatial Libraries* ##\n\nFDO, GDAL/OGR, GEOS, GeoTools, OSSIM, PostGIS\n\n## *Metadata Catalogues* ##\n\nGeoNetwork, pycsw\n\n## *Content Management Systems* ##\n\nGeoNode\n\n## *Other Incubating Projects* ##\n\nistSOS, MetaCRS, Opticks, Orfeo ToolBox (OTB), PyWPS, Team Engine, ZOO-Project\n\n## *Other (non-code) Projects* ##\n\nGeoForAll (Education and Curriculum), OSGeo-Live DVD, Public Geospatial Data\n\nWe host regional and international FOSS4G conferences with typical attendance of 500-1100+ geospatial developers, industry and government leaders, and researchers. Our mailing lists collectively go out to ~ 30,000 unique subscribers.\n</pre>","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/YsAUhayPhGjaONNRQxWt33xOrn1gs0GsGBGZ7zeLYlSyQ1c_Xby2cDUtrbD3AxXVRQz11pwnRLVkc_ZEmGUD9ANVKu_aJA","image_bg_color":null,"gplus_url":"https://plus.google.com/communities/105969056638310510633","twitter_url":"https://twitter.com/osgeo","blog_url":"http://planet.osgeo.org/","application_instructions":"<pre>\nFor more information on how to contact potential OSGeo mentors, including an application template, please see our [Recommendations for Students wiki page](https://wiki.osgeo.org/wiki/Google_Summer_of_Code_Recommendations_for_Students).\n</pre>","topic_tags":["mapping","gis","geospatial","citizen science","open science"],"technology_tags":["c/c++","standards","python","sql","database"],"proposal_tags":["grass gis","istsos","pgrouting","nasa web world wind","postgis","gisquick","gvsig","mapmint4me","pywps"],"ideas_list":"http://wiki.osgeo.org/wiki/Google_Summer_of_Code_2018_Ideas","contact_method":"gsoc-admin@osgeo.org","program_year":2018},"student":{"id":5161351559774208,"display_name":"Sanjeet Bhatti","program_year":2018},"abstract":"The current GRASS GIS version has partial support of Python 3. This project aims to update core GRASS components for Python 3 and update all the python modules, libraries and components like script package, python/ctypes, pygrass, temporal, wxGUI, etc. At the end of this project. GRASS GIS will be compatible with both the versions of python, i.e Python 2.7 and Python 3 with its GUI has support for wxPython 4.","assignee_display_names":["lucadelu","Anna Petrasova"],"program_year":2018},{"id":6722924292079616,"title":"Redevelop FreeType's documentation using markdown","subcategory":"documentation improvement","organization":{"id":4809638168494080,"name":"FreeType","slug":"freetype","website_url":"http://freetype.org","category":"graphics","contact_email":null,"mailing_list":"https://lists.nongnu.org/mailman/listinfo/freetype-devel","irc_channel":null,"tagline":"A software library to render fonts.","precis":"A software library written in C to render fonts.","description":"FreeType font rendering library\n----\n\nFreeType is a freely available software library to render fonts.\n\nIt is written in C, designed to be small, efficient, highly customizable, and portable while capable of producing high-quality output (glyph images) of most vector and bitmap font formats.\n\nSome products that use FreeType for rendering fonts on screen or on paper, either exclusively or partially:\n\n* GNU/Linux and other free Unix operating system derivates like FreeBSD or NetBSD;\n* iOS, Apple's mobile operating system for iPhones and iPads;\n* Android, Google's operating system for smartphones and tablet computers;\n* ChromeOS, Google's operating system for laptop computers;\n* ReactOS, a free open source operating system based on the best design principles found in the Windows NT architecture;\n* Ghostscript, a PostScript interpreter used in many printers.\n\nCounting the above products only, you get more than a _billion_ devices that contain FreeType.","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/K0EHbWQg5L39Thttl7xqXn0DXMGNJ8XNVwEr-qIoFESQf8pJnV1fXtNVhbL3WuuyH3_k7HW-qiPahnQtny3Dwf1FKkP3c837","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"If you are interested in FreeType, please subscribe to the mailing list and introduce yourself, asking any questions you have.  See our GSoC ideas page for suggestions, but feel free to suggest your own projects!","topic_tags":["fonts","truetype","opentype","graphics","rendering"],"technology_tags":["c","gnu make","gnu autotools","python","fonts"],"proposal_tags":["fuzzing support","test framework","new font format","documentation improvement","new feature"],"ideas_list":"https://www.freetype.org/gsoc.html","contact_method":"https://lists.nongnu.org/mailman/listinfo/freetype-devel","program_year":2018},"student":{"id":5070656547323904,"display_name":"Nikhil Ramakrishnan","program_year":2018},"abstract":"The aim of my project is to redesign the documentation methods for FreeType, and make it easier to update and manage the FreeType website. This includes changes in the current method of retrieving and generating the API documentation, one-time conversion of the current pages to Markdown, and deploying the website from a repository by performing Markdown to HTML conversions.","assignee_display_names":["Werner Lemberg"],"program_year":2018},{"id":6723009184792576,"title":"Five or More: Modernisation","subcategory":"application","organization":{"id":5900447454330880,"name":"GNOME","slug":"gnome","website_url":"https://www.gnome.org/","category":"operating_systems","contact_email":null,"mailing_list":null,"irc_channel":"https://wiki.gnome.org/Community/GettingInTouch","tagline":"A free desktop environment for GNU/Linux.","precis":"GNOME offers an easy to understand desktop and applications for your GNU/Linux computer.","description":"# Non-profit organization that creates a computing platform for the general public\n\nThe GNOME project builds the technologies, platform, middle-ware, applications and environment to create a free software solution for using your personal computer. The GNOME project is:\n\n## Independent\n\nOur board is democratically elected, and technical decisions are made by the engineers doing the work. We are supported by many organizations; employees from over a hundred companies have contributed since the project began.\n\n## Free\n\nWe believe that software should be developed in the open. Our development infrastructure and communication channels are public, and our code can be freely downloaded, modified and shared with others. All our contributors have the same rights.\n\n## Connected\n\nOur project is an important part of the Free Software ecosystem. We work with other free projects to create high-quality solutions that span the entire software stack.\n\n## People-focused\n\nOur software is translated into many languages and comes with built in accessibility features. This means that it can be used by anyone, regardless of the language they speak or their physical abilities.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/PuUTd0LqAyd7EduWdbN5HFzAlSw2GGU5HR8Mu3xu2BTbWhuyHK0rDrGnxHdHWiK6mbM1yqUuB5kG8k3L_S91DVaDR6rh3pw","image_bg_color":null,"gplus_url":"https://plus.google.com/+gnome","twitter_url":"https://twitter.com/gnome","blog_url":"https://planet.gnome.org/","application_instructions":"Read our instructions and requirements to aplpy for GNOME at https://wiki.gnome.org/Outreach/SummerOfCode/Students","topic_tags":["desktop","applications","end user applications","operating system"],"technology_tags":["c","python"," javascript","gtk+","gobject"],"proposal_tags":["desktop","application","gnome","sandboxing","ui","feature","optimization","middleware","operating systems"],"ideas_list":"https://wiki.gnome.org/Outreach/SummerOfCode/2018/Ideas","contact_method":"https://wiki.gnome.org/Community/GettingInTouch","program_year":2018},"student":{"id":6653244621717504,"display_name":"ruxandrasimion","program_year":2018},"abstract":"Five or More is a puzzle game in which the player has to align at least five same coloured shapes into a horizontal, vertical or diagonal line to score points. The aim to rewrite the application in Vala, while taking care to do a better separation between the game model and the view, which should allow easier maintainability in future.","assignee_display_names":["Robert Roth"],"program_year":2018},{"id":6724214057336832,"title":"Add New License Submittal Feature to Online Tools","subcategory":"workgroup tools","organization":{"id":5429286840827904,"name":"SPDX","slug":"spdx","website_url":"https://spdx.org","category":"languages","contact_email":null,"mailing_list":"https://lists.spdx.org/mailman/listinfo/spdx-tech","irc_channel":null,"tagline":"Promoting open source compliance through standard communication of SW licenses.","precis":"The Software Package Data ExchangeR (SPDXR) specification is a standard format for communicating the components, licenses and copyrights associated with a software package.","description":"Develop and promote adoption of a specification to enable any party in a software supply chain, from the original author to the final end user, to accurately communicate the licensing information for any piece of copyrightable material that such party may create, alter, combine, pass on, or receive, and to make such information available in a consistent, understandable, and re-usable fashion, with the aim of facilitating license and other policy compliance.","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/TVAnJhs1t64QsSrp5lV14YEDbs4qhfdESEcYX6WGmLPjS0B2HEQJ8h7Nvnzoz-vDnJsF_eEg8HeyWPV-eiG_-Z09DEZQBx1w","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"Please review the requirements described in the project ideas page at http://wiki.spdx.org/view/GSOC/GSOC_ProjectIdeas. Submit your proposals using the GSoC website to the mentor from the ideas page or feel free to contact them directly with questions.","topic_tags":["compliance","open source","licensing"],"technology_tags":["rdf"," python"," java","json"],"proposal_tags":["workgroup tools","specification projects"],"ideas_list":"http://wiki.spdx.org/view/GSOC/GSOC_ProjectIdeas","contact_method":"https://lists.spdx.org/mailman/listinfo/spdx-tech","program_year":2018},"student":{"id":6289941928083456,"display_name":"Galo Castillo","program_year":2018},"abstract":"The aim of this project is to design and develop new features to an existing SPDX web application (https://github.com/spdx/spdx-online-tools), that will allow software licenses producers to generate new license requests submissions in a more robust and user-friendly way. These new features are going to enhance the process that the SPDX legal team follows to check new license request submissions as well as to generate the new licenses XML files. These improvements will reduce the time the process of enriching the SPDX licenses list takes (https://github.com/spdx/license-list-XML).","assignee_display_names":["Rohit Lodha","Gary O'Neall"],"program_year":2018},{"id":6726132632649728,"title":"New Interactions project.","subcategory":"learner experience","organization":{"id":5187129286590464,"name":"Oppia Foundation","slug":"oppia-foundation","website_url":"https://github.com/oppia/oppia","category":"web","contact_email":"oppia-gsoc-mentors-18@googlegroups.com","mailing_list":"https://github.com/oppia/oppia/wiki/Google-Summer-of-Code-2018#communication","irc_channel":"https://github.com/oppia/oppia/wiki/Google-Summer-of-Code-2018#communication","tagline":"Adaptive, enjoyable learning experiences that provide personalized feedback.","precis":"We seek to address the problem of inequitable access to universal high-quality, affordable education, especially for struggling students who cannot attend school regularly.","description":"# Why Oppia?\nOppia’s aim is to provide personalized tutoring to every single person in the world, especially those whose educational needs are not currently being served well. The Oppia platform allows collaborative creation of interactive learning experiences that simulate a friendly, non-judgmental tutor. For an example, see: https://www.oppia.org/collection/4UgTQUc1tala\n\n# Interactive learning\nOppia teaches content in small units called _explorations_. _Learners_ (users who visit Oppia to learn something) explore a new topic through an exploration. Explorations can have multiple paths the learner may take depending on their answers (similar to video games). Different answers result in Oppia responding differently.\n\nA user may repeatedly struggle on a certain question. Oppia can detect this and branch away from the current topic, so that learners may practice fundamentals before attempting that question again. Oppia aims to act like a tutor, an educational guide who can help learners practice topics and watch for any mistakes they might make. One of the most important roles of Oppia is to gently show learners where they went wrong and instruct them on a correct approach. \n\n# Community-driven lesson creation\nThe other half of Oppia is a community of _creators_ (users who create explorations). Creating explorations is a bit like creating a video game, and we face some similar challenges. Our exploration editor needs to help creators identify spots in their explorations where users are struggling, or facilitate the creation of targeted responses and branches for certain types of learner answers (such as addressing common misconceptions among learners). Work in this area also includes facilitating the community side of Oppia by encouraging collaborative content creation among all topic areas.\n\n# Come join us!\nOppia is a very exciting project to work on and we're really excited for more people to join us!","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/uPrh_zcYp8CqY-ZRhss_xilMEfuxv-pHZywKZrdlRR1_3EslMluFLRVKkH1YaBAFCajGlyIYTMrv7XjWPxHFXj12rlAS1fZg","image_bg_color":"ffffff","gplus_url":null,"twitter_url":null,"blog_url":"https://medium.com/oppia-org","application_instructions":"# Applying to Oppia\nPlease take a look at our dedicated GSoC 2018 wiki page [here](https://github.com/oppia/oppia/wiki/Google-Summer-of-Code-2018) for information about project ideas, what we’re looking for in a proposal, a proposal template, and how to apply to our organization. We also strongly recommend taking a look at our [developer wiki](https://github.com/oppia/oppia/wiki) in order to become familiar with our development process.\n\nPlease note that most Oppia work heavily involves AngularJS for frontend development, and Google App Engine with Python 2.7 for backend development. You will also need a GitHub account.","topic_tags":["education","web","interactive","tools","community"],"technology_tags":["angularjs","python"," javascript","appengine"," css"],"proposal_tags":["infrastructure","learner experience","creator experience"],"ideas_list":"https://github.com/oppia/oppia/wiki/Google-Summer-of-Code-2018#oppias-project-ideas","contact_method":"oppia-gsoc-mentors-18@googlegroups.com","program_year":2018},"student":{"id":6420833472348160,"display_name":"Vibhor Agarwal","program_year":2018},"abstract":"This project aims at implementing two new interactions- *Number with units* and *Drag and drop Sorting* interactions. It will create a new learner experience at Oppia in the form of interactions inside the explorations and will aim at improving the learner's skills.","assignee_display_names":["Prasanna Patil"],"program_year":2018},{"id":6728209719099392,"title":"Julia package for Minecraft API","subcategory":"julia","organization":{"id":5724916167475200,"name":"NumFOCUS","slug":"numfocus","website_url":"https://www.numfocus.org","category":"science_and_medicine","contact_email":"info@numfocus.org","mailing_list":"https://groups.google.com/a/numfocus.org/forum/#!forum/gsoc","irc_channel":null,"tagline":"Open Code = Better Science","precis":"The mission of NumFOCUS is to promote sustainable high-level programming languages, open code development, and reproducible scientific research.","description":"NumFOCUS supports and promotes world-class, innovative, open source scientific software. Most individual projects, even the wildly successful ones, find the overhead of a non-profit to be too large for their community to bear. NumFOCUS provides a critical service as an umbrella organization for this projects.\r\n\r\nThe following projects will be participating under the NumFOCUS umbrella:\r\n\r\n- [Cantera](http://cantera.org/) - Cantera is a library to solve problems involving thermodynamics, chemical kinetics, and transport.\r\n- [conda-forge](https://conda-forge.org) - A community led collection of recipes, build infrastructure and distributions for the conda package manager.\r\n- [Data Retriever](http://www.data-retriever.org) - The Data Retriever is a package manager for data. \r\n- [FEniCS Project](https://fenicsproject.org) - FEniCS is an automated finite element library used to solve equations used in modeling, featuring a domain-specific language and automated code generation. \r\n- [Gensim](https://github.com/RaRe-Technologies/gensim) - \"Topic Modelling for Humans.\" Gensim is an open-source Python library for topic modelling, document indexing and similarity retrieval with large corpora.\r\n- [Julia](https://julialang.org) - Julia is a high-level, high-performance dynamic programming language for numerical computing. It provides a sophisticated compiler, distributed parallel execution, numerical accuracy, and an extensive mathematical function library.\r\n- [MDAnalysis](https://www.mdanalysis.org) - MDAnalysis is a Python library to analyze trajectories from molecular dynamics (MD) simulations.\r\n- [PyMC3](http://docs.pymc.io) - PyMC3 is a python module for Bayesian statistical modeling and model fitting which focuses on advanced Markov chain Monte Carlo and variational fitting algorithms.\r\n- [Stan](http://mc-stan.org) - Stan is a probabilistic programming language for data analysis, enabling automatic inference for a large class of statistical models.\r\n- [Shogun](http://shogun.ml) - Shogun is and open-source machine learning library that offers a wide range of efficient and unified machine learning methods.\r\n- [yt](http://yt-project.org) - yt is a community-developed analysis and visualization toolkit for examining datasets in a variety of scientific disciplines.\r\n\r\nVisit our [page](https://github.com/numfocus/gsoc) for more information.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/HVjtQ2I4zfHth4wsGMFWynoFYktTBGviap7IKNbbXqj_jUjs0xBKayi8mvVv4gYe3g3wstalV3dG2UdmWSbYMOA0uG84uPw","image_bg_color":null,"gplus_url":"https://plus.google.com/communities/100008130850352595608","twitter_url":"https://twitter.com/numfocus","blog_url":"http://www.numfocus.org/blog","application_instructions":"For complete instructions have a look at our [github](https://github.com/numfocus/gsoc/blob/master/CONTRIBUTING-students.md) page.","topic_tags":["statistical computing","machine learning","high performance computing","big data","data visualization"],"technology_tags":["python","julia","r","javascript","c++"],"proposal_tags":["pymc3","yt","mdanalysis","conda-forge","data retriever","fenics","gensim","stan","julia","shogun","cantera"],"ideas_list":"https://github.com/numfocus/gsoc/blob/master/2018/ideas-list.md","contact_method":"info@numfocus.org","program_year":2018},"student":{"id":6517807324332032,"display_name":"Aditya Puranik","program_year":2018},"abstract":"A package which uses the Minecraft Pi API and corresponding mod for Java version to build *cool* stuff. Accompanied with documentation and tutorials to help out people with little to no programming experience. Includes scripts to build everything from spheres and cubes to Calculator internals.","assignee_display_names":["Avik Sengupta","Christopher Rackauckas"],"program_year":2018},{"id":6728585126084608,"title":"Fra-oci/oci-fra translator","subcategory":"other","organization":{"id":5779930604896256,"name":"Apertium","slug":"apertium","website_url":"http://www.apertium.org","category":"other","contact_email":"apertium-contact@lists.sourceforge.net","mailing_list":"http://wiki.apertium.org/wiki/Mailing_list","irc_channel":"http://wiki.apertium.org/wiki/IRC","tagline":"A free/open-source platform for machine translation and language technology","precis":"Apertium is a free/open-source project that aims to create machine translation systems and other types of language technology for all the languages in the world.","description":"There are around 7,000 languages in the world today, around half of which are written. Most language technology is only available for a tiny fraction of these. Certainly under 1%. Apertium is a project which aims to help create language technology, particularly machine translation systems for the other 99%. Because most of the languages we work with have very little in the way of existing translations, we rely on making the most of all kinds of different resources from written grammars to dictionaries, corpus collections and help from native speakers and activists.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/PlmlDWSLmPGDO07qA51BQ3ToSVzZYzHFjk651e_HKjm4bdM3y2EH6lm0OGH6j51Y5Q6qJIRbV5Scz3FTW-rTJUgji0fBJQ","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"* __Be realistic__: We're more likely to accept ideas which are realistic than ones which are \"way out there\". But if you have a \"way out there\" idea, don't panic! We're still interested, but we'll try to find a subset of it which is achievable in the time scale available.\n* __Be appropriate__: Demonstrate you have a knowledge of Apertium, how it works and the problem it has that you'd like to solve.\n* __Have a plan__: Three months may seem like a long time, but it isn't. Show you have a definite plan with dates and deliverables split into weeks.\n* __Get in contact ASAP!__: We get a lot of proposals: some good, most bad. Get in contact with your potential mentor '''as soon as possible''' by sending your proposal to the mailing list, and asking for feedback. Be responsive to feedback. Refine your application based on feedback. If the mentors remember you, your chances of being picked are higher. \n* __Read the Ideas Page!__: If you find yourself asking 'do you have any Java/Python/Fortran/x86 assembler projects...' -- you didn't read [[Ideas for Google Summer of Code|the ideas page]]. Read the ideas page.\n* __Do the coding challenge__: Every idea will have a coding challenge to perform, this is basically a test to see if you have the required skills to do the project or if you can acquire them in a short amount of time.","topic_tags":["machine translation","language technology","grammar","natural language processing"],"technology_tags":["c++","python","xml","fsts"],"proposal_tags":["new language pair","engine code","new module","end-user interface","other"],"ideas_list":"http://wiki.apertium.org/wiki/Ideas_for_Google_Summer_of_Code","contact_method":"apertium-contact@lists.sourceforge.net","program_year":2018},"student":{"id":6693322840604672,"display_name":"Claude Balaguer","program_year":2018},"abstract":"I intend to work on a French-Occitan translation pair in order to provide a new translator, which will be useful first to the Occitan community but also to the French people willing to learn more about the Occitan culture and language. It will address more specifically the Occitan Wikipedia users so they can add, work, and improve new articles with a greater ease and speed.","assignee_display_names":["Hèctor Alòs i Font"],"program_year":2018},{"id":6732983172595712,"title":"Liu Jiahui's applicantion for gnome-logs","subcategory":"application","organization":{"id":5900447454330880,"name":"GNOME","slug":"gnome","website_url":"https://www.gnome.org/","category":"operating_systems","contact_email":null,"mailing_list":null,"irc_channel":"https://wiki.gnome.org/Community/GettingInTouch","tagline":"A free desktop environment for GNU/Linux.","precis":"GNOME offers an easy to understand desktop and applications for your GNU/Linux computer.","description":"# Non-profit organization that creates a computing platform for the general public\n\nThe GNOME project builds the technologies, platform, middle-ware, applications and environment to create a free software solution for using your personal computer. The GNOME project is:\n\n## Independent\n\nOur board is democratically elected, and technical decisions are made by the engineers doing the work. We are supported by many organizations; employees from over a hundred companies have contributed since the project began.\n\n## Free\n\nWe believe that software should be developed in the open. Our development infrastructure and communication channels are public, and our code can be freely downloaded, modified and shared with others. All our contributors have the same rights.\n\n## Connected\n\nOur project is an important part of the Free Software ecosystem. We work with other free projects to create high-quality solutions that span the entire software stack.\n\n## People-focused\n\nOur software is translated into many languages and comes with built in accessibility features. This means that it can be used by anyone, regardless of the language they speak or their physical abilities.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/PuUTd0LqAyd7EduWdbN5HFzAlSw2GGU5HR8Mu3xu2BTbWhuyHK0rDrGnxHdHWiK6mbM1yqUuB5kG8k3L_S91DVaDR6rh3pw","image_bg_color":null,"gplus_url":"https://plus.google.com/+gnome","twitter_url":"https://twitter.com/gnome","blog_url":"https://planet.gnome.org/","application_instructions":"Read our instructions and requirements to aplpy for GNOME at https://wiki.gnome.org/Outreach/SummerOfCode/Students","topic_tags":["desktop","applications","end user applications","operating system"],"technology_tags":["c","python"," javascript","gtk+","gobject"],"proposal_tags":["desktop","application","gnome","sandboxing","ui","feature","optimization","middleware","operating systems"],"ideas_list":"https://wiki.gnome.org/Outreach/SummerOfCode/2018/Ideas","contact_method":"https://wiki.gnome.org/Community/GettingInTouch","program_year":2018},"student":{"id":6148608513015808,"display_name":"hello_world_0","program_year":2018},"abstract":"Logs could currently update the view when new log messages are added to the journal.","assignee_display_names":["Jonathan Kang","David King"],"program_year":2018},{"id":6733904443080704,"title":"Improvements for Newt, a Cytoscape.js based SBGN editor","subcategory":"sbgn","organization":{"id":5342987207311360,"name":"National Resource for Network Biology (NRNB)","slug":"national-resource-for-network-biology-nrnb","website_url":"http://www.nrnb.org/gsoc.html","category":"science_and_medicine","contact_email":"alex.pico@gladstone.ucsf.edu","mailing_list":"https://groups.google.com/forum/#!forum/cytoscape-helpdesk","irc_channel":null,"tagline":"Developing open source software to enable network-based biomedical discovery","precis":"The National Resource for Network Biology (NRNB) organizes the development of free, open source software to enable network-based visualization, analysis, and biomedical discovery.","description":"The [National Resource for Network Biology (NRNB)](http://www.nrnb.org) organizes the development of free, open source software technologies to enable network-based visualization, analysis, and biomedical discovery. Biomedical research is increasingly dependent on knowledge expressed in terms of networks, including gene, protein and drug interactions, cell-cell and viral-host communication, and vast social networks. Our technologies enable researchers to assemble and analyze these networks and to use them to better understand biological systems and, in particular, how they fail in disease. \n\nThe NRNB mentoring organization includes projects such as [Cytoscape](http://cytoscape.org/), [WikiPathways](http://wikipathways.org/), [SBML](http://sbml.org/), and [cBioPortal](http://cbioportal.org/). *This is a great opportunity to work at the intersection of biology and computing!* For example, Cytoscape is downloaded **16,000 times per month** by researchers. We take mentoring seriously and are proud of our [>90% success rate](http://www.nrnb.org/alumni.html#gsoc-tab) with former students and projects. But don't take our word for it, read testimonials from prior NRNB students [students](http://www.nrnb.org/testimonials.html#student-tab) and [mentors](http://www.nrnb.org/testimonials.html#mentor-tab).\n\nFind out more about the software projects being developed in coordination with NRNB. Also refer to the [NRNB GSoC page](http://www.nrnb.org/gsoc.html) for additional resources and application tips.","tags":[],"primary_open_source_license":"GNU Library or \"Lesser\" General Public License version 2.1 (LGPL-2.1)","image_url":"//lh3.googleusercontent.com/38WHipWSy-AqM6up-qFtWyISAXcyHXWaFnP3F22R7TFy3Jo96lzifyWycjFBadmvd5kzhLXQTHBeEkc1IQ6ecpKk29jKaA","image_bg_color":null,"gplus_url":"","twitter_url":"https://twitter.com/cytoscape","blog_url":"http://www.nrnb.org/gsoc-reports.html","application_instructions":"Start with [this Google Doc template](https://docs.google.com/document/d/1Zi6L38CHEeq2aL6xzv0Ozhd_Y6D71W3yCBGHplmxr6k). Copy and paste the contents into your own, new Google Doc and begin filling it out. Get in contact with your potential mentors (listed per project) as soon as possible to get input and feedback on your application. Submit your application well before the deadline. Late submissions will NOT be considered.\n\n\n##Template:\n\n###<Your Proposal Title>\n####Personal Background\n* Name, email, links\n* Education and relevant work experience\n####Relevant Skills\n* What are your languages of choice and how do they relate to the project?\n* Any prior experience with open source development?\n* What do you want to learn this summer?\n* Any prior exposure to biology or bioinformatics?\n####Project Proposal\n* Project overview, expanded from your mentor’s (or your original) idea\n* Project details. Multiple sections describing key aspects of the project. Provide as much detail as possible\n* Strong applicants include an implementation plan and timeline (hint!)\n* Refer to and link to other projects or products that illustrate your ideas\n* Identify possible hurdles and questions that will require more research and planning\n####Your Availability\n* When do your classes and exams finish?\n* Do you have any other school-related activities scheduled during the coding period?\n* Do you have a full- or part-time job or internship planned for this summer?\n* How many hours per week do have available for a summer project?","topic_tags":["network analysis","biology","data visualization","data modeling","web applications"],"technology_tags":["java","javascript","python","html","c/c++"],"proposal_tags":["cytoscape","cytoscape.js","sbml","sbol","sbgn","wikipathways","graphspace","pathvisio","centiscape","cytoscape app"],"ideas_list":"https://github.com/nrnb/GoogleSummerOfCode/issues","contact_method":"alex.pico@gladstone.ucsf.edu","program_year":2018},"student":{"id":4917055027937280,"display_name":"Ahmet Çandıroğlu","program_year":2018},"abstract":"Newt is a free, web-based, open source viewer and editor for pathways in Systems Biological Graphical Notation (SBGN). It is written with a series of libraries and extensions based on Cytoscape.js with utmost customization in mind. The purpose of this project is to improve Newt editor so that it is much easier to use and many more people can benefit from it.","assignee_display_names":["Ugur Dogrusoz","Alexander Mazein"],"program_year":2018},{"id":6737102515994624,"title":"Lone Pseudoranger: Orbit position data analysis and interpolation (3D)","subcategory":"cubesats","organization":{"id":6105960616034304,"name":"AerospaceResearch.net","slug":"aerospaceresearchnet","website_url":"http://www.aerospaceresearch.net","category":"science_and_medicine","contact_email":"gsoc2018with@aerospaceresearch.net","mailing_list":"https://lists.shackspace.de/mailman/listinfo/constellation","irc_channel":"https://aerospaceresearch.net/?page_id=612","tagline":"making space together","precis":"Making Space Together!","description":"We are AerospaceResearch.net, a small team of space makers solving space problems together with Small Satellite Student Society University o Stuttgart (KSat e.V.) and the Cosmic Dust Team.\n\nIn 2011, we started as a student group at the University of Stuttgart to provide massive computing power with our distributed computting platform Constellation to everyone needing it for space simulations. Over time, we attracted international young professionals of the space industry and the local maker community and thus becoming a full fletched citizen science project.\n\nWe are a community project of several Projects working of different Teams in Stuttgart and globally. Together with the Small Satellite Student Society University o Stuttgart (KSat e.V.) , the Distributed Ground Station Network Team at the Institute for Photogrammetry and the Cosmic Dust Team of the Institute for Space Systems at University of Stuttgart, we are working on the rover mission ROACH crawling for maintenance reasons on the outer hull of a sounding rocket while coasting in near space, tracking cubesats faster than US NORAD and simulating cometary dust particles for the IMEX project of the European Space Agency (ESA).\n\nWe are a small organization but having impact within out space community and helping realizing space exploration by creativity and open access. We are open for everybody interested in space for the \nbetterment of everybody.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/rYXF5UmRdUh6kTq56KB2TnWk9nFMnrSvd3Soef9gTXYLpdmA3HSjNdRzeN05j1CP1s-MVmDXlGtQNYqv4fgj_Anoe3dfmv0","image_bg_color":null,"gplus_url":"https://plus.google.com/communities/103284191158859493054","twitter_url":"https://twitter.com/ARDNnews","blog_url":"http://aerospaceresearch.net","application_instructions":"We posted a list of points you, as an interested student, can get if you follow our list of things we want to see from you in your application and the communication phase. It is on our ideas page under \"Transparent Application Rating\" >> https://aerospaceresearch.net/?page_id=612","topic_tags":["cubesats","space applications","software defined radio","distributed computing","simulations"],"technology_tags":["python","c/c++","vhdl","boinc"," java"],"proposal_tags":["digital signal processing","software defined radio","gnss","cubesats","navigation","distributed computing","citizen science","simulations","space","big data"],"ideas_list":"https://aerospaceresearch.net/?page_id=612","contact_method":"gsoc2018with@aerospaceresearch.net","program_year":2018},"student":{"id":4854288442982400,"display_name":"Arya Das","program_year":2018},"abstract":"Enabling orbit determinator to predict orbits using real time data. It will be done using 5 steps:\n1. Finding a set of Keplerian elements that approximate the orbit well.\n2. Propagate the state until new observed data is available.\n3. Fetch new observations.\n4. Refine the estimate using Kalman filter.\n5. Repeat steps 2 to 4.\n\nAlso, allowing orbit determinator to output the data in various ways (position, velocity or right ascension, declination or ground track or 3D plot).","assignee_display_names":["Nilesh Chaturvedi","AerospaceResearch.net","Alexandros Kazantzidis"],"program_year":2018},{"id":6737939497746432,"title":"Supporting Other Geometries Recording","subcategory":"mapmint4me","organization":{"id":5051492877205504,"name":"OSGeo","slug":"open-source-geospatial-foundation","website_url":"https://osgeo.org","category":"other","contact_email":"gsoc-admin@osgeo.org","mailing_list":"https://www.osgeo.org/community/communications/","irc_channel":"https://wiki.osgeo.org/wiki/Google_Summer_of_Code_Recommendations_for_Students#How_to_get_in_contact_via_IRC","tagline":"The Open Source Geospatial Foundation","precis":"OSGeo is a non-profit organization serving as an umbrella organization for the Open Source Geospatial community.","description":"<pre>\nOSGeo is a non-profit organization serving as an umbrella organization for the Open Source Geospatial community in general and several code projects in particular:\n\n## *Web Mapping* ##\n\ndeegree, geomajas, GeoMOOSE, GeoServer, Mapbender, MapFish, MapGuide Open Source, MapServer, OpenLayers\n\n## *Desktop Applications* ##\n\nGRASS GIS, gvSIG, Marble, QGIS\n\n## *Geospatial Libraries* ##\n\nFDO, GDAL/OGR, GEOS, GeoTools, OSSIM, PostGIS\n\n## *Metadata Catalogues* ##\n\nGeoNetwork, pycsw\n\n## *Content Management Systems* ##\n\nGeoNode\n\n## *Other Incubating Projects* ##\n\nistSOS, MetaCRS, Opticks, Orfeo ToolBox (OTB), PyWPS, Team Engine, ZOO-Project\n\n## *Other (non-code) Projects* ##\n\nGeoForAll (Education and Curriculum), OSGeo-Live DVD, Public Geospatial Data\n\nWe host regional and international FOSS4G conferences with typical attendance of 500-1100+ geospatial developers, industry and government leaders, and researchers. Our mailing lists collectively go out to ~ 30,000 unique subscribers.\n</pre>","tags":[],"primary_open_source_license":"GNU General Public License version 2.0 (GPL-2.0)","image_url":"//lh3.googleusercontent.com/YsAUhayPhGjaONNRQxWt33xOrn1gs0GsGBGZ7zeLYlSyQ1c_Xby2cDUtrbD3AxXVRQz11pwnRLVkc_ZEmGUD9ANVKu_aJA","image_bg_color":null,"gplus_url":"https://plus.google.com/communities/105969056638310510633","twitter_url":"https://twitter.com/osgeo","blog_url":"http://planet.osgeo.org/","application_instructions":"<pre>\nFor more information on how to contact potential OSGeo mentors, including an application template, please see our [Recommendations for Students wiki page](https://wiki.osgeo.org/wiki/Google_Summer_of_Code_Recommendations_for_Students).\n</pre>","topic_tags":["mapping","gis","geospatial","citizen science","open science"],"technology_tags":["c/c++","standards","python","sql","database"],"proposal_tags":["grass gis","istsos","pgrouting","nasa web world wind","postgis","gisquick","gvsig","mapmint4me","pywps"],"ideas_list":"http://wiki.osgeo.org/wiki/Google_Summer_of_Code_2018_Ideas","contact_method":"gsoc-admin@osgeo.org","program_year":2018},"student":{"id":5672965581045760,"display_name":"Iba DIOUF","program_year":2018},"abstract":"The MapMint4ME holds the capability to store the position of a point feature when acquired using the Android application. This geometry information is stored in the SQLite database of the MapMint4ME. The same information can be visualized using the web-application of MapMint by transferring the corresponding feature information.\nWe need to expand this idea to store linear as well as polygonal geometries information in the MapMint4ME. The features associated with these geometries would then be overlayed upon the base maps in the MapMint and MapMint4ME interfaces for visualization. Moreover, this would give users the capability to create the new line and polygon features with corresponding attributes.","assignee_display_names":["djay","Rajat Shinde"],"program_year":2018},{"id":6738434425618432,"title":"A new MySQL driver for Ecto","subcategory":"elixir","organization":{"id":6486585449644032,"name":"Beam Community","slug":"beam-community","website_url":"http://beamcommunity.github.io","category":"languages","contact_email":"contact@process-one.net","mailing_list":"https://groups.google.com/d/forum/beam-community","irc_channel":"http://beamcommunity.github.io","tagline":"From distributed systems, to robust servers and language design on the Erlang VM","precis":"The BEAM Community is a group of projects that run on the Erlang VM. Our goal is to host relevant projects in the Erlang and Elixir communities.","description":"The BEAM Community is a group of OSS projects that run on the Erlang VM. Our goal is to host relevant projects in the Erlang community, making it easy for those projects to participate in the Google Summer of Code and for interested students to pick their best choice. The Erlang VM was originally designed by Ericsson to support distributed, fault-tolerant, soft-real-time, non-stop applications.\n\nMany companies around the world like Amazon, Heroku and Activision use the Erlang VM in their stack and open source projects like ejabberd, Riak, Phoenix, CouchDB, Zotonic, Nerves project and many more are built on top of it. Our currently hosted projects include the Elixir programming language, BarrelDB, a distributed database, LASP, a language for Distributed Eventually consistent computations, and ejabberd, a robust XMPP server used largely around the world and others. This gives students a wide range of choices, that goes from working on distributed systems, to maintaining robust servers and language design.","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/hjzZApZuMw_-uRSSfd73M9Pj2O-kEpGUns5-eUe8zi3xJZQceMwRqW8SPK_6ZddNFxR6SZhEK2dgrXx--xwptKnyYZdxN8A","image_bg_color":"3567b4","gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"Now is a great time to get started! Go over our Projects / Ideas list and pick the projects and ideas that interest you the most! Also, subscribe to our mailing list and join us at #beam-community on irc.freenode.net\n\nStudents should pick their projects and submit proposals from 12th to 27th March 2018. We recommend students to work closely with mentors in order to craft the best proposals. Our mailing list is the best place to ask questions and get more details about our projects!","topic_tags":["distributed computing","real time","distributed databases","iot","instant messaging"],"technology_tags":["erlang","xmpp"],"proposal_tags":["xmpp","distributed-computing","erlang","elixir","database","iot"],"ideas_list":"https://github.com/beamcommunity/beamcommunity.github.com/wiki","contact_method":"contact@process-one.net","program_year":2018},"student":{"id":6023023669280768,"display_name":"Ben Yip","program_year":2018},"abstract":"The purpose of this project is to implement a new MySQL driver for Ecto. Ecto is a language integrated query and database mapper for Elixir. While it currently has an adapter for MySQL leveraging mariaex, we believe the community would benefit from a new driver that is closer in design to Postgrex.","assignee_display_names":["Michał Muskała"],"program_year":2018},{"id":6738600452947968,"title":"Implementing Kernel Address Sanitizer (KASan) in the NetBSD kernel","subcategory":"kernel","organization":{"id":6559863631511552,"name":"The NetBSD Foundation","slug":"the-netbsd-foundation","website_url":"https://www.NetBSD.org/","category":"operating_systems","contact_email":"gsoc-admin@NetBSD.org","mailing_list":"https://www.netbsd.org/mailinglists/","irc_channel":"https://wiki.netbsd.org/community/","tagline":"Of course it runs NetBSD","precis":"A free portable operating system","description":"NetBSD is a free, fast, secure, and highly portable Unix-like Open Source operating system. It is available for a wide range of platforms, from large-scale servers and powerful desktop systems to handheld and embedded devices. Its clean design and advanced features make it excellent for use in both production and research environments, and the source code is freely available under a business-friendly license. NetBSD is developed and supported by a large and vivid international community. Many applications are readily available through pkgsrc, the NetBSD Packages Collection.","tags":[],"primary_open_source_license":"BSD 2-Clause \"Simplified\" or \"FreeBSD\" License (BSD-2-Clause)","image_url":"//lh3.googleusercontent.com/WXGpCx2tAOaA5uBEmiaVoYyEYhgjQ1-jRjroNAz1jwMi5sNJINsNHrv99qaYMoPvd8y7ZYGpENgjRb59ENwpzkHJN0h_57o","image_bg_color":null,"gplus_url":"https://plus.google.com/communities/109958803249810804963","twitter_url":"https://twitter.com/netbsd","blog_url":"https://blog.NetBSD.org/","application_instructions":"https://wiki.netbsd.org/projects/gsoc/","topic_tags":["kernel","userland","unix","packaging","bsd"],"technology_tags":["c","bsd make"],"proposal_tags":["kernel","userland","pkgsrc"],"ideas_list":"https://wiki.netbsd.org/projects/gsoc/","contact_method":"gsoc-admin@NetBSD.org","program_year":2018},"student":{"id":4812656721002496,"display_name":"R3x","program_year":2018},"abstract":"Port and Integrate the Kernel Address SANitizer(KASan) in the NetBSD kernel for amd64. Add a new kernel option that will compile the kernel with KASan. Also run Automated Testing Framework(ATF) tests against the kernel and report the bugs.","assignee_display_names":["kamil"],"program_year":2018},{"id":6740423263911936,"title":"Add statistics and machine learning functions to Boost.uBLAS","subcategory":"[gsoc18]","organization":{"id":4507228564881408,"name":"Boost C++ Libraries","slug":"boost-c-libraries","website_url":"http://www.boost.org/","category":"languages","contact_email":"","mailing_list":"http://www.boost.org/community/groups.html","irc_channel":"http://www.boost.org/community/irc.html","tagline":"Boost provides free peer-reviewed portable C++ source libraries","precis":"Boost provides free peer­reviewed portable C++ source libraries. We emphasize libraries that work well with the C++ Standard Library.","description":"Boost provides free peer-reviewed portable C++ source libraries.\n\nWe emphasize libraries that work well with the C++ Standard Library. Boost libraries are intended to be widely useful, and usable across a broad spectrum of applications. The Boost license encourages both commercial and non-commercial use.\n\nWe aim to establish \"existing practice\" and provide reference implementations so that Boost libraries are suitable for eventual standardization. Ten Boost libraries are included in the C++ Standards Committee's Library Technical Report (TR1) and in the new C++11 Standard. C++11 also includes several more Boost libraries in addition to those from TR1. More Boost libraries are proposed for standardization in C++17.\n\nSince 2006 an intimate week long annual conference related to Boost called C++ Now has been held in Aspen, Colorado each May. Boost has been a participant in the annual Google Summer of Code since 2007.","tags":[],"primary_open_source_license":"Boost Software License (BSL-1.0)","image_url":"//lh3.googleusercontent.com/kkg0_gw4dqFGqG4n0NpHKwtdmGotzAxO5zt09QniDCiPiyAvYzKEWW_LlNcX4aj4TcKUOsvsX6yAn-p8jhLIsnj-TkKNQRVe","image_bg_color":"c5c5c5","gplus_url":"https://plus.google.com/communities/101370509618769385701","twitter_url":null,"blog_url":null,"application_instructions":"After many extremely successful years of GSoC at Boost during, we are minded to keep in place the more rigorous candidate selection process which involves selecting every GSoC Boost candidate with a C++ programming test or provides links to at least 1,000 lines (excluding comments and whitespace) C++ library (not application nor solution) open source code. Then student shoud do the following:\n1. Review the list of ideas from previous GSoC (https://svn.boost.org/trac10/wiki/SoCPrevious), the archives of the Boost mailing list (http://www.boost.org/community/groups.html#main) relating to GSoC.\n2. Join the Boost mailing list and find a mentor who is an experienced Boost developer in one of the Boost libraries (http://www.boost.org/doc/libs/) and subscribe at http://lists.boost.org/mailman/listinfo.cgi/boost\n3. Read all posts tagged [gsoc18], then students should write a well researched and intelligent message with [gsoc18] at the front of the subject line to the mailing list seeking a mentor interested so that to write a GSoC proposal to be submitted to Google.\n4. Once a potential mentor and project idea is found, the student must write a project proposal which should follow this submission template https://svn.boost.org/trac10/wiki/SoCSubmissionTemplate\n\nPotential mentors may add precanned project ideas with programming competency tests to this page below as GSoC approaches. These may prove useful in starting a discussion with potential mentor(s) whom the student should approach directly.","topic_tags":["c++ development","c++ tools","c++ standardization","software engineering"],"technology_tags":["c++11","c++14","c++","c++17"],"proposal_tags":["[gsoc18]"],"ideas_list":"https://github.com/boostorg/boost/wiki/Boost-Google-Summer-of-Code-2018","contact_method":"http://www.boost.org/community/irc.html","program_year":2018},"student":{"id":5802368852033536,"display_name":"Dattatreya Mohapatra","program_year":2018},"abstract":"Boost.uBLAS employs numerous compile-time optimizations which improve the performance of matrix operations. However, there is no implementation of any application on matrices which can exploit this performance - like mean, variance, factorization etc. Providing some such fundamental functionalities for vectors and matrices in a single package would be a great addition to the uBLAS library.\nThe goal of this project is to lay out the foundation of uBLAS to support basic statistical analysis methods and machine learning algorithms. More specifically, I am interested in implementing the following fundamental components:\n- Basic statistics\n- Running statistics\n- Histograms - with custom number of bins and edges\n- KMeans clustering\n- Principal Component Analysis (PCA)\n- Gaussian Mixture Model - Expectation Maximization","assignee_display_names":["David Bellot","Mohd Sharique"],"program_year":2018},{"id":6744590523039744,"title":"Implementing Yara rules in Honeytrap","subcategory":"honeytrap","organization":{"id":5144878602780672,"name":"The Honeynet Project","slug":"the-honeynet-project","website_url":"https://honeynet.org/","category":"security","contact_email":"project@honeynet.org","mailing_list":"","irc_channel":"https://gsoc-slack.honeynet.org/","tagline":"The Honeynet Project - R&D for Honeypot/Honeynet Technology and InfoSec Research","precis":"The Honeynet Project is a non-profit research organization dedicated to improving the security of the Internet at no cost to the public. Focus is on honeypots and threat analysis.","description":"Founded in 1999, The Honeynet Project is an international, non-profit (501c3) research organization dedicated to improving the security of the Internet at no cost to the public.\n\nOur achievements are based on the principles of open source and volunteer efforts, with all software or papers created being licensed as open source and made freely available to the community.\n\nWe help coordinate the development, deployment, advancement and research findings of honeypot and anti-malware related technologies. With over 45 international chapters, 350 members and 30 open source research projects around around the world, we are a mature, highly diverse and international organization.\n\nSimply put, our goal is to make a difference. We accomplish this via:\n\nAwareness - We raise awareness of the threats and vulnerabilities that exist in the Internet today. Many individuals & organizations do not realize they are a target, nor understand who is attacking them, how, or why. We provide this information, so people can better understand that they are a target, and understand the basic measures they can take to mitigate these threats. This is provided through our Know Your Enemy series of papers.\n\nTools - For organizations interested in continuing their own research about cyber threats, we provide the tools and techniques we have developed. All tools are specifically licensed open source. Organizations all over the world use our tools.\n\nInformation - In addition to raising awareness, we provide details to better secure assets. Historically, information about attackers has been limited to the tools they use. We provide critical additional information, such as their motives in attacking, how they communicate, when they attack systems and their actions after compromising a system. We provide this service through our Know Your Enemy whitepapers and our periodic Scan of the Month challenges.\n\nThe Honeynet Project uses GSoC as a incubator for new R&D projects, and to recruit active new members.","tags":[],"primary_open_source_license":"MIT license (MIT)","image_url":"//lh3.googleusercontent.com/kWqF0bT_hHDVRLhg2pJhsFghmGZEWTTIqBSe5XOZKNDMyObRv__UjSH8d-Sf6eqvBxglXqtAD3u93Qzgqbv9vz4B_0-IXJo","image_bg_color":"000","gplus_url":null,"twitter_url":"https://twitter.com/ProjectHoneynet","blog_url":"https://honeynet.org/blog","application_instructions":"This year we have a wide range of project ideas and are also interested in hearing your ideas too. Our projects cover a wide range of programming languages and technologies. Project idea difficulty can range from fairly challenging, low level systems type projects that are likely to appeal to pretty confident programmers, through interesting data analysis, to data presentation projects building more effective user interfaces. We are always interested in discussing a student's own project ideas, and actively aim to mentor high quality student ideas too. If you are unsure, we can help you form your ideas during the student proposal submission period. If you want to find out more, take a look at our project ideas web page, subscribe to our blog and public GSoC questions mailing list.Then come and say hello on the #gsoc-honeynet IRC channel on irc.freenode.net (you can connect via webchat if you are behind a firewall or don't have a command line client too). There you should find a mix of organizational admins, project mentors, past successful GSoC students, general Honeynet Project members and prospective students, so please don’t be nervous - feel free to ask questions and we will always try and get back to you (although we may be idle for an hour or two when we sleep :) ). If you prefer email, check out the link to our mailing list or use project@honeynet.org. We are looking forwards to hearing from you and hopefully collaborating on something awesome together this summer.","topic_tags":["honeypots","malware","sandbox","deception","networking"],"technology_tags":["python 3"," python","golang","c/c++","machine learning"],"proposal_tags":["mitmproxy","honeytrap","drakvuf","holmes-processing","conpot","cuckoo-sandbox","thug","snare/tanner","libvmi","other"],"ideas_list":"https://honeynet.org/gsoc2018/ideas","contact_method":"project@honeynet.org","program_year":2018},"student":{"id":4642355697680384,"display_name":"CapacitorSet","program_year":2018},"abstract":"Yara is a pattern-matching DSL developed to describe malware families; in this project, it is used to describe malicious actors interacting with a honeypot. The final goal is to integrate Yara filtering and searching into Honeytrap, and writing Yara rules for common threats.","assignee_display_names":["Remco Verhoef"],"program_year":2018},{"id":6747222734012416,"title":"OpenDF - Implement the frontend using ReactJS","subcategory":"project name","organization":{"id":4886940868935680,"name":"Sustainable Computing Research Group (SCoRe)","slug":"sustainable-computing-research-group-score","website_url":"http://www.scorelab.org/","category":"web","contact_email":"info@scorelab.org","mailing_list":"https://groups.google.com/forum/#!forum/score-community","irc_channel":"https://gitter.im/scorelab","tagline":"SCoRe has conducted research covering various aspects of Security, Mobile & IOT.","precis":"SCoRe is a research group that seeks sustainable solutions for various problems in developing countries such as Sri Lanka.","description":"The Sustainable Computing Research Lab (SCoRe) has conducted research covering various aspects of mobile, cloud, iot, digital forensic, information security and more. The goal of our research is to generate computing solutions through identifying low-cost methodologies and strategies that lead to sustainability​.\n\nAt present, the SCoRe Lab is at a stage of its evolution in which it has been able to secure high donor confidence as evidenced by no less than 5 simultaneous foreign funded projects underway since 2005. SCoRe Lab has been a pioneer in cooperating with Internet Society (ISOC), Swedish Agency for International Development Cooperation (Sida)/The Department for Research Cooperation (SAREC), The Swedish Program for Information and Communication Technology in Developing Regions (Spider) and Information Society Innovation Fund (ISIF) in the area of computer science by establishing several interesting ICT research projects. These projects are considered to be the benchmarks of such projects in the World.","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/ZFptLfWpe6TE3cqTW6mWuIbimHgJw31TJOAmqBxpsQHPLcIlQRgCNwVtCogMKpFX8GPMCM84AwiWPlZqg_10UZ0psx4rjMw","image_bg_color":null,"gplus_url":"https://plus.google.com/108570130242535015491/","twitter_url":"https://twitter.com/scoreucsc","blog_url":"http://www.scorelab.org/blog/index.html","application_instructions":"## Project Introduction\n\nIn this section,\n* The student should first define the problem.\n* Current state of the problem.\n* What issue the student wishes to resolve?\n\n## Project Goals\n\nIn this section,\n\n* The student should propose a clear list of deliverables, explaining exactly what the student promises to do and what he/she does not plan to do.\n\n## Implementation\n\nIn this section,\n\n* The student should describe what he/she plans to do as a solution to the problem he/she defined earlier.\n\n## Timeline\n\nIn this section,\n\n* The student should define the project milestones(weekly) according to the GSoC timeline.\n\n## SCoRe Contributions\n\nIn this section,\n\n* The student should include his/her past contributions to the SCoRe Community.\nContribution Examples: Bug Reporting, Patchers (Github Pull Requests), Mailing List Activities\n\n## Personal Information\n\n* Contact information (E-mail, IM, IRC)\n* Few sentences about the student and why he/she thinks is the best person to do it.\n\n## Reference\n\nProject reference","topic_tags":["iot","web","mobile","machine learning","security"],"technology_tags":["android","java","go","node","pyth"],"proposal_tags":["project name","issue id","contributions"],"ideas_list":"http://www.scorelab.org/gsoc-2018/","contact_method":"info@scorelab.org","program_year":2018},"student":{"id":4880532102447104,"display_name":"Kavinda Jayakody","program_year":2018},"abstract":"The project is to rewrite the frontend of OpenDF with ReactJS and Redux. Some UI Components have been done and others will complete through the project. After completion the Frontend will be fully component based frontend. Also testings will be done for the newly created components.","assignee_display_names":["Pasan Ranathunga","Milindu Sanoj Kumarage"],"program_year":2018},{"id":6749472223133696,"title":"Datastories","subcategory":"daf","organization":{"id":6723597649838080,"name":"Developers Italia","slug":"developers-italia","website_url":"https://developers.italia.it","category":"other","contact_email":"teamdigitale@governo.it","mailing_list":null,"irc_channel":"https://slack.developers.italia.it","tagline":"An open community digital public services developers","precis":"We are a community dedicated to the development of software to support digital services for citizens. Born in the Italian government, but of course: code has no borders.","description":"Developers Italia is a community dedicated to the development of Open Source Software, created to support Italian digital public services.\r\n\r\nIt is a radical change in the way the Public Administration operates. Everything we are doing is operating with open standards and software, we are creating **SDKs** for the main programming languages and frameworks, we craft publicly documented **APIs**. We contribute to open projects, and the people we contract to improve the technology become **Open Source developers**.\r\n\r\nMost of the code is deployed within the Italian public institutions, but it is meant to be generic, in the hope that it will be useful to many other people around the world. Around these tools we are engaging a community of developers and innovators, **inside and outside Italy**, that can participate in all aspects of the creation of the new digital infrastructure.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/OOqmmf5_zcTRoKooubBJ3QPhRGJNa_baISWBxUgaEjV634bbYESXjxdw8SxL_S9KSnQ-7dWM8TLFUbO4EJAIV8xCmXmsGBhS","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/ITdigitalteam","blog_url":"https://medium.com/team-per-la-trasformazione-digitale/english/home","application_instructions":"# Remember: all ideas on the ideas page are... ideas! You can come up with your own proposal!\r\nHere's a short list to ensure you're applying the best way you can\r\n- Join the [Slack of Developers Italia](https://slack.developers.italia.it), introduce yourself, and meet your fellow developers\r\n- Read [Google's instructions for participating](https://developers.google.com/open-source/gsoc/) and the [GSoC Student Manual](https://developers.google.com/open-source/gsoc/resources/manual#student_manual)\r\n- Take a look at the list of ideas\r\n- Come up with project that you're interested in\r\n- Write a first draft proposal and get someone to review it\r\n- Remember: you must link to work such as commits in your proposal\r\n- Read [How to write a kickass proposal for GSoC](http://teom.org/blog/kde/how-to-write-a-kick-ass-proposal-for-google-summer-of-code/)\r\n- Submit your proposal and all necessary documents well ahead of the deadline\r\n\r\nA good start is finding out what the most pressing issues are in the projects in which you are interested. \r\nCheck out the github issues as well as join the relevant slack channels: meet developers and your potential mentor, as well as start learning the codebase. We recommend strongly getting involved in advance of the beginning of GSoC, and we will look favorably on applications from students who have already started to act like Open Source developers.\r\n\r\nAlways remember: this is a very brief instruction list - in any case of any doubts, just reach out to us, we're very happy to help new developers get started!","topic_tags":["government","open data","identity","data-science"],"technology_tags":["python","ruby","node.js"," java","c/c++"],"proposal_tags":["daf","spid","18app","design","security","pagopa","anpr","infrastructure"],"ideas_list":"https://developers.italia.it/en/gsoc-ideas/","contact_method":"teamdigitale@governo.it","program_year":2018},"student":{"id":5046943428902912,"display_name":"Costantino Carugno","program_year":2018},"abstract":"Italian Team Digitale is building the first “operating system” of a country. One of the technologies that it has implemented is the Data & Analytics Framework (DAF) which consists in a huge stack (more than 6000!) of public datasets and tools to work with them. These datasets concern very important matters in organizing and providing good quality services\nto citizens in diverse fields such as public health, education, transportation, finance etc. Unfortunately the data are not directly informative, they need to be organized, explored and analyzed; they have to be transformed in usable information that the public administration can use to improve its inner working and provide a better operational infrastructure.\nIn this paper I propose to carry on a series of data analysis in the form of “data stories”, a discussion about selected datasets and a description of the results obtained.","assignee_display_names":["Fabiana Lanotte","Gabriele Falasca","Fabio Fumarola"],"program_year":2018},{"id":6749583892283392,"title":"Music Blocks Widget Improvement","subcategory":"musicblocks","organization":{"id":6193990685163520,"name":"Sugar Labs","slug":"sugar-labs","website_url":"http://www.sugarlabs.org","category":"other","contact_email":"walter@sugarlabs.org","mailing_list":"http://lists.sugarlabs.org/listinfo/sugar-devel","irc_channel":"http://chat.sugarlabs.org","tagline":"We make tools that learners use to explore, discover, create, and reflect.","precis":"We make tools that learners use to explore, discover, create, and reflect. We encourage our users to appropriate them, taking ownership and responsibility for their learning.","description":"Sugar Labs, a volunteer-driven, non-profit organization, had its origins in the One Laptop Per Child project and is has been a member project of the Software Freedom Conservancy since 2008.\n\nAt Sugar Labs, we make a collection of tools (Sugar) that learners use to explore, discover, create, and reflect. We distribute these tools freely and encourage our users to appropriate them, taking ownership and responsibility for their learning.\n\nSugar is both a desktop and a collection of Activities. Activities, as the name implies, are Apps that involve active engagement from the learner. Activities automatically save results to a journal, where reflections are recorded. Activity instances can be shared between learners; many support real-time collaboration.\n\n* Sugar facilitates sharing and collaboration: Children can write, share books, or make music together with a single mouse-click.\n* Activities, not applications: Sugar activities are applicable beyond the scope of the classroom and even Sugar itself.\n* Automatic backup of Activity work; no worrying about files or folders. Sugar’s Journal makes it almost impossible to lose any data.\n* The Sugar Journal records everything you do: It is a place to reflect upon and evaluate your work.\n* Sugar runs on most computer hardware, including slower machines.\n* Sugar is Free (Libre) Software: It is written in the Python language and easily customized.\n* Sugar is documented by its users: It is easy to use and teachers worldwide have created a wealth of pedagogical materials for it.\n* Sugar is largely written and maintained by its users.\n* Sugarizer is a fork of Sugar available for tablets and phones.\n* Turtle Blocks and Music Blocks are popular programming Apps that run in Sugar, Sugarizer, or stand-alone on the GNU/Linux desktop or in a browser.","tags":[],"primary_open_source_license":"GNU General Public License version 3.0 (GPL-3.0)","image_url":"//lh3.googleusercontent.com/RI3mTCw0b7fjtH3bzBTORYAHB3gukbATUrchGxxqBufuZoXgJ5y2g3ThKxGF8TdB6-DZV5H84xVfUfWALf1qqtMEBlW7UUE","image_bg_color":null,"gplus_url":null,"twitter_url":null,"blog_url":null,"application_instructions":"Welcome to GSoC 2018\n\nSugar Labs expectations\n----------------------------------------\n* We expect you to be playful, inquisitive, and diligent;\n* GSoC is a full-time commitment; unless you are prepared to work full time, please do not apply;\n* GSoC is a community effort; be prepared to participate in the broader set of Sugar activities, not just your individual project;\n* GSoC is only valuable if there is good communication between you, your mentors, and the rest of the community; be prepared to hang out with us on irc.freenode.net #sugar; to meet weekly with all of the GSoC participants; and to communicate daily with your mentors; we also expect a weekly blog about your project.\n\n\nWhat to include in your proposal\n----------------------------------------------------\n* a clear statement of \"what\" you intend to do, including weekly milestones;\n* a clear statement of \"why\" what you intend to do is of value (personally, to the Sugar project, and beyond);\n* evidence that you can achieve your stated goals.\n\nFor more details, please go to [Sugar Labs GSoC 2018](https://wiki.sugarlabs.org/go/Summer_of_Code/2018).","topic_tags":["education","games","user interface","media","stem"],"technology_tags":["python","javascript","gtk+"],"proposal_tags":["sugar","python","javascript","sugarizer","musicblocks","learning","constructionism","gtk+"],"ideas_list":"https://wiki.sugarlabs.org/go/Summer_of_Code","contact_method":"walter@sugarlabs.org","program_year":2018},"student":{"id":6684222811537408,"display_name":"Ritwik Abhishek","program_year":2018},"abstract":"I will be designing pitch tracker, integrating software keyboard and fixing bugs for music blocks.","assignee_display_names":["Sachiko Nakajima","Devin Ulibarri","Kieren MacMillan"],"program_year":2018},{"id":6751679567888384,"title":"PSPAT Implementation in FreeBSD","subcategory":"kernel","organization":{"id":5814357166915584,"name":"FreeBSD","slug":"freebsd","website_url":"https://www.FreeBSD.org/","category":"operating_systems","contact_email":"soc-admins@FreeBSD.org","mailing_list":"https://lists.freebsd.org/mailman/listinfo/freebsd-hackers","irc_channel":"https://wiki.freebsd.org/SummerOfCodeIRC","tagline":"FreeBSD: The Foundation of the Internet","precis":"An advanced operating system for modern server, desktop, and embedded platforms which can be found powering everything from the smallest home routers to the world's busiest servers","description":"FreeBSD is an advanced operating system for modern server, desktop, and embedded computer platforms. FreeBSD provides advanced networking, impressive security features, and world class performance, and is used by some of the world's busiest web sites and most pervasive embedded networking and storage devices. From providing the foundation to the PlayStation 4 operating system, to Juniper's routers making up the backbone of the Internet, to being at the core of Apple's OSX and powering the servers Netflix use to stream terabits of video every second, chances are you are using FreeBSD right now without even realising it.\n\nThe FreeBSD Project began 25 years ago in 1993, but is based on the work of Berkeley CSRG with a history going back to 1978. Over those years the code base has gone through continuous development, improvement, and optimization. The FreeBSD Project is a large, mature, and yet relatively tightly knit organization, developed and maintained by a large team of individuals.\n\nThere are currently over 300 developers with write access to the main revision control system, and hundreds more with access to our Subversion servers for experimental and third party development.  This is also where our Summer of Code students have worked in previous years. We have an active mentoring program to bring all new developers into our community, not just those that we introduce to FreeBSD through the GSoC. There are hundreds of mailing lists, forums, blogs, IRC channels, and user groups all detailed on our main website. FreeBSD offers a complete operating system in which students can work, not just a kernel or specific userland stack. This allows for interesting work that spans the userland/kernel boundary.\n\nIn addition to producing an operating system, FreeBSD has incubated the development of key pieces of infrastructure which are used by other open source projects including bsnmp, jemalloc, libarchive, and OpenPAM.","tags":[],"primary_open_source_license":"BSD 2-Clause \"Simplified\" or \"FreeBSD\" License (BSD-2-Clause)","image_url":"//lh3.googleusercontent.com/4MDzw_NjNaZ5AM-CCoMRmYEQSaGNCoBsTrlYnZLM3w7QNv9s29jkgeEwwpRD4ZNgH7RF6u4BtcxFlgJq6NG_SgGGJ8-ugQ","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/freebsd","blog_url":"https://planet.FreeBSD.org/","application_instructions":"Please look at our [instructions for applying with FreeBSD](https://gsoc.FreeBSD.org/) which includes lots of details on producing a good proposal that stands a better chance of being accepted.  We recommend that you submit your proposals as early as possible, as that gives us the opportunity to comment on your proposals and allow you to refine them.  We also recommend that you discuss proposals with possible mentors beforehand too in order to make sure your proposal is achievable and worthwhile.","topic_tags":["virtualization"," kernel","cloud","embedded systems","security"],"technology_tags":["c/c++","llvm"," shell script","assembly","make"],"proposal_tags":["kernel","ports","embedded","security","userland","build-chain"],"ideas_list":"https://wiki.freebsd.org/SummerOfCodeIdeas","contact_method":"soc-admins@FreeBSD.org","program_year":2018},"student":{"id":4967467542118400,"display_name":"Sumit Lakra","program_year":2018},"abstract":"PSPAT or Parallel Scheduling and Parallel Transmission is a new and complete packet scheduling architecture. It is aimed at systems that can generate tens of millions of network packets per second, ex. dedicated Cloud environments that run Virtual Machines. Most hardware and packet schedulers in use today fail to be fully efficient under such high load conditions. PSPAT also happens to be independant of the packet scheduling algorithms that can be used with it. The central idea of PSPAT is to get rid of queuing structures which use locks and thus often often bottleneck the performance of the entire system, even when running on multiple processors and with links that have high packet transfer rates.","assignee_display_names":["Alexander Chernikov","Giuseppe Lettieri"],"program_year":2018},{"id":6751970149269504,"title":"Move the apt.llvm.org CI to OBS","subcategory":"","organization":{"id":6471192286855168,"name":"LLVM Compiler Infrastructure","slug":"llvm-compiler-infrastructure","website_url":"http://llvm.org","category":"languages","contact_email":"llvm-dev@lists.llvm.org","mailing_list":"http://lists.llvm.org/cgi-bin/mailman/listinfo/llvm-dev","irc_channel":"http://llvm.org/docs/#irc","tagline":"LLVM Compiler Infrastructure","precis":"The LLVM Project is a collection of modular and reusable compiler and toolchain technologies.","description":"The LLVM Project is a collection of modular and reusable compiler and toolchain technologies. Despite its name, LLVM has little to do with traditional virtual machines. LLVM began as a research project at the University of Illinois, with the goal of providing a modern, SSA-based compilation strategy capable of supporting both static and dynamic compilation of arbitrary programming languages. Since then, LLVM has grown to be an umbrella project consisting of a number of different subprojects, many of which are being used in production by a wide variety of commercial and open source projects as well as being widely used in academic research.\n\nThe primary sub-projects of LLVM are:\n*  The LLVM Core libraries provide a modern source- and target-independent optimizer, along with code generation support for many popular CPUs. These libraries are built around a well specified code representation known as the LLVM intermediate representation (\"LLVM IR\").\n*  Clang is an \"LLVM native\" C/C++/Objective-C compiler, which aims to deliver amazingly fast compiles, extremely useful error and warning messages and to provide a platform for building great source level tools. The Clang Static Analyzer is a clang-based tool that automatically finds bugs in your code.\n*  The LLDB project builds on libraries provided by LLVM and Clang to provide a great native debugger on top of Clang and LLVM libraries.\n*  The libc++ and libc++ ABI projects provide a standard conformant and high-performance implementation of the C++ Standard Library.\n*  The polly project implements a suite of cache-locality optimizations as well as auto-parallelism and vectorization using a polyhedral model.\n*  The lld project aims to be the built-in linker for clang/llvm. Currently, clang must invoke the system linker to produce executables.\n\nIn addition to official subprojects of LLVM, there are a broad variety of other projects that use components of LLVM for various tasks.","tags":[],"primary_open_source_license":"University of Illinois/NCSA Open Source License (NCSA)","image_url":"//lh3.googleusercontent.com/DBWjJG0U8zHLJxff5uZpE36V0p7XuSkaE8RWMYUeabVcmP5cyPlviIKCW3-rNCp_9hD37sEOT6Qks4YgHhGLiWLDD1cnVlCu","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/llvmorg","blog_url":"http://blog.llvm.org","application_instructions":"We strongly suggest each proposal to be discussed first at the corresponding sub-project mailing list (e.g. llvm-dev, cfe-dev, etc.) Prior patch submission to LLVM (or its subprojects) is recommended, but not strictly required. Please also indicate your prior knowledge with LLVM, whether you already contributed to it, etc.","topic_tags":["compilers","compiler api"],"technology_tags":["llvm"],"proposal_tags":["llvm","clang","polly","lld"],"ideas_list":"http://llvm.org/OpenProjects.html#gsoc18","contact_method":"llvm-dev@lists.llvm.org","program_year":2018},"student":{"id":6229706890805248,"display_name":"Reshabh Sharma","program_year":2018},"abstract":"LLVM uses a Jenkins instance and Jenkins-Debian-Glue to build LLVM, Clang, clang extra tools, compiler-rt, polly, LLDB and LLD packages for the stable, stabilization and development branches. These Debian and Ubuntu repositories are hosted on apt[dot]llvm[dot]org. This GSoC I plan to deploy an instance of Open Build Service (OBS) and port the various scripts and packages to this platform such that it don't change the present user interaction.","assignee_display_names":["Sylvestre Ledru"],"program_year":2018},{"id":6751995247984640,"title":"Vega-Share","subcategory":"ecosystem","organization":{"id":5646868357316608,"name":"The Vega Visualization Tools by the UW Interactive Data Lab","slug":"interactive-data-lab-at-the-university-of-washington","website_url":"https://vega.github.io/","category":"data_and_databases","contact_email":null,"mailing_list":"https://groups.google.com/forum/?fromgroups=#!forum/vega-js","irc_channel":"https://communityinviter.com/apps/vega-js/join","tagline":"Declarative formats & Applications for Creating, Saving & Sharing Visualizations","precis":"An ecosystem of languages and graphical user interfaces for authoring, saving, and sharing interactive visualizations, created by the research lab that created D3.js.","description":"Over years working in data visualization, we’ve sought to build tools that help designers craft sophisticated graphics, including systems such as Prefuse, Protovis and D3.js. However, in the grand scheme of things, “artisanal” visualizations hand-coded by skilled designers are the exception, not the rule. The vast majority of the world’s visualizations instead are produced using end-user applications such as spreadsheets and business intelligence tools. While valuable, these tools often fall short of fully supporting the iterative, interactive process of data analysis. Improved tools could help a larger swath of people create effective visualizations and better understand their data.\nThe goal of the Vega project is to promote an ecosystem of usable and interoperable visualization tools, supporting use cases ranging from exploratory data analysis to effective communication via custom visualization design.\nThis goal has led us to develop not a singular system, but rather a stack of tools for interactive data visualization. At the foundation of this stack is the Vega visualization grammar. Similar to how SQL provides a language for expressing database queries, Vega provides a declarative language for describing interactive visualizations with primitive building blocks such as data, transforms, marks, and event streams.  On top of Vega, Vega-Lite provides a concise language for rapidly generating statistical graphics to support data analysis.  With Vega and Vega-Lite, we have built a number of graphical user interfaces including the Voyager visualization tool, which blends manual and automated chart authoring to facilitate exploratory data analysis. \nTools from the Vega ecosystems have been adopted by the Jupyter/Python data science communities, Wikipedia, and leading tech companies including Apple, Google, Microsoft, Netflix, FitBit, and Twitter.","tags":[],"primary_open_source_license":"BSD 3-Clause \"New\" or \"Revised\" License (BSD-3-Clause)","image_url":"//lh3.googleusercontent.com/SpPtZ6sYc5OVjLDRkPVEYbLOEaAATKi3_2XrrZb7a-zaAnuicKkjEnifBbL-Kw2Etalj9m3ip8ukIg-mUDSSxg3SCcwgu9E","image_bg_color":null,"gplus_url":null,"twitter_url":"https://twitter.com/vega_vis","blog_url":"http://medium.com/@uwdata","application_instructions":"Students who want to apply to the Vega project should submit at least one patch through GitHub before submitting an application. The reason that we require this is to make sure that  you can set up your development environment and work with the development infrastructure. A possible patch can be a new tutorial, a new example visualization, or a bug fix for any issue. A list of examples that could be implemented is at https://github.com/vega/vega-lite/issues/1486. We have also marked issues that we think are suitable for newcomers on GitHub : https://github.com/vega/vega-lite/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+first+issue%22. \n\nA complete GSoC application should include a presentation of yourself. The ideal candidate should demonstrate excitements and the ability to successfully finish a project. To help you convince us, we encourage applications with a project plan. Our list of suggested projects (http://bit.ly/vega-gsoc-2018) is not exhaustive, and more importantly, each idea only includes a summary of what could be done. An application should describe how you think the project may be split up into milestones. For any UI projects, having initial mockups would be helpful. Proposals that affect the declarative specification should include examples. \n\nMake sure to read the GSoC Student Guide at http://write.flossmanuals.net/gsocstudentguide/writing-a-proposal/.","topic_tags":["data visualization","visualization grammar","data science","declarative language","plotting tools"],"technology_tags":["javascript","typescript","react","d3.js"],"proposal_tags":["new feature","ecosystem","bugfixes","documentations","examples"],"ideas_list":"https://docs.google.com/document/d/1YKBzT-aTrKGxA-G6ktzRSIC-ihc3JCWmNW5k7OL85nA/edit?usp=sharing","contact_method":"https://communityinviter.com/apps/vega-js/join","program_year":2018},"student":{"id":6359416446648320,"display_name":"Yash Dev Lamba","program_year":2018},"abstract":"The project aims to create a platform for hosting and sharing Vega and Vega-Lite visualizations as well as integrating the share functionality with the current editor. It will facilitate a user to save, fork and share any visualization on the web. It is designed keeping in mind about user-benefits and covers everything from backend to frontend with few new features. It will be a specialized platform for declarative Vega and Vega-Lite visualizations that lowers the barrier to entry into the ecosystem. Hence improving the ecosystem.","assignee_display_names":["Dominik Moritz"],"program_year":2018},{"id":6752519368212480,"title":"Suggestions sorting improvement, migration to the modern server-side framework, migration from Maven to Gradle","subcategory":"artificial-intelligence","organization":{"id":6055501880623104,"name":"languagetool.org","slug":"languagetoolorg","website_url":"https://languagetool.org","category":"end_user_applications","contact_email":"daniel.naber@languagetool.org","mailing_list":"https://forum.languagetool.org","irc_channel":null,"tagline":"Style and grammar checker","precis":"LanguageTool is a multi-language proofreading tool. It can be used on the web, via HTTP API, or as a Java API.","description":"### What\n\nLanguageTool scans texts for style, spelling, and grammar errors. In some cases, it can even find semantic issues. For example, what could be wrong about \"Thursday, 27 June 2017\"? Well, 27 June 2017 was not on a Thursday, and LanguageTool detects that.\n\nLanguageTool supports more than 20 languages (to a different degree), including English, Russian, German, Polish, Spanish, and French.\n\n### How\n\nInternally, LanguageTool uses four different approaches to find errors:\n* it scans for known error pattern with a pattern languages similar to regular expressions, but more powerful\n* it uses Java code to find errors that are too complex for the error-pattern approach\n* it uses statistics to find uncommon sequences of words\n* it uses artificial intelligence to see if commonly confused words are used properly (like ad/add or cease/seize)\n\n### The Future\n\nArtificial intelligence will be the main approach in the future to detect text errors. We're looking for your help and ideas to apply AI to the proofreading problem, for example by using a seq2seq approach like in machine translation.\n\nLanguageTool is also an end user application, and users want LanguageTool to be integrated in the software they already use. We're looking for integrations into tinyMCE, CKEditor, and many others (your suggestions are welcome). Plus, the existing browser add-on for Firefox and Chrome needs major UI improvements.","tags":[],"primary_open_source_license":"GNU Library or \"Lesser\" General Public License version 2.1 (LGPL-2.1)","image_url":"//lh3.googleusercontent.com/CPpkJMcdc1eqEOFgZJvynGCeeuhxqv27U_Q7ag1i16Qiy9yqcZ1AM1xOjrKrSHs5YGchUnQm_BRDKhdFJdUTrZlKK39owA","image_bg_color":"ffffff","gplus_url":null,"twitter_url":"https://twitter.com/languagetoolorg","blog_url":null,"application_instructions":"Requirements depend on what part of LanguageTool you'd like to work on:\n\n**User interface / browser add-on**\n* requires knowledge of Javascript and web technologies\n\n**Core logic of error detection, using AI**\n* requires knowledge of at least one machine learning framework\n* requires enough Java knowledge to integrate the results (not necessarily the training) into our existing Java code\n\n**Core logic of error detection**\n* requires good knowledge of Java and being a native speaker of the language you're going to improve the error detection for\n\nIn any case, we expect you to have a close look at our ideas list at http://wiki.languagetool.org/missing-features and check out the existing code at https://github.com/languagetool-org/. Once you have a better idea of what you'd like to do, please contact us at https://forum.languagetool.org to introduce yourself. We'll try to find a small task for you get started. Or even better, you fix one of the existing bugs and submit a pull request.","topic_tags":["artificial intelligence","language","edtech","education","nlp"],"technology_tags":["java","javascript","machine learning","ai","tensorflow"],"proposal_tags":["browser-add-on","artificial-intelligence","integration"],"ideas_list":"http://wiki.languagetool.org/missing-features","contact_method":"daniel.naber@languagetool.org","program_year":2018},"student":{"id":6203029171208192,"display_name":"Oleg Serikov","program_year":2018},"abstract":"During the GSoC I'm going to complete the following tasks:\n1. Enhance the suggestions sorting algorithm using the ML-way inspired by [after the deadline](https://open.afterthedeadline.com/about/technology-overview)'s (section \"The Spelling Corrector\")\n2. Migrate the server-side of the LanguageTool to the modern lightweight framework\n3. Migrate the LanguageTool from Maven to Gradle","assignee_display_names":["Yakov Reztsov"],"program_year":2018}]}